TexasInstruments/f29h85x-sdk/source/driverlib/inc/hw_sysctl.h
//###########################################################################
//
// FILE:    hw_sysctl.h
//
// TITLE:   Definitions for the SYSCTL registers.
//
//###########################################################################
// //
//	Copyright: Copyright (C) Texas Instruments Incorporated
//	All rights reserved not granted herein.
//
//  Redistribution and use in source and binary forms, with or without 
//  modification, are permitted provided that the following conditions 
//  are met:
//
//  Redistributions of source code must retain the above copyright 
//  notice, this list of conditions and the following disclaimer.
//
//  Redistributions in binary form must reproduce the above copyright
//  notice, this list of conditions and the following disclaimer in the 
//  documentation and/or other materials provided with the   
//  distribution.
//
//  Neither the name of Texas Instruments Incorporated nor the names of
//  its contributors may be used to endorse or promote products derived
//  from this software without specific prior written permission.
//
//  THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS 
//  "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT 
//  LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
//  A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT 
//  OWNER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, 
//  SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT 
//  LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
//  DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
//  THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT 
//  (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE 
//  OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
//

//###########################################################################

#ifndef HW_SYSCTL_H
#define HW_SYSCTL_H

//*************************************************************************************************
//
// The following are defines for the SYSCTL register offsets
//
//*************************************************************************************************
#define SYSCTL_O_DEVCFGLOCK1                 0x0U     // Lock bit for PERxSYSCONFIG0-31 registers
#define SYSCTL_O_DEVCFGLOCK2                 0x4U     // Lock bit for DEVCFG registers
#define SYSCTL_O_DEVCFGLOCK3                 0x8U     // Lock bit for PERxSYSCONFIG32-63 registers
#define SYSCTL_O_DEVCFGLOCK4                 0xCU     // Lock bit for PERxSYSCONFIG64-95 registers
#define SYSCTL_O_DEVCFGLOCK5                 0x10U    // Lock bit for PERxSYSCONFIG96-127 registers
#define SYSCTL_O_PARTIDL                     0x20U    // Lower 32-bit of Device PART Identification
                                                      // Number
#define SYSCTL_O_PARTIDH                     0x24U    // Upper 32-bit of Device PART Identification
                                                      // Number
#define SYSCTL_O_REVID                       0x28U    // Device Revision Number
#define SYSCTL_O_MCUCNF1                     0x1C0U   // MCUCNF Capability: EMIF Customization
#define SYSCTL_O_MCUCNF2                     0x1C4U   // MCUCNF Capability: EPWM
#define SYSCTL_O_MCUCNF4                     0x1CCU   // MCUCNF Capability: EQEP
#define SYSCTL_O_MCUCNF7                     0x1D8U   // MCUCNF Capability: UART
#define SYSCTL_O_MCUCNF10                    0x1E4U   // MCUCNF Capability: CAN, MCAN
#define SYSCTL_O_MCUCNF13                    0x1F0U   // MCUCNF Capability: AMCUCNF
#define SYSCTL_O_MCUCNF14                    0x1F4U   // MCUCNF Capability: CMPSS
#define SYSCTL_O_MCUCNF16                    0x1FCU   // MCUCNF Capability: DAC
#define SYSCTL_O_MCUCNF17                    0x200U   // MCUCNF Capability: CLB
#define SYSCTL_O_MCUCNF18                    0x204U   // MCUCNF Capability: FSI
#define SYSCTL_O_MCUCNF19                    0x208U   // MCUCNF Capability: LIN
#define SYSCTL_O_MCUCNF23                    0x218U   // MCUCNF Capability: EtherCAT
#define SYSCTL_O_MCUCNF26                    0x224U   // Device Capability: HSM-Crypto Engines AES,
                                                      // SHA, PKA, TRNG
#define SYSCTL_O_MCUCNF31                    0x238U   // Device Capability: HSM-Crypto Engines SM2,
                                                      // SM3, SM4
#define SYSCTL_O_MCUCNF64                    0x2BCU   // MCUCNF Capability: MCUCNF level,
                                                      // Processing Block, RTDMA Customization
#define SYSCTL_O_MCUCNF65                    0x2C0U   // MCUCNF Capability: On-chip SRAM
                                                      // Customization
#define SYSCTL_O_MCUCNF74                    0x2E4U   // MCUCNF Capability: FLC1.B0/B1
#define SYSCTL_O_MCUCNF76                    0x2ECU   // MCUCNF Capability: FLC1.B2/B3
#define SYSCTL_O_MCUCNF78                    0x2F4U   // MCUCNF Capability: FLC1.B4 256KB Data
                                                      // Flash
#define SYSCTL_O_MCUCNF79                    0x2F8U   // MCUCNF Capability: FLC2.B0/B1
#define SYSCTL_O_MCUCNF81                    0x300U   // MCUCNF Capability: FLC2.B2/B3
#define SYSCTL_O_MCUCNFLOCK1                 0x33CU   // Lock bit for MCUCNFx registers
#define SYSCTL_O_MCUCNFLOCK3                 0x344U   // Lock bit for MCUCNFx registers
#define SYSCTL_O_LSEN                        0x348U   // Lockstep enable configuration
#define SYSCTL_O_EPWMXLINKCFG                0x37CU   // Confugure which EPWM module instaces are
                                                      // linked in the XLINK scheme
#define SYSCTL_O_SICCONFIG                   0x384U   // Safety Interconnect(SIC) Configuration -
                                                      // Enable and READY TIMEOUT value
#define SYSCTL_O_RSTSTAT                     0x3B0U   // Reset Status register for secondary CPUs
#define SYSCTL_O_LPMSTAT                     0x3B4U   // LPM Status Register for secondary CPUs
#define SYSCTL_O_TAP_STATUS                  0x3CCU   // Status of JTAG State machine & Debugger
                                                      // Connect
#define SYSCTL_O_TAP_CONTROL                 0x3D0U   // Disable TAP control
#define SYSCTL_O_DEVLIFECYCLE                0x3D4U   // Reflect the state of the Device Life Cycle
                                                      // signals reported from the HSM
#define SYSCTL_O_SDFMTYPE                    0x47CU   // Configures SDFM Type for the device
#define SYSCTL_O_SYNCSELECT                  0x4ACU   // Sync Input and Output Select Register
#define SYSCTL_O_ADCSOCOUTSELECT             0x4B0U   // External ADCSOC Select Register (PWM1-16)
#define SYSCTL_O_ADCSOCOUTSELECT1            0x4B4U   // External ADCSOC Select Register (PWM17-32)
#define SYSCTL_O_SYNCSOCLOCK                 0x4B8U   // SYNCSEL and ADCSOC Select Lock register
#define SYSCTL_O_HSMTOCPU_STS1               0x4DCU   // HSM to C29x Signal Status1
#define SYSCTL_O_HSMTOCPU_STS2               0x4E0U   // HSM to C29x Signal Status2
#define SYSCTL_O_HSM_SECURE_BOOT_INFO_REG0   0x4E4U   // Status information of the secure boot
                                                      // process HSM to CPU1
#define SYSCTL_O_HSM_SECURE_BOOT_INFO_REG1   0x4E8U   // Status information of the secure boot
                                                      // process HSM to CPU1
#define SYSCTL_O_HSM_SECURE_BOOT_INFO_REG2   0x4ECU   // Status information of the secure boot
                                                      // process HSM to CPU1
#define SYSCTL_O_HSM_SECURE_BOOT_INFO_REG3   0x4F0U   // Status information of the secure boot
                                                      // process HSM to CPU1
#define SYSCTL_O_HSM_SECURE_BOOT_INFO_REG4   0x4F4U   // Status information of the secure boot
                                                      // process HSM to CPU1
#define SYSCTL_O_HSM_SECURE_BOOT_INFO_REG5   0x4F8U   // Status information of the secure boot
                                                      // process HSM to CPU1
#define SYSCTL_O_HSM_SECURE_BOOT_INFO_REG6   0x4FCU   // Status information of the secure boot
                                                      // process HSM to CPU1
#define SYSCTL_O_HSM_SECURE_BOOT_INFO_REG7   0x500U   // Status information of the secure boot
                                                      // process HSM to CPU1
#define SYSCTL_O_SOC_SECURE_BOOT_INFO_REG0   0x504U   // Status information of the secure boot
                                                      // process CPU1 to HSM
#define SYSCTL_O_SOC_SECURE_BOOT_INFO_REG1   0x508U   // Status information of the secure boot
                                                      // process CPU1 to HSM
#define SYSCTL_O_SOC_SECURE_BOOT_INFO_REG2   0x50CU   // Status information of the secure boot
                                                      // process CPU1 to HSM
#define SYSCTL_O_SOC_SECURE_BOOT_INFO_REG3   0x510U   // Status information of the secure boot
                                                      // process CPU1 to HSM
#define SYSCTL_O_SOC_SECURE_BOOT_INFO_REG4   0x514U   // Status information of the secure boot
                                                      // process CPU1 to HSM
#define SYSCTL_O_SOC_SECURE_BOOT_INFO_REG5   0x518U   // Status information of the secure boot
                                                      // process CPU1 to HSM
#define SYSCTL_O_SOC_SECURE_BOOT_INFO_REG6   0x51CU   // Status information of the secure boot
                                                      // process CPU1 to HSM
#define SYSCTL_O_SOC_SECURE_BOOT_INFO_REG7   0x520U   // Status information of the secure boot
                                                      // process CPU1 to HSM
#define SYSCTL_O_CLKCFGLOCK1                 0x524U   // Lock bit for CLKCFG registers
#define SYSCTL_O_CLKSRCCTL1                  0x530U   // Clock Source Control register-1
#define SYSCTL_O_CLKSRCCTL2                  0x534U   // Clock Source Control register-2
#define SYSCTL_O_CLKSRCCTL3                  0x538U   // Clock Source Control register-3
#define SYSCTL_O_SYSPLLCTL1                  0x53CU   // SYSPLL Control register-1
#define SYSCTL_O_SYSPLLMULT                  0x548U   // SYSPLL Multiplier register
#define SYSCTL_O_SYSPLLSTS                   0x54CU   // SYSPLL Status register
#define SYSCTL_O_SYSCLKDIVSEL                0x564U   // System Clock Divider Select register
#define SYSCTL_O_PERCLKDIVSEL                0x56CU   // Peripheral Clock Divider Select register
#define SYSCTL_O_XCLKOUTDIVSEL               0x570U   // XCLKOUT Divider Select register
#define SYSCTL_O_HSMCLKDIVSEL                0x574U   // HSM SYSCLK Divider Select register
#define SYSCTL_O_MCANCLKDIVSEL               0x578U   // MCAN Bit Clock Divider Select register
#define SYSCTL_O_CLBCLKCTL                   0x57CU   // CLB Clocking Control Register
#define SYSCTL_O_MCDCR                       0x584U   // Missing Clock Detect Control Register
#define SYSCTL_O_X1CNT                       0x588U   // 10-bit Counter on X1 Clock
#define SYSCTL_O_XTALCR                      0x58CU   // XTAL Control Register
#define SYSCTL_O_XTALCR2                     0x59CU   // XTAL Control Register for pad init
#define SYSCTL_O_ETHERCATCLKCTL              0x5A8U   // EtherCAT Clock Control
#define SYSCTL_O_ETHERCATCTL                 0x5ACU   // ETHERCAT control register.
#define SYSCTL_O_SYNCBUSY                    0x5B0U   // Pulse Transfer Sync Busy Status register
#define SYSCTL_O_ESMXRSNCTL                  0x5C0U   // Enable ESM reset outputs for XRSn
#define SYSCTL_O_EPWM1                       0x5C8U   // PER2SYSCONFIG -  Peripheral System
                                                      // Configuration for EPWM1
#define SYSCTL_O_EPWM2                       0x5CCU   // PER3SYSCONFIG -  Peripheral System
                                                      // Configuration for EPWM2
#define SYSCTL_O_EPWM3                       0x5D0U   // PER4SYSCONFIG -  Peripheral System
                                                      // Configuration for EPWM3
#define SYSCTL_O_EPWM4                       0x5D4U   // PER5SYSCONFIG -  Peripheral System
                                                      // Configuration for EPWM4
#define SYSCTL_O_EPWM5                       0x5D8U   // PER6SYSCONFIG -  Peripheral System
                                                      // Configuration for EPWM5
#define SYSCTL_O_EPWM6                       0x5DCU   // PER7SYSCONFIG -  Peripheral System
                                                      // Configuration for EPWM6
#define SYSCTL_O_EPWM7                       0x5E0U   // PER8SYSCONFIG -  Peripheral System
                                                      // Configuration for EPWM7
#define SYSCTL_O_EPWM8                       0x5E4U   // PER9SYSCONFIG -  Peripheral System
                                                      // Configuration for EPWM8
#define SYSCTL_O_EPWM9                       0x5E8U   // PER10SYSCONFIG -  Peripheral System
                                                      // Configuration for EPWM9
#define SYSCTL_O_EPWM10                      0x5ECU   // PER11SYSCONFIG -  Peripheral System
                                                      // Configuration for EPWM10
#define SYSCTL_O_EPWM11                      0x5F0U   // PER12SYSCONFIG -  Peripheral System
                                                      // Configuration for EPWM11
#define SYSCTL_O_EPWM12                      0x5F4U   // PER13SYSCONFIG -  Peripheral System
                                                      // Configuration for EPWM12
#define SYSCTL_O_EPWM13                      0x5F8U   // PER14SYSCONFIG -  Peripheral System
                                                      // Configuration for EPWM13
#define SYSCTL_O_EPWM14                      0x5FCU   // PER15SYSCONFIG -  Peripheral System
                                                      // Configuration for EPWM14
#define SYSCTL_O_EPWM15                      0x600U   // PER16SYSCONFIG -  Peripheral System
                                                      // Configuration for EPWM15
#define SYSCTL_O_EPWM16                      0x604U   // PER17SYSCONFIG -  Peripheral System
                                                      // Configuration for EPWM16
#define SYSCTL_O_EPWM17                      0x608U   // PER18SYSCONFIG -  Peripheral System
                                                      // Configuration for EPWM17
#define SYSCTL_O_EPWM18                      0x60CU   // PER19SYSCONFIG -  Peripheral System
                                                      // Configuration for EPWM18
#define SYSCTL_O_HRCAL0                      0x614U   // PER21SYSCONFIG -  Peripheral System
                                                      // Configuration for HRCAL0
#define SYSCTL_O_HRCAL1                      0x618U   // PER22SYSCONFIG -  Peripheral System
                                                      // Configuration for HRCAL1
#define SYSCTL_O_HRCAL2                      0x61CU   // PER23SYSCONFIG -  Peripheral System
                                                      // Configuration for HRCAL2
#define SYSCTL_O_ECAP1                       0x620U   // PER24SYSCONFIG -  Peripheral System
                                                      // Configuration for ECAP1
#define SYSCTL_O_ECAP2                       0x624U   // PER25SYSCONFIG -  Peripheral System
                                                      // Configuration for ECAP2
#define SYSCTL_O_ECAP3                       0x628U   // PER26SYSCONFIG -  Peripheral System
                                                      // Configuration for ECAP3
#define SYSCTL_O_ECAP4                       0x62CU   // PER27SYSCONFIG -  Peripheral System
                                                      // Configuration for ECAP4
#define SYSCTL_O_ECAP5                       0x630U   // PER28SYSCONFIG -  Peripheral System
                                                      // Configuration for ECAP5
#define SYSCTL_O_ECAP6                       0x634U   // PER29SYSCONFIG -  Peripheral System
                                                      // Configuration for ECAP6
#define SYSCTL_O_EQEP1                       0x638U   // PER30SYSCONFIG -  Peripheral System
                                                      // Configuration for EQEP1
#define SYSCTL_O_EQEP2                       0x63CU   // PER31SYSCONFIG -  Peripheral System
                                                      // Configuration for EQEP2
#define SYSCTL_O_EQEP3                       0x640U   // PER32SYSCONFIG -  Peripheral System
                                                      // Configuration for EQEP3
#define SYSCTL_O_EQEP4                       0x644U   // PER33SYSCONFIG -  Peripheral System
                                                      // Configuration for EQEP4
#define SYSCTL_O_EQEP5                       0x648U   // PER34SYSCONFIG -  Peripheral System
                                                      // Configuration for EQEP5
#define SYSCTL_O_EQEP6                       0x64CU   // PER35SYSCONFIG -  Peripheral System
                                                      // Configuration for EQEP6
#define SYSCTL_O_SDFM1                       0x650U   // PER36SYSCONFIG -  Peripheral System
                                                      // Configuration for SDFM1
#define SYSCTL_O_SDFM2                       0x654U   // PER37SYSCONFIG -  Peripheral System
                                                      // Configuration for SDFM2
#define SYSCTL_O_SDFM3                       0x658U   // PER38SYSCONFIG -  Peripheral System
                                                      // Configuration for SDFM3
#define SYSCTL_O_SDFM4                       0x65CU   // PER39SYSCONFIG -  Peripheral System
                                                      // Configuration for SDFM4
#define SYSCTL_O_UARTA                       0x660U   // PER40SYSCONFIG -  Peripheral System
                                                      // Configuration for UARTA
#define SYSCTL_O_UARTB                       0x664U   // PER41SYSCONFIG -  Peripheral System
                                                      // Configuration for UARTB
#define SYSCTL_O_UARTC                       0x668U   // PER42SYSCONFIG -  Peripheral System
                                                      // Configuration for UARTC
#define SYSCTL_O_UARTD                       0x66CU   // PER43SYSCONFIG -  Peripheral System
                                                      // Configuration for UARTD
#define SYSCTL_O_UARTE                       0x670U   // PER44SYSCONFIG -  Peripheral System
                                                      // Configuration for UARTE
#define SYSCTL_O_UARTF                       0x674U   // PER45SYSCONFIG -  Peripheral System
                                                      // Configuration for UARTF
#define SYSCTL_O_SPIA                        0x678U   // PER46SYSCONFIG -  Peripheral System
                                                      // Configuration for SPIA
#define SYSCTL_O_SPIB                        0x67CU   // PER47SYSCONFIG -  Peripheral System
                                                      // Configuration for SPIB
#define SYSCTL_O_SPIC                        0x680U   // PER48SYSCONFIG -  Peripheral System
                                                      // Configuration for SPIC
#define SYSCTL_O_SPID                        0x684U   // PER49SYSCONFIG -  Peripheral System
                                                      // Configuration for SPID
#define SYSCTL_O_SPIE                        0x688U   // PER50SYSCONFIG -  Peripheral System
                                                      // Configuration for SPIE
#define SYSCTL_O_I2CA                        0x68CU   // PER51SYSCONFIG -  Peripheral System
                                                      // Configuration for I2CA
#define SYSCTL_O_I2CB                        0x690U   // PER52SYSCONFIG -  Peripheral System
                                                      // Configuration for I2CB
#define SYSCTL_O_PMBUSA                      0x694U   // PER53SYSCONFIG -  Peripheral System
                                                      // Configuration for PMBUSA
#define SYSCTL_O_LINA                        0x698U   // PER54SYSCONFIG -  Peripheral System
                                                      // Configuration for LINA
#define SYSCTL_O_LINB                        0x69CU   // PER55SYSCONFIG -  Peripheral System
                                                      // Configuration for LINB
#define SYSCTL_O_MCANA                       0x6A0U   // PER56SYSCONFIG -  Peripheral System
                                                      // Configuration for MCANA
#define SYSCTL_O_MCANB                       0x6A4U   // PER57SYSCONFIG -  Peripheral System
                                                      // Configuration for MCANB
#define SYSCTL_O_MCANC                       0x6A8U   // PER58SYSCONFIG -  Peripheral System
                                                      // Configuration for MCANC
#define SYSCTL_O_MCAND                       0x6ACU   // PER59SYSCONFIG -  Peripheral System
                                                      // Configuration for MCAND
#define SYSCTL_O_MCANE                       0x6B0U   // PER60SYSCONFIG -  Peripheral System
                                                      // Configuration for MCANE
#define SYSCTL_O_MCANF                       0x6B4U   // PER61SYSCONFIG -  Peripheral System
                                                      // Configuration for MCANF
#define SYSCTL_O_ADCA                        0x6B8U   // PER62SYSCONFIG -  Peripheral System
                                                      // Configuration for ADCA
#define SYSCTL_O_ADCB                        0x6BCU   // PER63SYSCONFIG -  Peripheral System
                                                      // Configuration for ADCB
#define SYSCTL_O_ADCC                        0x6C0U   // PER64SYSCONFIG -  Peripheral System
                                                      // Configuration for ADCC
#define SYSCTL_O_ADCD                        0x6C4U   // PER65SYSCONFIG -  Peripheral System
                                                      // Configuration for ADCD
#define SYSCTL_O_ADCE                        0x6C8U   // PER66SYSCONFIG -  Peripheral System
                                                      // Configuration for ADCE
#define SYSCTL_O_CMPSS1                      0x6CCU   // PER67SYSCONFIG -  Peripheral System
                                                      // Configuration for CMPSS1
#define SYSCTL_O_CMPSS2                      0x6D0U   // PER68SYSCONFIG -  Peripheral System
                                                      // Configuration for CMPSS2
#define SYSCTL_O_CMPSS3                      0x6D4U   // PER69SYSCONFIG -  Peripheral System
                                                      // Configuration for CMPSS3
#define SYSCTL_O_CMPSS4                      0x6D8U   // PER70SYSCONFIG -  Peripheral System
                                                      // Configuration for CMPSS4
#define SYSCTL_O_CMPSS5                      0x6DCU   // PER71SYSCONFIG -  Peripheral System
                                                      // Configuration for CMPSS5
#define SYSCTL_O_CMPSS6                      0x6E0U   // PER72SYSCONFIG -  Peripheral System
