TexasInstruments/f29h85x-sdk/source/driverlib/inc/hw_sysctl.h
                                                      // Configuration for CMPSS6
#define SYSCTL_O_CMPSS7                      0x6E4U   // PER73SYSCONFIG -  Peripheral System
                                                      // Configuration for CMPSS7
#define SYSCTL_O_CMPSS8                      0x6E8U   // PER74SYSCONFIG -  Peripheral System
                                                      // Configuration for CMPSS8
#define SYSCTL_O_CMPSS9                      0x6ECU   // PER75SYSCONFIG -  Peripheral System
                                                      // Configuration for CMPSS9
#define SYSCTL_O_CMPSS10                     0x6F0U   // PER76SYSCONFIG -  Peripheral System
                                                      // Configuration for CMPSS10
#define SYSCTL_O_CMPSS11                     0x6F4U   // PER77SYSCONFIG -  Peripheral System
                                                      // Configuration for CMPSS11
#define SYSCTL_O_CMPSS12                     0x6F8U   // PER78SYSCONFIG -  Peripheral System
                                                      // Configuration for CMPSS12
#define SYSCTL_O_DACA                        0x6FCU   // PER79SYSCONFIG -  Peripheral System
                                                      // Configuration for DACA
#define SYSCTL_O_DACB                        0x700U   // PER80SYSCONFIG -  Peripheral System
                                                      // Configuration for DACB
#define SYSCTL_O_CLB1                        0x704U   // PER81SYSCONFIG -  Peripheral System
                                                      // Configuration for CLB1
#define SYSCTL_O_CLB2                        0x708U   // PER82SYSCONFIG -  Peripheral System
                                                      // Configuration for CLB2
#define SYSCTL_O_CLB3                        0x70CU   // PER83SYSCONFIG -  Peripheral System
                                                      // Configuration for CLB3
#define SYSCTL_O_CLB4                        0x710U   // PER84SYSCONFIG -  Peripheral System
                                                      // Configuration for CLB4
#define SYSCTL_O_CLB5                        0x714U   // PER85SYSCONFIG -  Peripheral System
                                                      // Configuration for CLB5
#define SYSCTL_O_CLB6                        0x718U   // PER86SYSCONFIG -  Peripheral System
                                                      // Configuration for CLB6
#define SYSCTL_O_FSITXA                      0x71CU   // PER87SYSCONFIG -  Peripheral System
                                                      // Configuration for FSITXA
#define SYSCTL_O_FSITXB                      0x720U   // PER88SYSCONFIG -  Peripheral System
                                                      // Configuration for FSITXB
#define SYSCTL_O_FSITXC                      0x724U   // PER89SYSCONFIG -  Peripheral System
                                                      // Configuration for FSITXC
#define SYSCTL_O_FSITXD                      0x728U   // PER90SYSCONFIG -  Peripheral System
                                                      // Configuration for FSITXD
#define SYSCTL_O_FSIRXA                      0x72CU   // PER91SYSCONFIG -  Peripheral System
                                                      // Configuration for FSIRXA
#define SYSCTL_O_FSIRXB                      0x730U   // PER92SYSCONFIG -  Peripheral System
                                                      // Configuration for FSIRXB
#define SYSCTL_O_FSIRXC                      0x734U   // PER93SYSCONFIG -  Peripheral System
                                                      // Configuration for FSIRXC
#define SYSCTL_O_FSIRXD                      0x738U   // PER94SYSCONFIG -  Peripheral System
                                                      // Configuration for FSIRXD
#define SYSCTL_O_DCC1                        0x73CU   // PER95SYSCONFIG -  Peripheral System
                                                      // Configuration for DCC1
#define SYSCTL_O_DCC2                        0x740U   // PER96SYSCONFIG -  Peripheral System
                                                      // Configuration for DCC2
#define SYSCTL_O_DCC3                        0x744U   // PER97SYSCONFIG -  Peripheral System
                                                      // Configuration for DCC3
#define SYSCTL_O_ETHERCATA                   0x748U   // PER98SYSCONFIG -  Peripheral System
                                                      // Configuration for ETHERCATA
#define SYSCTL_O_EPG1                        0x74CU   // PER99SYSCONFIG -  Peripheral System
                                                      // Configuration for EPG1
#define SYSCTL_O_SENT1                       0x750U   // PER100SYSCONFIG -  Peripheral System
                                                      // Configuration for SENT1
#define SYSCTL_O_SENT2                       0x754U   // PER101SYSCONFIG -  Peripheral System
                                                      // Configuration for SENT2
#define SYSCTL_O_SENT3                       0x758U   // PER102SYSCONFIG -  Peripheral System
                                                      // Configuration for SENT3
#define SYSCTL_O_SENT4                       0x75CU   // PER103SYSCONFIG -  Peripheral System
                                                      // Configuration for SENT4
#define SYSCTL_O_SENT5                       0x760U   // PER104SYSCONFIG -  Peripheral System
                                                      // Configuration for SENT5
#define SYSCTL_O_SENT6                       0x764U   // PER105SYSCONFIG -  Peripheral System
                                                      // Configuration for SENT6
#define SYSCTL_O_ADCCHECKER1                 0x768U   // PER106SYSCONFIG -  Peripheral System
                                                      // Configuration for ADCCHECKER1
#define SYSCTL_O_ADCCHECKER2                 0x76CU   // PER107SYSCONFIG -  Peripheral System
                                                      // Configuration for ADCCHECKER2
#define SYSCTL_O_ADCCHECKER3                 0x770U   // PER108SYSCONFIG -  Peripheral System
                                                      // Configuration for ADCCHECKER3
#define SYSCTL_O_ADCCHECKER4                 0x774U   // PER109SYSCONFIG -  Peripheral System
                                                      // Configuration for ADCCHECKER4
#define SYSCTL_O_ADCCHECKER5                 0x778U   // PER110SYSCONFIG -  Peripheral System
                                                      // Configuration for ADCCHECKER5
#define SYSCTL_O_ADCCHECKER6                 0x77CU   // PER111SYSCONFIG -  Peripheral System
                                                      // Configuration for ADCCHECKER6
#define SYSCTL_O_ADCCHECKER7                 0x780U   // PER112SYSCONFIG -  Peripheral System
                                                      // Configuration for ADCCHECKER7
#define SYSCTL_O_ADCCHECKER8                 0x784U   // PER113SYSCONFIG -  Peripheral System
                                                      // Configuration for ADCCHECKER8
#define SYSCTL_O_ADCCHECKER9                 0x788U   // PER114SYSCONFIG -  Peripheral System
                                                      // Configuration for ADCCHECKER9
#define SYSCTL_O_ADCCHECKER10                0x78CU   // PER115SYSCONFIG -  Peripheral System
                                                      // Configuration for ADCCHECKER10
#define SYSCTL_O_ADCSEAGGRCPU1               0x790U   // PER116SYSCONFIG -  Peripheral System
                                                      // Configuration for ADCSEAGGRCPU1
#define SYSCTL_O_ADCSEAGGRCPU2               0x794U   // PER117SYSCONFIG -  Peripheral System
                                                      // Configuration for ADCSEAGGRCPU2
#define SYSCTL_O_ADCSEAGGRCPU3               0x798U   // PER118SYSCONFIG -  Peripheral System
                                                      // Configuration for ADCSEAGGRCPU3
#define SYSCTL_O_RTDMA1CH                    0x7A8U   // PER122SYSCONFIG -  Peripheral System
                                                      // Configuration for RTDMA1CH
#define SYSCTL_O_RTDMA2CH                    0x7ACU   // PER123SYSCONFIG -  Peripheral System
                                                      // Configuration for RTDMA2CH
#define SYSCTL_O_WADI1                       0x7B0U   // PER124SYSCONFIG -  Peripheral System
                                                      // Configuration for WADI1
#define SYSCTL_O_WADI2                       0x7B4U   // PER125SYSCONFIG -  Peripheral System
                                                      // Configuration for WADI2
#define SYSCTL_O_INPUTXBARFLAGS              0x7B8U   // PER126SYSCONFIG -  Peripheral System
                                                      // Configuration for INPUTXBARFlags
#define SYSCTL_O_OUTPUTXBARFLAGS             0x7BCU   // PER127SYSCONFIG -  Peripheral System
                                                      // Configuration for OUTPUTXBARFlags
#define SYSCTL_O_DLTFIFOREGS                 0x7C0U   // PER128SYSCONFIG -  Peripheral System
                                                      // Configuration for DLTFIFORegs
#define SYSCTL_O_ADC_GLOBAL_REGS             0x7C4U   // PER129SYSCONFIG -  Peripheral System
                                                      // Configuration for ADC_GLOBAL_REGS
#define SYSCTL_O_ERROR_AGGREGATOR            0x7C8U   // PER130SYSCONFIG -  Peripheral System
                                                      // Configuration for Error_Aggregator
#define SYSCTL_O_ESM                         0x7CCU   // PER131SYSCONFIG -  Peripheral System
                                                      // Configuration for ESM ESMCPU1/2/3 and
                                                      // ESMSYS
#define SYSCTL_O_PARITY_TEST                 0x7E4U   // Enables parity test

#define SYSCTL_O_CPUPERCFGLOCK1     0x0U     // Lock bit for CPUx_PER_CFG registers
#define SYSCTL_O_CPUPERCFGLOCK2     0x4U     // Lock bit for CPUx_PER_CFG registers
#define SYSCTL_O_PCLKCR0            0x10U    // Peripheral Clock Gating Registers
#define SYSCTL_O_PCLKCR1            0x14U    // Peripheral Clock Gating Register - EMIF
#define SYSCTL_O_PCLKCR2            0x18U    // Peripheral Clock Gating Register - EPWM
#define SYSCTL_O_PCLKCR3            0x1CU    // Peripheral Clock Gating Register - ECAP
#define SYSCTL_O_PCLKCR4            0x20U    // Peripheral Clock Gating Register - EQEP
#define SYSCTL_O_PCLKCR6            0x28U    // Peripheral Clock Gating Register - SDFM
#define SYSCTL_O_PCLKCR7            0x2CU    // Peripheral Clock Gating Register - SCI, UART
#define SYSCTL_O_PCLKCR8            0x30U    // Peripheral Clock Gating Register - SPI
#define SYSCTL_O_PCLKCR9            0x34U    // Peripheral Clock Gating Register - I2C
#define SYSCTL_O_PCLKCR10           0x38U    // Peripheral Clock Gating Register - CAN
#define SYSCTL_O_PCLKCR13           0x44U    // Peripheral Clock Gating Register - ADC
#define SYSCTL_O_PCLKCR14           0x48U    // Peripheral Clock Gating Register - CMPSS
#define SYSCTL_O_PCLKCR16           0x50U    // Peripheral Clock Gating Register Buf_DAC
#define SYSCTL_O_PCLKCR17           0x54U    // Peripheral Clock Gating Register - CLB
#define SYSCTL_O_PCLKCR18           0x58U    // Peripheral Clock Gating Register - FSI
#define SYSCTL_O_PCLKCR19           0x5CU    // Peripheral Clock Gating Register - LIN
#define SYSCTL_O_PCLKCR20           0x60U    // Peripheral Clock Gating Register - PMBUS
#define SYSCTL_O_PCLKCR21           0x64U    // Peripheral Clock Gating Register - DCC
#define SYSCTL_O_PCLKCR23           0x6CU    // Peripheral Clock Gating Register - EtherCAT
#define SYSCTL_O_PCLKCR25           0x74U    // Peripheral Clock Gating Register - HRCAL0,1,2
#define SYSCTL_O_PCLKCR27           0x7CU    // Peripheral Clock Gating Register - EPG
#define SYSCTL_O_PCLKCR28           0x80U    // Peripheral Clock Gating Register - ADCCHECKER
#define SYSCTL_O_PCLKCR30           0x88U    // Peripheral Clock Gating Register - SENT
#define SYSCTL_O_PCLKCR32           0x90U    // Peripheral Clock Gating Register - WADI
#define SYSCTL_O_SOFTPRES0          0x110U   // Processing Block Software Reset register
#define SYSCTL_O_SOFTPRES1          0x114U   // EMIF Software Reset register
#define SYSCTL_O_SOFTPRES2          0x118U   // EPWM Software Reset register
#define SYSCTL_O_SOFTPRES3          0x11CU   // ECAP Software Reset register
#define SYSCTL_O_SOFTPRES4          0x120U   // EQEP Software Reset register
#define SYSCTL_O_SOFTPRES6          0x128U   // Sigma Delta Software Reset register
#define SYSCTL_O_SOFTPRES7          0x12CU   // SCI, UART Software Reset register
#define SYSCTL_O_SOFTPRES8          0x130U   // SPI Software Reset register
#define SYSCTL_O_SOFTPRES9          0x134U   // I2C Software Reset register
#define SYSCTL_O_SOFTPRES10         0x138U   // CAN Software Reset register
#define SYSCTL_O_SOFTPRES13         0x144U   // ADC Software Reset register
#define SYSCTL_O_SOFTPRES14         0x148U   // CMPSS Software Reset register
#define SYSCTL_O_SOFTPRES16         0x150U   // DAC Software Reset register
#define SYSCTL_O_SOFTPRES17         0x154U   // CLB Software Reset register
#define SYSCTL_O_SOFTPRES18         0x158U   // FSI Software Reset register
#define SYSCTL_O_SOFTPRES19         0x15CU   // LIN Software Reset register
#define SYSCTL_O_SOFTPRES20         0x160U   // PMBUS Software Reset register
#define SYSCTL_O_SOFTPRES21         0x164U   // DCC Software Reset register
#define SYSCTL_O_SOFTPRES23         0x16CU   // ETHERCAT Software Reset register
#define SYSCTL_O_SOFTPRES25         0x174U   // HRCAL0,1,2 Software Reset register
#define SYSCTL_O_SOFTPRES27         0x17CU   // EPG Software Reset register
#define SYSCTL_O_SOFTPRES28         0x180U   // ADCCHECKER Software Reset register
#define SYSCTL_O_SOFTPRES30         0x188U   // SENT Software Reset register
#define SYSCTL_O_SOFTPRES32         0x190U   // WADI Software Reset register
#define SYSCTL_O_PARITY_TEST_ALT1   0x1B8U   // Enables parity test

#define SYSCTL_O_CPUSYSLOCK1          0x0U    // Lock bit for CPUSYS registers
#define SYSCTL_O_CPUID                0xCU    // Indicates CPU1, CPU2.. CPU6
#define SYSCTL_O_LPMCR                0x28U   // LPM Control Register
#define SYSCTL_O_CMPSSLPMSEL          0x2CU   // CMPSS LPM Wakeup select registers
#define SYSCTL_O_GPIOLPMSEL0          0x30U   // GPIO LPM Wakeup select registers
#define SYSCTL_O_GPIOLPMSEL1          0x34U   // GPIO LPM Wakeup select registers
#define SYSCTL_O_TMR2CLKCTL           0x38U   // Timer2 Clock Measurement functionality control
                                              // register
#define SYSCTL_O_RESCCLR              0x3CU   // Reset Cause Clear Register
#define SYSCTL_O_RESC                 0x40U   // Reset Cause register
#define SYSCTL_O_MCANWAKESTATUS       0x70U   // MCAN Wake Status Register
#define SYSCTL_O_MCANWAKESTATUSCLR    0x74U   // MCAN Wake Status Clear Register
#define SYSCTL_O_CLKSTOPREQ           0x78U   // Peripheral Clock Stop Request Register
#define SYSCTL_O_CLKSTOPACK           0x7CU   // Peripheral Clock Stop Ackonwledge Register
#define SYSCTL_O_USER_REG1_SYSRSN     0x80U   // Software Configurable registers reset by SYSRSn
#define SYSCTL_O_USER_REG2_SYSRSN     0x84U   // Software Configurable registers reset by SYSRSn
#define SYSCTL_O_USER_REG1_XRSN       0x88U   // Software Configurable registers reset by XRSn
#define SYSCTL_O_USER_REG2_XRSN       0x8CU   // Software Configurable registers reset by XRSn
#define SYSCTL_O_USER_REG1_PORESETN   0x90U   // Software Configurable registers reset by PORESETn
#define SYSCTL_O_USER_REG2_PORESETN   0x94U   // Software Configurable registers reset by PORESETn
#define SYSCTL_O_USER_REG3_PORESETN   0x98U   // Software Configurable registers reset by PORESETn
#define SYSCTL_O_USER_REG4_PORESETN   0x9CU   // Software Configurable registers reset by PORESETn
#define SYSCTL_O_SIMRESET             0xA4U   // Simulated Reset Register
#define SYSCTL_O_PARITY_TEST_ALT2     0xA8U   // Enables parity test

#define SYSCTL_O_SCSR         0x44U   // System Control & Status Register
#define SYSCTL_O_WDCNTR       0x46U   // Watchdog Counter Register
#define SYSCTL_O_WDKEY        0x4AU   // Watchdog Reset Key Register
#define SYSCTL_O_SYNCBUSYWD   0x50U   // SYNCBUSY status for Watchdog Register
#define SYSCTL_O_WDCR         0x52U   // Watchdog Control Register
#define SYSCTL_O_WDWCR        0x54U   // Watchdog Windowed Control Register


//*************************************************************************************************
//
// The following are defines for the bit fields in the DEVCFGLOCK1 register
//
//*************************************************************************************************
#define SYSCTL_DEVCFGLOCK1_PER0SYSCONFIG    0x1U          // Lock bit for PER0SYSCONFIG register
#define SYSCTL_DEVCFGLOCK1_PER1SYSCONFIG    0x2U          // Lock bit for PER1SYSCONFIG register
#define SYSCTL_DEVCFGLOCK1_PER2SYSCONFIG    0x4U          // Lock bit for PER2SYSCONFIG register
#define SYSCTL_DEVCFGLOCK1_PER3SYSCONFIG    0x8U          // Lock bit for PER3SYSCONFIG register
#define SYSCTL_DEVCFGLOCK1_PER4SYSCONFIG    0x10U         // Lock bit for PER4SYSCONFIG register
#define SYSCTL_DEVCFGLOCK1_PER5SYSCONFIG    0x20U         // Lock bit for PER5SYSCONFIG register
#define SYSCTL_DEVCFGLOCK1_PER6SYSCONFIG    0x40U         // Lock bit for PER6SYSCONFIG register
#define SYSCTL_DEVCFGLOCK1_PER7SYSCONFIG    0x80U         // Lock bit for PER7SYSCONFIG register
#define SYSCTL_DEVCFGLOCK1_PER8SYSCONFIG    0x100U        // Lock bit for PER8SYSCONFIG register
#define SYSCTL_DEVCFGLOCK1_PER9SYSCONFIG    0x200U        // Lock bit for PER9SYSCONFIG register
#define SYSCTL_DEVCFGLOCK1_PER10SYSCONFIG   0x400U        // Lock bit for PER10SYSCONFIG register
#define SYSCTL_DEVCFGLOCK1_PER11SYSCONFIG   0x800U        // Lock bit for PER11SYSCONFIG register
#define SYSCTL_DEVCFGLOCK1_PER12SYSCONFIG   0x1000U       // Lock bit for PER12SYSCONFIG register
#define SYSCTL_DEVCFGLOCK1_PER13SYSCONFIG   0x2000U       // Lock bit for PER13SYSCONFIG register
#define SYSCTL_DEVCFGLOCK1_PER14SYSCONFIG   0x4000U       // Lock bit for PER14SYSCONFIG register
#define SYSCTL_DEVCFGLOCK1_PER15SYSCONFIG   0x8000U       // Lock bit for PER15SYSCONFIG register
#define SYSCTL_DEVCFGLOCK1_PER16SYSCONFIG   0x10000U      // Lock bit for PER16SYSCONFIG register
#define SYSCTL_DEVCFGLOCK1_PER17SYSCONFIG   0x20000U      // Lock bit for PER17SYSCONFIG register
#define SYSCTL_DEVCFGLOCK1_PER18SYSCONFIG   0x40000U      // Lock bit for PER18SYSCONFIG register
#define SYSCTL_DEVCFGLOCK1_PER19SYSCONFIG   0x80000U      // Lock bit for PER19SYSCONFIG register
#define SYSCTL_DEVCFGLOCK1_PER20SYSCONFIG   0x100000U     // Lock bit for PER20SYSCONFIG register
#define SYSCTL_DEVCFGLOCK1_PER21SYSCONFIG   0x200000U     // Lock bit for PER21SYSCONFIG register
#define SYSCTL_DEVCFGLOCK1_PER22SYSCONFIG   0x400000U     // Lock bit for PER22SYSCONFIG register
#define SYSCTL_DEVCFGLOCK1_PER23SYSCONFIG   0x800000U     // Lock bit for PER23SYSCONFIG register
#define SYSCTL_DEVCFGLOCK1_PER24SYSCONFIG   0x1000000U    // Lock bit for PER24SYSCONFIG register
#define SYSCTL_DEVCFGLOCK1_PER25SYSCONFIG   0x2000000U    // Lock bit for PER25SYSCONFIG register
#define SYSCTL_DEVCFGLOCK1_PER26SYSCONFIG   0x4000000U    // Lock bit for PER26SYSCONFIG register
#define SYSCTL_DEVCFGLOCK1_PER27SYSCONFIG   0x8000000U    // Lock bit for PER27SYSCONFIG register
#define SYSCTL_DEVCFGLOCK1_PER28SYSCONFIG   0x10000000U   // Lock bit for PER28SYSCONFIG register
#define SYSCTL_DEVCFGLOCK1_PER29SYSCONFIG   0x20000000U   // Lock bit for PER29SYSCONFIG register
#define SYSCTL_DEVCFGLOCK1_PER30SYSCONFIG   0x40000000U   // Lock bit for PER30SYSCONFIG register
#define SYSCTL_DEVCFGLOCK1_PER31SYSCONFIG   0x80000000U   // Lock bit for PER31SYSCONFIG register

//*************************************************************************************************
//
// The following are defines for the bit fields in the DEVCFGLOCK2 register
//
//*************************************************************************************************
#define SYSCTL_DEVCFGLOCK2_SICCONFIG     0x8U    // Lock for SICCONFIG
#define SYSCTL_DEVCFGLOCK2_LSEN          0x10U   // Lock for LSEN
#define SYSCTL_DEVCFGLOCK2_ETHERCATCTL   0x40U   // Lock for ETHERCATCTL
#define SYSCTL_DEVCFGLOCK2_PCLKCR22      0x80U   // Lock for PCLKCR22

