TexasInstruments/f29h85x-sdk/source/driverlib/inc/hw_sysctl.h
//*************************************************************************************************
//
// The following are defines for the bit fields in the DEVCFGLOCK3 register
//
//*************************************************************************************************
#define SYSCTL_DEVCFGLOCK3_PER32SYSCONFIG   0x1U          // Lock bit for PER32SYSCONFIG register
#define SYSCTL_DEVCFGLOCK3_PER33SYSCONFIG   0x2U          // Lock bit for PER33SYSCONFIG register
#define SYSCTL_DEVCFGLOCK3_PER34SYSCONFIG   0x4U          // Lock bit for PER34SYSCONFIG register
#define SYSCTL_DEVCFGLOCK3_PER35SYSCONFIG   0x8U          // Lock bit for PER35SYSCONFIG register
#define SYSCTL_DEVCFGLOCK3_PER36SYSCONFIG   0x10U         // Lock bit for PER36SYSCONFIG register
#define SYSCTL_DEVCFGLOCK3_PER37SYSCONFIG   0x20U         // Lock bit for PER37SYSCONFIG register
#define SYSCTL_DEVCFGLOCK3_PER38SYSCONFIG   0x40U         // Lock bit for PER38SYSCONFIG register
#define SYSCTL_DEVCFGLOCK3_PER39SYSCONFIG   0x80U         // Lock bit for PER39SYSCONFIG register
#define SYSCTL_DEVCFGLOCK3_PER40SYSCONFIG   0x100U        // Lock bit for PER40SYSCONFIG register
#define SYSCTL_DEVCFGLOCK3_PER41SYSCONFIG   0x200U        // Lock bit for PER41SYSCONFIG register
#define SYSCTL_DEVCFGLOCK3_PER42SYSCONFIG   0x400U        // Lock bit for PER42SYSCONFIG register
#define SYSCTL_DEVCFGLOCK3_PER43SYSCONFIG   0x800U        // Lock bit for PER43SYSCONFIG register
#define SYSCTL_DEVCFGLOCK3_PER44SYSCONFIG   0x1000U       // Lock bit for PER44SYSCONFIG register
#define SYSCTL_DEVCFGLOCK3_PER45SYSCONFIG   0x2000U       // Lock bit for PER45SYSCONFIG register
#define SYSCTL_DEVCFGLOCK3_PER46SYSCONFIG   0x4000U       // Lock bit for PER46SYSCONFIG register
#define SYSCTL_DEVCFGLOCK3_PER47SYSCONFIG   0x8000U       // Lock bit for PER47SYSCONFIG register
#define SYSCTL_DEVCFGLOCK3_PER48SYSCONFIG   0x10000U      // Lock bit for PER48SYSCONFIG register
#define SYSCTL_DEVCFGLOCK3_PER49SYSCONFIG   0x20000U      // Lock bit for PER49SYSCONFIG register
#define SYSCTL_DEVCFGLOCK3_PER50SYSCONFIG   0x40000U      // Lock bit for PER50SYSCONFIG register
#define SYSCTL_DEVCFGLOCK3_PER51SYSCONFIG   0x80000U      // Lock bit for PER51SYSCONFIG register
#define SYSCTL_DEVCFGLOCK3_PER52SYSCONFIG   0x100000U     // Lock bit for PER52SYSCONFIG register
#define SYSCTL_DEVCFGLOCK3_PER53SYSCONFIG   0x200000U     // Lock bit for PER53SYSCONFIG register
#define SYSCTL_DEVCFGLOCK3_PER54SYSCONFIG   0x400000U     // Lock bit for PER54SYSCONFIG register
#define SYSCTL_DEVCFGLOCK3_PER55SYSCONFIG   0x800000U     // Lock bit for PER55SYSCONFIG register
#define SYSCTL_DEVCFGLOCK3_PER56SYSCONFIG   0x1000000U    // Lock bit for PER56SYSCONFIG register
#define SYSCTL_DEVCFGLOCK3_PER57SYSCONFIG   0x2000000U    // Lock bit for PER57SYSCONFIG register
#define SYSCTL_DEVCFGLOCK3_PER58SYSCONFIG   0x4000000U    // Lock bit for PER58SYSCONFIG register
#define SYSCTL_DEVCFGLOCK3_PER59SYSCONFIG   0x8000000U    // Lock bit for PER59SYSCONFIG register
#define SYSCTL_DEVCFGLOCK3_PER60SYSCONFIG   0x10000000U   // Lock bit for PER60SYSCONFIG register
#define SYSCTL_DEVCFGLOCK3_PER61SYSCONFIG   0x20000000U   // Lock bit for PER61SYSCONFIG register
#define SYSCTL_DEVCFGLOCK3_PER62SYSCONFIG   0x40000000U   // Lock bit for PER62SYSCONFIG register
#define SYSCTL_DEVCFGLOCK3_PER63SYSCONFIG   0x80000000U   // Lock bit for PER63SYSCONFIG register

//*************************************************************************************************
//
// The following are defines for the bit fields in the DEVCFGLOCK4 register
//
//*************************************************************************************************
#define SYSCTL_DEVCFGLOCK4_PER64SYSCONFIG   0x1U          // Lock bit for PER64SYSCONFIG register
#define SYSCTL_DEVCFGLOCK4_PER65SYSCONFIG   0x2U          // Lock bit for PER65SYSCONFIG register
#define SYSCTL_DEVCFGLOCK4_PER66SYSCONFIG   0x4U          // Lock bit for PER66SYSCONFIG register
#define SYSCTL_DEVCFGLOCK4_PER67SYSCONFIG   0x8U          // Lock bit for PER67SYSCONFIG register
#define SYSCTL_DEVCFGLOCK4_PER68SYSCONFIG   0x10U         // Lock bit for PER68SYSCONFIG register
#define SYSCTL_DEVCFGLOCK4_PER69SYSCONFIG   0x20U         // Lock bit for PER69SYSCONFIG register
#define SYSCTL_DEVCFGLOCK4_PER70SYSCONFIG   0x40U         // Lock bit for PER70SYSCONFIG register
#define SYSCTL_DEVCFGLOCK4_PER71SYSCONFIG   0x80U         // Lock bit for PER71SYSCONFIG register
#define SYSCTL_DEVCFGLOCK4_PER72SYSCONFIG   0x100U        // Lock bit for PER72SYSCONFIG register
#define SYSCTL_DEVCFGLOCK4_PER73SYSCONFIG   0x200U        // Lock bit for PER73SYSCONFIG register
#define SYSCTL_DEVCFGLOCK4_PER74SYSCONFIG   0x400U        // Lock bit for PER74SYSCONFIG register
#define SYSCTL_DEVCFGLOCK4_PER75SYSCONFIG   0x800U        // Lock bit for PER75SYSCONFIG register
#define SYSCTL_DEVCFGLOCK4_PER76SYSCONFIG   0x1000U       // Lock bit for PER76SYSCONFIG register
#define SYSCTL_DEVCFGLOCK4_PER77SYSCONFIG   0x2000U       // Lock bit for PER77SYSCONFIG register
#define SYSCTL_DEVCFGLOCK4_PER78SYSCONFIG   0x4000U       // Lock bit for PER78SYSCONFIG register
#define SYSCTL_DEVCFGLOCK4_PER79SYSCONFIG   0x8000U       // Lock bit for PER79SYSCONFIG register
#define SYSCTL_DEVCFGLOCK4_PER80SYSCONFIG   0x10000U      // Lock bit for PER80SYSCONFIG register
#define SYSCTL_DEVCFGLOCK4_PER81SYSCONFIG   0x20000U      // Lock bit for PER81SYSCONFIG register
#define SYSCTL_DEVCFGLOCK4_PER82SYSCONFIG   0x40000U      // Lock bit for PER82SYSCONFIG register
#define SYSCTL_DEVCFGLOCK4_PER83SYSCONFIG   0x80000U      // Lock bit for PER83SYSCONFIG register
#define SYSCTL_DEVCFGLOCK4_PER84SYSCONFIG   0x100000U     // Lock bit for PER84SYSCONFIG register
#define SYSCTL_DEVCFGLOCK4_PER85SYSCONFIG   0x200000U     // Lock bit for PER85SYSCONFIG register
#define SYSCTL_DEVCFGLOCK4_PER86SYSCONFIG   0x400000U     // Lock bit for PER86SYSCONFIG register
#define SYSCTL_DEVCFGLOCK4_PER87SYSCONFIG   0x800000U     // Lock bit for PER87SYSCONFIG register
#define SYSCTL_DEVCFGLOCK4_PER88SYSCONFIG   0x1000000U    // Lock bit for PER88SYSCONFIG register
#define SYSCTL_DEVCFGLOCK4_PER89SYSCONFIG   0x2000000U    // Lock bit for PER89SYSCONFIG register
#define SYSCTL_DEVCFGLOCK4_PER90SYSCONFIG   0x4000000U    // Lock bit for PER90SYSCONFIG register
#define SYSCTL_DEVCFGLOCK4_PER91SYSCONFIG   0x8000000U    // Lock bit for PER91SYSCONFIG register
#define SYSCTL_DEVCFGLOCK4_PER92SYSCONFIG   0x10000000U   // Lock bit for PER92SYSCONFIG register
#define SYSCTL_DEVCFGLOCK4_PER93SYSCONFIG   0x20000000U   // Lock bit for PER93SYSCONFIG register
#define SYSCTL_DEVCFGLOCK4_PER94SYSCONFIG   0x40000000U   // Lock bit for PER94SYSCONFIG register
#define SYSCTL_DEVCFGLOCK4_PER95SYSCONFIG   0x80000000U   // Lock bit for PER95SYSCONFIG register

//*************************************************************************************************
//
// The following are defines for the bit fields in the DEVCFGLOCK5 register
//
//*************************************************************************************************
#define SYSCTL_DEVCFGLOCK5_PER96SYSCONFIG    0x1U         // Lock bit for PER96SYSCONFIG register
#define SYSCTL_DEVCFGLOCK5_PER97SYSCONFIG    0x2U         // Lock bit for PER97SYSCONFIG register
#define SYSCTL_DEVCFGLOCK5_PER98SYSCONFIG    0x4U         // Lock bit for PER98SYSCONFIG register
#define SYSCTL_DEVCFGLOCK5_PER99SYSCONFIG    0x8U         // Lock bit for PER99SYSCONFIG register
#define SYSCTL_DEVCFGLOCK5_PER100SYSCONFIG   0x10U        // Lock bit for PER100SYSCONFIG register
#define SYSCTL_DEVCFGLOCK5_PER101SYSCONFIG   0x20U        // Lock bit for PER101SYSCONFIG register
#define SYSCTL_DEVCFGLOCK5_PER102SYSCONFIG   0x40U        // Lock bit for PER102SYSCONFIG register
#define SYSCTL_DEVCFGLOCK5_PER103SYSCONFIG   0x80U        // Lock bit for PER103SYSCONFIG register
#define SYSCTL_DEVCFGLOCK5_PER104SYSCONFIG   0x100U       // Lock bit for PER104SYSCONFIG register
#define SYSCTL_DEVCFGLOCK5_PER105SYSCONFIG   0x200U       // Lock bit for PER105SYSCONFIG register
#define SYSCTL_DEVCFGLOCK5_PER106SYSCONFIG   0x400U       // Lock bit for PER106SYSCONFIG register
#define SYSCTL_DEVCFGLOCK5_PER107SYSCONFIG   0x800U       // Lock bit for PER107SYSCONFIG register
#define SYSCTL_DEVCFGLOCK5_PER108SYSCONFIG   0x1000U      // Lock bit for PER108SYSCONFIG register
#define SYSCTL_DEVCFGLOCK5_PER109SYSCONFIG   0x2000U      // Lock bit for PER109SYSCONFIG register
#define SYSCTL_DEVCFGLOCK5_PER110SYSCONFIG   0x4000U      // Lock bit for PER110SYSCONFIG register
#define SYSCTL_DEVCFGLOCK5_PER111SYSCONFIG   0x8000U      // Lock bit for PER111SYSCONFIG register
#define SYSCTL_DEVCFGLOCK5_PER112SYSCONFIG   0x10000U     // Lock bit for PER112SYSCONFIG register
#define SYSCTL_DEVCFGLOCK5_PER113SYSCONFIG   0x20000U     // Lock bit for PER113SYSCONFIG register
#define SYSCTL_DEVCFGLOCK5_PER114SYSCONFIG   0x40000U     // Lock bit for PER114SYSCONFIG register
#define SYSCTL_DEVCFGLOCK5_PER115SYSCONFIG   0x80000U     // Lock bit for PER115SYSCONFIG register
#define SYSCTL_DEVCFGLOCK5_PER116SYSCONFIG   0x100000U    // Lock bit for PER116SYSCONFIG register
#define SYSCTL_DEVCFGLOCK5_PER117SYSCONFIG   0x200000U    // Lock bit for PER117SYSCONFIG register
#define SYSCTL_DEVCFGLOCK5_PER118SYSCONFIG   0x400000U    // Lock bit for PER118SYSCONFIG register
#define SYSCTL_DEVCFGLOCK5_PER119SYSCONFIG   0x800000U    // Lock bit for PER119SYSCONFIG register
#define SYSCTL_DEVCFGLOCK5_PER120SYSCONFIG   0x1000000U   // Lock bit for PER120SYSCONFIG register

//*************************************************************************************************
//
// The following are defines for the bit fields in the PARTIDL register
//
//*************************************************************************************************
#define SYSCTL_PARTIDL_QUAL_S                6U
#define SYSCTL_PARTIDL_QUAL_M                0xC0U         // Qualification Status
#define SYSCTL_PARTIDL_PIN_COUNT_S           8U
#define SYSCTL_PARTIDL_PIN_COUNT_M           0x700U        // Device Pin Count
#define SYSCTL_PARTIDL_FLASH_SIZE_S          16U
#define SYSCTL_PARTIDL_FLASH_SIZE_M          0xFF0000U     // FLASH_SIZE
#define SYSCTL_PARTIDL_PARTID_FORMAT_REV_S   28U
#define SYSCTL_PARTIDL_PARTID_FORMAT_REV_M   0xF0000000U   // PARTID_FORMAT_REV

//*************************************************************************************************
//
// The following are defines for the bit fields in the PARTIDH register
//
//*************************************************************************************************
#define SYSCTL_PARTIDH_FAMILY_S            8U
#define SYSCTL_PARTIDH_FAMILY_M            0xFF00U       // Device family
#define SYSCTL_PARTIDH_PARTNO_S            16U
#define SYSCTL_PARTIDH_PARTNO_M            0xFF0000U     // Device part number
#define SYSCTL_PARTIDH_DEVICE_CLASS_ID_S   24U
#define SYSCTL_PARTIDH_DEVICE_CLASS_ID_M   0xFF000000U   // Device class ID

//*************************************************************************************************
//
// The following are defines for the bit fields in the REVID register
//
//*************************************************************************************************
#define SYSCTL_REVID_REVID_S   0U
#define SYSCTL_REVID_REVID_M   0xFFFFU   // Device Revision ID. This is specific to the Device

//*************************************************************************************************
//
// The following are defines for the bit fields in the MCUCNF1 register
//
//*************************************************************************************************
#define SYSCTL_MCUCNF1_EMIF1   0x1U   // EMIF1 Present

//*************************************************************************************************
//
// The following are defines for the bit fields in the MCUCNF2 register
//
//*************************************************************************************************
#define SYSCTL_MCUCNF2_EPWM1    0x1U       // EPWM1 Present
#define SYSCTL_MCUCNF2_EPWM2    0x2U       // EPWM2 Present
#define SYSCTL_MCUCNF2_EPWM3    0x4U       // EPWM3 Present
#define SYSCTL_MCUCNF2_EPWM4    0x8U       // EPWM4 Present
#define SYSCTL_MCUCNF2_EPWM5    0x10U      // EPWM5 Present
#define SYSCTL_MCUCNF2_EPWM6    0x20U      // EPWM6 Present
#define SYSCTL_MCUCNF2_EPWM7    0x40U      // EPWM7 Present
#define SYSCTL_MCUCNF2_EPWM8    0x80U      // EPWM8 Present
#define SYSCTL_MCUCNF2_EPWM9    0x100U     // EPWM9 Present
#define SYSCTL_MCUCNF2_EPWM10   0x200U     // EPWM10 Present
#define SYSCTL_MCUCNF2_EPWM11   0x400U     // EPWM11 Present
#define SYSCTL_MCUCNF2_EPWM12   0x800U     // EPWM12 Present
#define SYSCTL_MCUCNF2_EPWM13   0x1000U    // EPWM13 Present
#define SYSCTL_MCUCNF2_EPWM14   0x2000U    // EPWM14 Present
#define SYSCTL_MCUCNF2_EPWM15   0x4000U    // EPWM15 Present
#define SYSCTL_MCUCNF2_EPWM16   0x8000U    // EPWM16 Present
#define SYSCTL_MCUCNF2_EPWM17   0x10000U   // EPWM17 Present
#define SYSCTL_MCUCNF2_EPWM18   0x20000U   // EPWM18 Present

//*************************************************************************************************
//
// The following are defines for the bit fields in the MCUCNF4 register
//
//*************************************************************************************************
#define SYSCTL_MCUCNF4_EQEP1   0x1U    // EQEP1 Present
#define SYSCTL_MCUCNF4_EQEP2   0x2U    // EQEP2 Present
#define SYSCTL_MCUCNF4_EQEP3   0x4U    // EQEP3 Present
#define SYSCTL_MCUCNF4_EQEP4   0x8U    // EQEP4 Present
#define SYSCTL_MCUCNF4_EQEP5   0x10U   // EQEP5 Present
#define SYSCTL_MCUCNF4_EQEP6   0x20U   // EQEP6 Present

//*************************************************************************************************
//
// The following are defines for the bit fields in the MCUCNF7 register
//
//*************************************************************************************************
#define SYSCTL_MCUCNF7_UART_A   0x10000U    // UART_A Present
#define SYSCTL_MCUCNF7_UART_B   0x20000U    // UART_B Present
#define SYSCTL_MCUCNF7_UART_C   0x40000U    // UART_C Present
#define SYSCTL_MCUCNF7_UART_D   0x80000U    // UART_D Present
#define SYSCTL_MCUCNF7_UART_E   0x100000U   // UART_E Present
#define SYSCTL_MCUCNF7_UART_F   0x200000U   // UART_F Present

//*************************************************************************************************
//
// The following are defines for the bit fields in the MCUCNF10 register
//
//*************************************************************************************************
#define SYSCTL_MCUCNF10_MCAN_A   0x10U    // MCAN_A Present
#define SYSCTL_MCUCNF10_MCAN_B   0x20U    // MCAN_B Present
#define SYSCTL_MCUCNF10_MCAN_C   0x40U    // MCAN_C Present
#define SYSCTL_MCUCNF10_MCAN_D   0x80U    // MCAN_D Present
#define SYSCTL_MCUCNF10_MCAN_E   0x100U   // MCAN_E Present
#define SYSCTL_MCUCNF10_MCAN_F   0x200U   // MCAN_F Present

//*************************************************************************************************
//
// The following are defines for the bit fields in the MCUCNF13 register
//
//*************************************************************************************************
#define SYSCTL_MCUCNF13_ADC_A   0x1U    // ADC_A Present
#define SYSCTL_MCUCNF13_ADC_B   0x2U    // ADC_B Present
#define SYSCTL_MCUCNF13_ADC_C   0x4U    // ADC_C Present
#define SYSCTL_MCUCNF13_ADC_D   0x8U    // ADC_D Present
#define SYSCTL_MCUCNF13_ADC_E   0x10U   // ADC_E Present

//*************************************************************************************************
//
// The following are defines for the bit fields in the MCUCNF14 register
//
//*************************************************************************************************
#define SYSCTL_MCUCNF14_CMPSS1    0x1U     // CMPSS1 Present
#define SYSCTL_MCUCNF14_CMPSS2    0x2U     // CMPSS2 Present
#define SYSCTL_MCUCNF14_CMPSS3    0x4U     // CMPSS3 Present
#define SYSCTL_MCUCNF14_CMPSS4    0x8U     // CMPSS4 Present
#define SYSCTL_MCUCNF14_CMPSS5    0x10U    // CMPSS5 Present
#define SYSCTL_MCUCNF14_CMPSS6    0x20U    // CMPSS6 Present
#define SYSCTL_MCUCNF14_CMPSS7    0x40U    // CMPSS7 Present
#define SYSCTL_MCUCNF14_CMPSS8    0x80U    // CMPSS8 Present
#define SYSCTL_MCUCNF14_CMPSS9    0x100U   // CMPSS9 Present
#define SYSCTL_MCUCNF14_CMPSS10   0x200U   // CMPSS10 Present
#define SYSCTL_MCUCNF14_CMPSS11   0x400U   // CMPSS11 Present
#define SYSCTL_MCUCNF14_CMPSS12   0x800U   // CMPSS12 Present

//*************************************************************************************************
//
// The following are defines for the bit fields in the MCUCNF16 register
//
//*************************************************************************************************
#define SYSCTL_MCUCNF16_DAC_A   0x10000U   // DAC_A Present
#define SYSCTL_MCUCNF16_DAC_B   0x20000U   // DAC_B Present

//*************************************************************************************************
//
// The following are defines for the bit fields in the MCUCNF17 register
//
//*************************************************************************************************
#define SYSCTL_MCUCNF17_CLB1   0x1U    // CLB1 Present
#define SYSCTL_MCUCNF17_CLB2   0x2U    // CLB2 Present
#define SYSCTL_MCUCNF17_CLB3   0x4U    // CLB3 Present
#define SYSCTL_MCUCNF17_CLB4   0x8U    // CLB4 Present
#define SYSCTL_MCUCNF17_CLB5   0x10U   // CLB5 Present
#define SYSCTL_MCUCNF17_CLB6   0x20U   // CLB6 Present

//*************************************************************************************************
//
// The following are defines for the bit fields in the MCUCNF18 register
//
//*************************************************************************************************
#define SYSCTL_MCUCNF18_FSITX_A   0x1U       // FSITX_A  Present
#define SYSCTL_MCUCNF18_FSITX_B   0x2U       // FSITX_B  Present
#define SYSCTL_MCUCNF18_FSITX_C   0x4U       // FSITX_C  Present
#define SYSCTL_MCUCNF18_FSITX_D   0x8U       // FSITX_D  Present
#define SYSCTL_MCUCNF18_FSIRX_A   0x10000U   // FSIRX_A  Present
#define SYSCTL_MCUCNF18_FSIRX_B   0x20000U   // FSIRX_B  Present
#define SYSCTL_MCUCNF18_FSIRX_C   0x40000U   // FSIRX_C  Present
#define SYSCTL_MCUCNF18_FSIRX_D   0x80000U   // FSIRX_D  Present

//*************************************************************************************************
//
// The following are defines for the bit fields in the MCUCNF19 register
//
//*************************************************************************************************
#define SYSCTL_MCUCNF19_LIN_A   0x1U   // LIN_A Present
#define SYSCTL_MCUCNF19_LIN_B   0x2U   // LIN_B Present

//*************************************************************************************************
//
// The following are defines for the bit fields in the MCUCNF23 register
//
//*************************************************************************************************
#define SYSCTL_MCUCNF23_ETHERCAT   0x1U   // ETHERCAT

//*************************************************************************************************
//
// The following are defines for the bit fields in the MCUCNF26 register
//
//*************************************************************************************************
#define SYSCTL_MCUCNF26_AES_S    0U
#define SYSCTL_MCUCNF26_AES_M    0x3FU       // AES Present
#define SYSCTL_MCUCNF26_SHA_S    6U
#define SYSCTL_MCUCNF26_SHA_M    0xFC0U      // SHA Present
#define SYSCTL_MCUCNF26_PKA_S    12U
#define SYSCTL_MCUCNF26_PKA_M    0x3F000U    // PKA Present
#define SYSCTL_MCUCNF26_TRNG_S   18U
#define SYSCTL_MCUCNF26_TRNG_M   0xFC0000U   // TRNG Present

//*************************************************************************************************
//
// The following are defines for the bit fields in the MCUCNF31 register
//
//*************************************************************************************************
#define SYSCTL_MCUCNF31_SM2_S   0U
#define SYSCTL_MCUCNF31_SM2_M   0x3FU      // SM2 Present
#define SYSCTL_MCUCNF31_SM3_S   6U
#define SYSCTL_MCUCNF31_SM3_M   0xFC0U     // SM3 Present
#define SYSCTL_MCUCNF31_SM4_S   12U
#define SYSCTL_MCUCNF31_SM4_M   0x3F000U   // SM4 Present

//*************************************************************************************************
//
// The following are defines for the bit fields in the MCUCNF64 register
//
//*************************************************************************************************
#define SYSCTL_MCUCNF64_CPU2   0x8U    // CPU2SS Present on this device
#define SYSCTL_MCUCNF64_CPU3   0x10U   // CPU3SS Present on this device

//*************************************************************************************************
//
// The following are defines for the bit fields in the MCUCNF65 register
//
//*************************************************************************************************
#define SYSCTL_MCUCNF65_CPA0    0x1U         // CPA0 Memory Present
#define SYSCTL_MCUCNF65_CPA1    0x2U         // CPA1 Memory Present
#define SYSCTL_MCUCNF65_LPA0    0x10U        // LPA0 Memory Present
#define SYSCTL_MCUCNF65_LPA1    0x20U        // LPA1 Memory Present
#define SYSCTL_MCUCNF65_LDA0    0x100U       // LDA0 Memory Present
#define SYSCTL_MCUCNF65_LDA1    0x200U       // LDA1 Memory Present
#define SYSCTL_MCUCNF65_LDA2    0x400U       // LDA2 Memory Present
#define SYSCTL_MCUCNF65_LDA3    0x800U       // LDA3 Memory Present
#define SYSCTL_MCUCNF65_LDA4    0x1000U      // LDA4 Memory Present
#define SYSCTL_MCUCNF65_LDA5    0x2000U      // LDA5 Memory Present
#define SYSCTL_MCUCNF65_LDA6    0x4000U      // LDA6 Memory Present
#define SYSCTL_MCUCNF65_LDA7    0x8000U      // LDA7 Memory Present
#define SYSCTL_MCUCNF65_CDA0    0x10000U     // CDA0 Memory Present
#define SYSCTL_MCUCNF65_CDA1    0x20000U     // CDA1 Memory Present
#define SYSCTL_MCUCNF65_CDA2    0x40000U     // CDA2 Memory Present
#define SYSCTL_MCUCNF65_CDA3    0x80000U     // CDA3 Memory Present
#define SYSCTL_MCUCNF65_CDA4    0x100000U    // CDA4 Memory Present
#define SYSCTL_MCUCNF65_CDA5    0x200000U    // CDA5 Memory Present
#define SYSCTL_MCUCNF65_CDA6    0x400000U    // CDA6 Memory Present
#define SYSCTL_MCUCNF65_CDA7    0x800000U    // CDA7 Memory Present
#define SYSCTL_MCUCNF65_CDA8    0x1000000U   // CDA8 Memory Present
#define SYSCTL_MCUCNF65_CDA9    0x2000000U   // CDA9 Memory Present
#define SYSCTL_MCUCNF65_CDA10   0x4000000U   // CDA10 Memory Present
#define SYSCTL_MCUCNF65_CDA11   0x8000000U   // CDA11 Memory Present

