TexasInstruments/f29h85x-sdk/source/driverlib/inc/hw_sysctl.h
//*************************************************************************************************
//
// The following are defines for the bit fields in the MCUCNF74 register
//
//*************************************************************************************************
#define SYSCTL_MCUCNF74_SECT15_0      0x1U      // Flash sectors 15_0 present
#define SYSCTL_MCUCNF74_SECT31_16     0x2U      // Flash sectors 31_16 present
#define SYSCTL_MCUCNF74_SECT47_32     0x4U      // Flash sectors 47_32 present
#define SYSCTL_MCUCNF74_SECT63_48     0x8U      // Flash sectors 63_48 present
#define SYSCTL_MCUCNF74_SECT79_64     0x10U     // Flash sectors 79_64 present
#define SYSCTL_MCUCNF74_SECT95_80     0x20U     // Flash sectors 95_80 present
#define SYSCTL_MCUCNF74_SECT111_96    0x40U     // Flash sectors 111_96 present
#define SYSCTL_MCUCNF74_SECT127_112   0x80U     // Flash sectors 127_112 present
#define SYSCTL_MCUCNF74_SECT143_128   0x100U    // Flash sectors 143_128 present
#define SYSCTL_MCUCNF74_SECT159_144   0x200U    // Flash sectors 159_144 present
#define SYSCTL_MCUCNF74_SECT175_160   0x400U    // Flash sectors 175_160 present
#define SYSCTL_MCUCNF74_SECT191_176   0x800U    // Flash sectors 191_176 present
#define SYSCTL_MCUCNF74_SECT207_192   0x1000U   // Flash sectors 207_192 present
#define SYSCTL_MCUCNF74_SECT223_208   0x2000U   // Flash sectors 223_208 present
#define SYSCTL_MCUCNF74_SECT239_224   0x4000U   // Flash sectors 239_224 present
#define SYSCTL_MCUCNF74_SECT255_240   0x8000U   // Flash sectors 255_240 present

//*************************************************************************************************
//
// The following are defines for the bit fields in the MCUCNF76 register
//
//*************************************************************************************************
#define SYSCTL_MCUCNF76_SECT15_0      0x1U      // Flash sectors 15_0 present
#define SYSCTL_MCUCNF76_SECT31_16     0x2U      // Flash sectors 31_16 present
#define SYSCTL_MCUCNF76_SECT47_32     0x4U      // Flash sectors 47_32 present
#define SYSCTL_MCUCNF76_SECT63_48     0x8U      // Flash sectors 63_48 present
#define SYSCTL_MCUCNF76_SECT79_64     0x10U     // Flash sectors 79_64 present
#define SYSCTL_MCUCNF76_SECT95_80     0x20U     // Flash sectors 95_80 present
#define SYSCTL_MCUCNF76_SECT111_96    0x40U     // Flash sectors 111_96 present
#define SYSCTL_MCUCNF76_SECT127_112   0x80U     // Flash sectors 127_112 present
#define SYSCTL_MCUCNF76_SECT143_128   0x100U    // Flash sectors 143_128 present
#define SYSCTL_MCUCNF76_SECT159_144   0x200U    // Flash sectors 159_144 present
#define SYSCTL_MCUCNF76_SECT175_160   0x400U    // Flash sectors 175_160 present
#define SYSCTL_MCUCNF76_SECT191_176   0x800U    // Flash sectors 191_176 present
#define SYSCTL_MCUCNF76_SECT207_192   0x1000U   // Flash sectors 207_192 present
#define SYSCTL_MCUCNF76_SECT223_208   0x2000U   // Flash sectors 223_208 present
#define SYSCTL_MCUCNF76_SECT239_224   0x4000U   // Flash sectors 239_224 present
#define SYSCTL_MCUCNF76_SECT255_240   0x8000U   // Flash sectors 255_240 present

//*************************************************************************************************
//
// The following are defines for the bit fields in the MCUCNF78 register
//
//*************************************************************************************************
#define SYSCTL_MCUCNF78_SECT15_0      0x1U    // Flash sectors 15_0 present
#define SYSCTL_MCUCNF78_SECT31_16     0x2U    // Flash sectors 31_16 present
#define SYSCTL_MCUCNF78_SECT47_32     0x4U    // Flash sectors 47_32 present
#define SYSCTL_MCUCNF78_SECT63_48     0x8U    // Flash sectors 63_48 present
#define SYSCTL_MCUCNF78_SECT79_64     0x10U   // Flash sectors 79_64 present
#define SYSCTL_MCUCNF78_SECT95_80     0x20U   // Flash sectors 95_80 present
#define SYSCTL_MCUCNF78_SECT111_96    0x40U   // Flash sectors 111_96 present
#define SYSCTL_MCUCNF78_SECT127_112   0x80U   // Flash sectors 127_112 present

//*************************************************************************************************
//
// The following are defines for the bit fields in the MCUCNF79 register
//
//*************************************************************************************************
#define SYSCTL_MCUCNF79_SECT15_0      0x1U      // Flash sectors 15_0 present
#define SYSCTL_MCUCNF79_SECT31_16     0x2U      // Flash sectors 31_16 present
#define SYSCTL_MCUCNF79_SECT47_32     0x4U      // Flash sectors 47_32 present
#define SYSCTL_MCUCNF79_SECT63_48     0x8U      // Flash sectors 63_48 present
#define SYSCTL_MCUCNF79_SECT79_64     0x10U     // Flash sectors 79_64 present
#define SYSCTL_MCUCNF79_SECT95_80     0x20U     // Flash sectors 95_80 present
#define SYSCTL_MCUCNF79_SECT111_96    0x40U     // Flash sectors 111_96 present
#define SYSCTL_MCUCNF79_SECT127_112   0x80U     // Flash sectors 127_112 present
#define SYSCTL_MCUCNF79_SECT143_128   0x100U    // Flash sectors 143_128 present
#define SYSCTL_MCUCNF79_SECT159_144   0x200U    // Flash sectors 159_144 present
#define SYSCTL_MCUCNF79_SECT175_160   0x400U    // Flash sectors 175_160 present
#define SYSCTL_MCUCNF79_SECT191_176   0x800U    // Flash sectors 191_176 present
#define SYSCTL_MCUCNF79_SECT207_192   0x1000U   // Flash sectors 207_192 present
#define SYSCTL_MCUCNF79_SECT223_208   0x2000U   // Flash sectors 223_208 present
#define SYSCTL_MCUCNF79_SECT239_224   0x4000U   // Flash sectors 239_224 present
#define SYSCTL_MCUCNF79_SECT255_240   0x8000U   // Flash sectors 255_240 present

//*************************************************************************************************
//
// The following are defines for the bit fields in the MCUCNF81 register
//
//*************************************************************************************************
#define SYSCTL_MCUCNF81_SECT15_0      0x1U      // Flash sectors 15_0 present
#define SYSCTL_MCUCNF81_SECT31_16     0x2U      // Flash sectors 31_16 present
#define SYSCTL_MCUCNF81_SECT47_32     0x4U      // Flash sectors 47_32 present
#define SYSCTL_MCUCNF81_SECT63_48     0x8U      // Flash sectors 63_48 present
#define SYSCTL_MCUCNF81_SECT79_64     0x10U     // Flash sectors 79_64 present
#define SYSCTL_MCUCNF81_SECT95_80     0x20U     // Flash sectors 95_80 present
#define SYSCTL_MCUCNF81_SECT111_96    0x40U     // Flash sectors 111_96 present
#define SYSCTL_MCUCNF81_SECT127_112   0x80U     // Flash sectors 127_112 present
#define SYSCTL_MCUCNF81_SECT143_128   0x100U    // Flash sectors 143_128 present
#define SYSCTL_MCUCNF81_SECT159_144   0x200U    // Flash sectors 159_144 present
#define SYSCTL_MCUCNF81_SECT175_160   0x400U    // Flash sectors 175_160 present
#define SYSCTL_MCUCNF81_SECT191_176   0x800U    // Flash sectors 191_176 present
#define SYSCTL_MCUCNF81_SECT207_192   0x1000U   // Flash sectors 207_192 present
#define SYSCTL_MCUCNF81_SECT223_208   0x2000U   // Flash sectors 223_208 present
#define SYSCTL_MCUCNF81_SECT239_224   0x4000U   // Flash sectors 239_224 present
#define SYSCTL_MCUCNF81_SECT255_240   0x8000U   // Flash sectors 255_240 present

//*************************************************************************************************
//
// The following are defines for the bit fields in the MCUCNFLOCK1 register
//
//*************************************************************************************************
#define SYSCTL_MCUCNFLOCK1_MCUCNF1    0x2U          // Lock bit for MCUCNF1 register
#define SYSCTL_MCUCNFLOCK1_MCUCNF2    0x4U          // Lock bit for MCUCNF2 register
#define SYSCTL_MCUCNFLOCK1_MCUCNF4    0x10U         // Lock bit for MCUCNF4 register
#define SYSCTL_MCUCNFLOCK1_MCUCNF10   0x400U        // Lock bit for MCUCNF10 register
#define SYSCTL_MCUCNFLOCK1_MCUCNF17   0x20000U      // Lock bit for MCUCNF17 register
#define SYSCTL_MCUCNFLOCK1_MCUCNF18   0x40000U      // Lock bit for MCUCNF18 register
#define SYSCTL_MCUCNFLOCK1_MCUCNF19   0x80000U      // Lock bit for MCUCNF19 register
#define SYSCTL_MCUCNFLOCK1_MCUCNF23   0x800000U     // Lock bit for MCUCNF23 register
#define SYSCTL_MCUCNFLOCK1_MCUCNF26   0x4000000U    // Lock bit for MCUCNF26 register
#define SYSCTL_MCUCNFLOCK1_MCUCNF31   0x80000000U   // Lock bit for MCUCNF31 register

//*************************************************************************************************
//
// The following are defines for the bit fields in the MCUCNFLOCK3 register
//
//*************************************************************************************************
#define SYSCTL_MCUCNFLOCK3_MCUCNF64   0x1U          // Lock bit for MCUCNF64 register
#define SYSCTL_MCUCNFLOCK3_MCUCNF65   0x2U          // Lock bit for MCUCNF65 register
#define SYSCTL_MCUCNFLOCK3_MCUCNF74   0x400U        // Lock bit for MCUCNF74 register
#define SYSCTL_MCUCNFLOCK3_MCUCNF76   0x1000U       // Lock bit for MCUCNF76 register
#define SYSCTL_MCUCNFLOCK3_MCUCNF78   0x4000U       // Lock bit for MCUCNF78 register
#define SYSCTL_MCUCNFLOCK3_MCUCNF79   0x8000U       // Lock bit for MCUCNF79 register
#define SYSCTL_MCUCNFLOCK3_MCUCNF81   0x20000U      // Lock bit for MCUCNF81 register
#define SYSCTL_MCUCNFLOCK3_MCUCNF95   0x40000000U   // Lock bit for MCUCNF95 register

//*************************************************************************************************
//
// The following are defines for the bit fields in the LSEN register
//
//*************************************************************************************************
#define SYSCTL_LSEN_ENABLE      0x1U          // Lockstep Enable
#define SYSCTL_LSEN_RSERVED_S   1U
#define SYSCTL_LSEN_RSERVED_M   0xFFFFFFFEU   // Reserved

//*************************************************************************************************
//
// The following are defines for the bit fields in the EPWMXLINKCFG register
//
//*************************************************************************************************
#define SYSCTL_EPWMXLINKCFG_EPWM1    0x1U       // Enable EPWM1 instance for the XLINK feature
#define SYSCTL_EPWMXLINKCFG_EPWM2    0x2U       // Enable EPWM2 instance for the XLINK feature
#define SYSCTL_EPWMXLINKCFG_EPWM3    0x4U       // Enable EPWM3 instance for the XLINK feature
#define SYSCTL_EPWMXLINKCFG_EPWM4    0x8U       // Enable EPWM4 instance for the XLINK feature
#define SYSCTL_EPWMXLINKCFG_EPWM5    0x10U      // Enable EPWM5 instance for the XLINK feature
#define SYSCTL_EPWMXLINKCFG_EPWM6    0x20U      // Enable EPWM6 instance for the XLINK feature
#define SYSCTL_EPWMXLINKCFG_EPWM7    0x40U      // Enable EPWM7 instance for the XLINK feature
#define SYSCTL_EPWMXLINKCFG_EPWM8    0x80U      // Enable EPWM8 instance for the XLINK feature
#define SYSCTL_EPWMXLINKCFG_EPWM9    0x100U     // Enable EPWM9 instance for the XLINK feature
#define SYSCTL_EPWMXLINKCFG_EPWM10   0x200U     // Enable EPWM10 instance for the XLINK feature
#define SYSCTL_EPWMXLINKCFG_EPWM11   0x400U     // Enable EPWM11 instance for the XLINK feature
#define SYSCTL_EPWMXLINKCFG_EPWM12   0x800U     // Enable EPWM12 instance for the XLINK feature
#define SYSCTL_EPWMXLINKCFG_EPWM13   0x1000U    // Enable EPWM13 instance for the XLINK feature
#define SYSCTL_EPWMXLINKCFG_EPWM14   0x2000U    // Enable EPWM14 instance for the XLINK feature
#define SYSCTL_EPWMXLINKCFG_EPWM15   0x4000U    // Enable EPWM15 instance for the XLINK feature
#define SYSCTL_EPWMXLINKCFG_EPWM16   0x8000U    // Enable EPWM16 instance for the XLINK feature
#define SYSCTL_EPWMXLINKCFG_EPWM17   0x10000U   // Enable EPWM17 instance for the XLINK feature
#define SYSCTL_EPWMXLINKCFG_EPWM18   0x20000U   // Enable EPWM18 instance for the XLINK feature

//*************************************************************************************************
//
// The following are defines for the bit fields in the SICCONFIG register
//
//*************************************************************************************************
#define SYSCTL_SICCONFIG_ENABLE      0x1U          // Safety Interconnect Enable
#define SYSCTL_SICCONFIG_TIMEOUT_S   16U
#define SYSCTL_SICCONFIG_TIMEOUT_M   0xFFFF0000U   // Safety Interconnect (SIC) READY TUMEOUT

//*************************************************************************************************
//
// The following are defines for the bit fields in the RSTSTAT register
//
//*************************************************************************************************
#define SYSCTL_RSTSTAT_CPU2   0x1U   // CPU2 Reset Status bit
#define SYSCTL_RSTSTAT_CPU3   0x2U   // CPU3 Reset Status bit

//*************************************************************************************************
//
// The following are defines for the bit fields in the LPMSTAT register
//
//*************************************************************************************************
#define SYSCTL_LPMSTAT_CPU2_S   0U
#define SYSCTL_LPMSTAT_CPU2_M   0x3U   // CPU2 LPM Status
#define SYSCTL_LPMSTAT_CPU3_S   2U
#define SYSCTL_LPMSTAT_CPU3_M   0xCU   // CPU3 LPM Status

//*************************************************************************************************
//
// The following are defines for the bit fields in the TAP_STATUS register
//
//*************************************************************************************************
#define SYSCTL_TAP_STATUS_TAP_STATE_S   0U
#define SYSCTL_TAP_STATUS_TAP_STATE_M   0xFFFFU       // Present TAP State
#define SYSCTL_TAP_STATUS_DCON          0x80000000U   // Debugger Connect Indication

//*************************************************************************************************
//
// The following are defines for the bit fields in the TAP_CONTROL register
//
//*************************************************************************************************
#define SYSCTL_TAP_CONTROL_BSCAN_DIS   0x1U          // Disable BSCAN TAP control
#define SYSCTL_TAP_CONTROL_KEY_S       16U
#define SYSCTL_TAP_CONTROL_KEY_M       0xFFFF0000U   // Key value to enable write

//*************************************************************************************************
//
// The following are defines for the bit fields in the DEVLIFECYCLE register
//
//*************************************************************************************************
#define SYSCTL_DEVLIFECYCLE_DEVTYPE_S     0U
#define SYSCTL_DEVLIFECYCLE_DEVTYPE_M     0xFU       // These bits reflect the state from HSM
                                                     // DEVICE_TYPE
#define SYSCTL_DEVLIFECYCLE_HSSUBTYPE_S   8U
#define SYSCTL_DEVLIFECYCLE_HSSUBTYPE_M   0xF00U     // These bits reflect the state from the HSM
                                                     // HS_SUBTYPE
#define SYSCTL_DEVLIFECYCLE_OVRFLASH      0x10000U   // Status of Override mode with access to
                                                     // Flash
#define SYSCTL_DEVLIFECYCLE_OVRNOFLASH    0x20000U   // Status of Override mode with no access to
                                                     // Flash

//*************************************************************************************************
//
// The following are defines for the bit fields in the SDFMTYPE register
//
//*************************************************************************************************
#define SYSCTL_SDFMTYPE_TYPE_S   0U
#define SYSCTL_SDFMTYPE_TYPE_M   0x3U      // Configure SDFM type
#define SYSCTL_SDFMTYPE_LOCK     0x8000U   // Lock bit

//*************************************************************************************************
//
// The following are defines for the bit fields in the SYNCSELECT register
//
//*************************************************************************************************
#define SYSCTL_SYNCSELECT_SYNCOUT_S   24U
#define SYSCTL_SYNCSELECT_SYNCOUT_M   0x1F000000U   // Select Syncout Source

//*************************************************************************************************
//
// The following are defines for the bit fields in the ADCSOCOUTSELECT register
//
//*************************************************************************************************
#define SYSCTL_ADCSOCOUTSELECT_PWM1SOCAEN    0x1U          // PWM1SOCAEN Enable for ADCSOCAOn
#define SYSCTL_ADCSOCOUTSELECT_PWM2SOCAEN    0x2U          // PWM2SOCAEN Enable for ADCSOCAOn
#define SYSCTL_ADCSOCOUTSELECT_PWM3SOCAEN    0x4U          // PWM3SOCAEN Enable for ADCSOCAOn
#define SYSCTL_ADCSOCOUTSELECT_PWM4SOCAEN    0x8U          // PWM4SOCAEN Enable for ADCSOCAOn
#define SYSCTL_ADCSOCOUTSELECT_PWM5SOCAEN    0x10U         // PWM5SOCAEN Enable for ADCSOCAOn
#define SYSCTL_ADCSOCOUTSELECT_PWM6SOCAEN    0x20U         // PWM6SOCAEN Enable for ADCSOCAOn
#define SYSCTL_ADCSOCOUTSELECT_PWM7SOCAEN    0x40U         // PWM7SOCAEN Enable for ADCSOCAOn
#define SYSCTL_ADCSOCOUTSELECT_PWM8SOCAEN    0x80U         // PWM8SOCAEN Enable for ADCSOCAOn
#define SYSCTL_ADCSOCOUTSELECT_PWM9SOCAEN    0x100U        // PWM9SOCAEN Enable for ADCSOCAOn
#define SYSCTL_ADCSOCOUTSELECT_PWM10SOCAEN   0x200U        // PWM10SOCAEN Enable for ADCSOCAOn
#define SYSCTL_ADCSOCOUTSELECT_PWM11SOCAEN   0x400U        // PWM11SOCAEN Enable for ADCSOCAOn
#define SYSCTL_ADCSOCOUTSELECT_PWM12SOCAEN   0x800U        // PWM12SOCAEN Enable for ADCSOCAOn
#define SYSCTL_ADCSOCOUTSELECT_PWM13SOCAEN   0x1000U       // PWM13SOCAEN Enable for ADCSOCAOn
#define SYSCTL_ADCSOCOUTSELECT_PWM14SOCAEN   0x2000U       // PWM14SOCAEN Enable for ADCSOCAOn
#define SYSCTL_ADCSOCOUTSELECT_PWM15SOCAEN   0x4000U       // PWM15SOCAEN Enable for ADCSOCAOn
#define SYSCTL_ADCSOCOUTSELECT_PWM16SOCAEN   0x8000U       // PWM16SOCAEN Enable for ADCSOCAOn
#define SYSCTL_ADCSOCOUTSELECT_PWM1SOCBEN    0x10000U      // PWM1SOCBEN Enable for ADCSOCBOn
#define SYSCTL_ADCSOCOUTSELECT_PWM2SOCBEN    0x20000U      // PWM2SOCBEN Enable for ADCSOCBOn
#define SYSCTL_ADCSOCOUTSELECT_PWM3SOCBEN    0x40000U      // PWM3SOCBEN Enable for ADCSOCBOn
#define SYSCTL_ADCSOCOUTSELECT_PWM4SOCBEN    0x80000U      // PWM4SOCBEN Enable for ADCSOCBOn
#define SYSCTL_ADCSOCOUTSELECT_PWM5SOCBEN    0x100000U     // PWM5SOCBEN Enable for ADCSOCBOn
#define SYSCTL_ADCSOCOUTSELECT_PWM6SOCBEN    0x200000U     // PWM6SOCBEN Enable for ADCSOCBOn
#define SYSCTL_ADCSOCOUTSELECT_PWM7SOCBEN    0x400000U     // PWM7SOCBEN Enable for ADCSOCBOn
#define SYSCTL_ADCSOCOUTSELECT_PWM8SOCBEN    0x800000U     // PWM8SOCBEN Enable for ADCSOCBOn
#define SYSCTL_ADCSOCOUTSELECT_PWM9SOCBEN    0x1000000U    // PWM9SOCBEN Enable for ADCSOCBOn
#define SYSCTL_ADCSOCOUTSELECT_PWM10SOBAEN   0x2000000U    // PWM10SOBAEN Enable for ADCSOCBOn
#define SYSCTL_ADCSOCOUTSELECT_PWM11SOBAEN   0x4000000U    // PWM11SOBAEN Enable for ADCSOCBOn
#define SYSCTL_ADCSOCOUTSELECT_PWM12SOBAEN   0x8000000U    // PWM12SOBAEN Enable for ADCSOCBOn
#define SYSCTL_ADCSOCOUTSELECT_PWM13SOCBEN   0x10000000U   // PWM13SOCBEN Enable for ADCSOCBOn
#define SYSCTL_ADCSOCOUTSELECT_PWM14SOBAEN   0x20000000U   // PWM14SOBAEN Enable for ADCSOCBOn
#define SYSCTL_ADCSOCOUTSELECT_PWM15SOBAEN   0x40000000U   // PWM15SOBAEN Enable for ADCSOCBOn
#define SYSCTL_ADCSOCOUTSELECT_PWM16SOBAEN   0x80000000U   // PWM16SOBAEN Enable for ADCSOCBOn

//*************************************************************************************************
//
// The following are defines for the bit fields in the ADCSOCOUTSELECT1 register
//
//*************************************************************************************************
#define SYSCTL_ADCSOCOUTSELECT1_PWM17SOCAEN   0x1U       // PWM17SOCAEN Enable for ADCSOCAOn
#define SYSCTL_ADCSOCOUTSELECT1_PWM18SOCAEN   0x2U       // PWM18SOCAEN Enable for ADCSOCAOn
#define SYSCTL_ADCSOCOUTSELECT1_PWM17SOCBEN   0x10000U   // PWM17SOCBEN Enable for ADCSOCBOn
#define SYSCTL_ADCSOCOUTSELECT1_PWM18SOCBEN   0x20000U   // PWM18SOCBEN Enable for ADCSOCBOn

//*************************************************************************************************
//
// The following are defines for the bit fields in the SYNCSOCLOCK register
//
//*************************************************************************************************
#define SYSCTL_SYNCSOCLOCK_SYNCSELECT         0x1U   // SYNCSEL Register Lock bit
#define SYSCTL_SYNCSOCLOCK_ADCSOCOUTSELECT    0x2U   // ADCSOCOUTSELECT Register Lock bit
#define SYSCTL_SYNCSOCLOCK_ADCSOCOUTSELECT1   0x4U   // ADCSOCOUTSELECT1 Register Lock bit

//*************************************************************************************************
//
// The following are defines for the bit fields in the HSMTOCPU_STS1 register
//
//*************************************************************************************************
#define SYSCTL_HSMTOCPU_STS1_SRAM_BANK0     0x1U          // HSM to CPU USURP Communication Signal
                                                          // for SRAM_BANK0
#define SYSCTL_HSMTOCPU_STS1_SRAM_BANK1     0x2U          // HSM to CPU USURP Communication Signal
                                                          // for SRAM_BANK1
#define SYSCTL_HSMTOCPU_STS1_SRAM_BANK2     0x4U          // HSM to CPU USURP Communication Signal
                                                          // for SRAM_BANK2
#define SYSCTL_HSMTOCPU_STS1_SRAM_BANK3     0x8U          // HSM to CPU USURP Communication Signal
                                                          // for SRAM_BANK3
#define SYSCTL_HSMTOCPU_STS1_SRAM_BANK4     0x10U         // HSM to CPU USURP Communication Signal
                                                          // for SRAM_BANK4
#define SYSCTL_HSMTOCPU_STS1_SRAM_BANK5     0x20U         // HSM to CPU USURP Communication Signal
                                                          // for SRAM_BANK5
#define SYSCTL_HSMTOCPU_STS1_SRAM_BANK6     0x40U         // HSM to CPU USURP Communication Signal
                                                          // for SRAM_BANK6
#define SYSCTL_HSMTOCPU_STS1_SRAM_BANK7     0x80U         // HSM to CPU USURP Communication Signal
                                                          // for SRAM_BANK7
#define SYSCTL_HSMTOCPU_STS1_FLC1           0x100U        // HSM to CPU USURP Communication Signal
                                                          // for FLC1
#define SYSCTL_HSMTOCPU_STS1_FLC2           0x200U        // HSM to CPU USURP Communication Signal
                                                          // for FLC2
#define SYSCTL_HSMTOCPU_STS1_LPOST          0x400U        // HSM to CPU USURP Communication Signal
                                                          // for LPOST
#define SYSCTL_HSMTOCPU_STS1_MPOST          0x800U        // HSM to CPU USURP Communication Signal
                                                          // for MPOST
#define SYSCTL_HSMTOCPU_STS1_SOC_GENR_1_S   16U
#define SYSCTL_HSMTOCPU_STS1_SOC_GENR_1_M   0xFF0000U     // HSM to CPU USURP Communication Signal
                                                          // for SOC_GENR_1
#define SYSCTL_HSMTOCPU_STS1_SOC_GENR_2_S   24U
#define SYSCTL_HSMTOCPU_STS1_SOC_GENR_2_M   0xFF000000U   // HSM to CPU USURP Communication Signal
                                                          // for SOC_GENR_2

