TexasInstruments/f29h85x-sdk/source/driverlib/inc/hw_sysctl.h
//*************************************************************************************************
//
// The following are defines for the bit fields in the HSMTOCPU_STS2 register
//
//*************************************************************************************************
#define SYSCTL_HSMTOCPU_STS2_FLC1_BANK0   0x1U         // HSM to CPU USURP Communication Signal for
                                                       // FLC1_BANK0
#define SYSCTL_HSMTOCPU_STS2_FLC2_BANK0   0x10U        // HSM to CPU USURP Communication Signal for
                                                       // FLC2_BANK0
#define SYSCTL_HSMTOCPU_STS2_FLC1_BANK1   0x20U        // HSM to CPU USURP Communication Signal for
                                                       // FLC1_BANK1
#define SYSCTL_HSMTOCPU_STS2_FLC2_BANK1   0x200U       // HSM to CPU USURP Communication Signal for
                                                       // FLC2_BANK1
#define SYSCTL_HSMTOCPU_STS2_FLC1_BANK2   0x400U       // HSM to CPU USURP Communication Signal for
                                                       // FLC1_BANK2
#define SYSCTL_HSMTOCPU_STS2_FLC2_BANK2   0x4000U      // HSM to CPU USURP Communication Signal for
                                                       // FLC2_BANK2
#define SYSCTL_HSMTOCPU_STS2_FLC1_BANK3   0x8000U      // HSM to CPU USURP Communication Signal for
                                                       // FLC1_BANK3
#define SYSCTL_HSMTOCPU_STS2_FLC2_BANK3   0x80000U     // HSM to CPU USURP Communication Signal for
                                                       // FLC2_BANK3
#define SYSCTL_HSMTOCPU_STS2_FLC1_BANK4   0x100000U    // HSM to CPU USURP Communication Signal for
                                                       // FLC1_BANK4
#define SYSCTL_HSMTOCPU_STS2_FLC2_BANK4   0x1000000U   // HSM to CPU USURP Communication Signal for
                                                       // FLC2_BANK4

//*************************************************************************************************
//
// The following are defines for the bit fields in the CLKCFGLOCK1 register
//
//*************************************************************************************************
#define SYSCTL_CLKCFGLOCK1_CLKSRCCTL1       0x1U        // Lock bit for CLKSRCCTL1 register
#define SYSCTL_CLKCFGLOCK1_CLKSRCCTL2       0x2U        // Lock bit for CLKSRCCTL2 register
#define SYSCTL_CLKCFGLOCK1_CLKSRCCTL3       0x4U        // Lock bit for CLKSRCCTL3 register
#define SYSCTL_CLKCFGLOCK1_SYSPLLCTL1       0x8U        // Lock bit for SYSPLLCTL1 register
#define SYSCTL_CLKCFGLOCK1_SYSPLLMULT       0x40U       // Lock bit for SYSPLLMULT register
#define SYSCTL_CLKCFGLOCK1_SYSCLKDIVSEL     0x800U      // Lock bit for SYSCLKDIVSEL register
#define SYSCTL_CLKCFGLOCK1_PERCLKDIVSEL     0x2000U     // Lock bit for PERCLKDIVSEL register
#define SYSCTL_CLKCFGLOCK1_CLBCLKCTL        0x4000U     // Lock bit for CLBCLKCTL register
#define SYSCTL_CLKCFGLOCK1_XTALCR           0x10000U    // Lock bit for XTALCR  & XTALCR2 register
#define SYSCTL_CLKCFGLOCK1_EXTRFLTDET       0x20000U    // Lockbit for EXTRFLTDET register
#define SYSCTL_CLKCFGLOCK1_ETHERCATCLKCTL   0x40000U    // Lockbit for ETHERCATCLKCTL register
#define SYSCTL_CLKCFGLOCK1_HSMCLKDIVSEL     0x80000U    // Lock bit for HSMCLKDIVSEL register
#define SYSCTL_CLKCFGLOCK1_MCANCLKDIVSEL    0x100000U   // Lock bit for MCANCLKDIVSEL register
#define SYSCTL_CLKCFGLOCK1_XCLKOUTDIVSEL    0x200000U   // Lock bit for XCLKOUTDIVSEL register

//*************************************************************************************************
//
// The following are defines for the bit fields in the CLKSRCCTL1 register
//
//*************************************************************************************************
#define SYSCTL_CLKSRCCTL1_OSCCLKSRCSEL_S   0U
#define SYSCTL_CLKSRCCTL1_OSCCLKSRCSEL_M   0x3U   // OSCCLK Source Select Bit

//*************************************************************************************************
//
// The following are defines for the bit fields in the CLKSRCCTL2 register
//
//*************************************************************************************************
#define SYSCTL_CLKSRCCTL2_MCANABCLKSEL_S   10U
#define SYSCTL_CLKSRCCTL2_MCANABCLKSEL_M   0xC00U      // MCANA Bit Clock Source Select Bit
#define SYSCTL_CLKSRCCTL2_MCANBBCLKSEL_S   12U
#define SYSCTL_CLKSRCCTL2_MCANBBCLKSEL_M   0x3000U     // MCANB Bit Clock Source Select Bit
#define SYSCTL_CLKSRCCTL2_MCANCBCLKSEL_S   14U
#define SYSCTL_CLKSRCCTL2_MCANCBCLKSEL_M   0xC000U     // MCANC Bit Clock Source Select Bit
#define SYSCTL_CLKSRCCTL2_MCANDBCLKSEL_S   16U
#define SYSCTL_CLKSRCCTL2_MCANDBCLKSEL_M   0x30000U    // MCAND Bit Clock Source Select Bit
#define SYSCTL_CLKSRCCTL2_MCANEBCLKSEL_S   18U
#define SYSCTL_CLKSRCCTL2_MCANEBCLKSEL_M   0xC0000U    // MCANE Bit Clock Source Select Bit
#define SYSCTL_CLKSRCCTL2_MCANFBCLKSEL_S   20U
#define SYSCTL_CLKSRCCTL2_MCANFBCLKSEL_M   0x300000U   // MCANF Bit Clock Source Select Bit

//*************************************************************************************************
//
// The following are defines for the bit fields in the CLKSRCCTL3 register
//
//*************************************************************************************************
#define SYSCTL_CLKSRCCTL3_XCLKOUTSEL_S   0U
#define SYSCTL_CLKSRCCTL3_XCLKOUTSEL_M   0x1FU   // XCLKOUT Source Select Bit

//*************************************************************************************************
//
// The following are defines for the bit fields in the SYSPLLCTL1 register
//
//*************************************************************************************************
#define SYSCTL_SYSPLLCTL1_PLLEN      0x1U   // SYSPLL enable/disable bit
#define SYSCTL_SYSPLLCTL1_PLLCLKEN   0x2U   // SYSPLL bypassed or included in the PLLSYSCLK path

//*************************************************************************************************
//
// The following are defines for the bit fields in the SYSPLLMULT register
//
//*************************************************************************************************
#define SYSCTL_SYSPLLMULT_IMULT_S    0U
#define SYSCTL_SYSPLLMULT_IMULT_M    0xFFU         // SYSPLL Integer Multiplier
#define SYSCTL_SYSPLLMULT_ODIV_S     16U
#define SYSCTL_SYSPLLMULT_ODIV_M     0x1F0000U     // Output Clock Divider
#define SYSCTL_SYSPLLMULT_REFDIV_S   24U
#define SYSCTL_SYSPLLMULT_REFDIV_M   0x1F000000U   // Reference Clock Divider

//*************************************************************************************************
//
// The following are defines for the bit fields in the SYSPLLSTS register
//
//*************************************************************************************************
#define SYSCTL_SYSPLLSTS_LOCKS                0x1U   // SYSPLL Lock Status Bit
#define SYSCTL_SYSPLLSTS_SLIPS_NOTSUPPORTED   0x2U   // SYSPLL Slip Status Bit

//*************************************************************************************************
//
// The following are defines for the bit fields in the SYSCLKDIVSEL register
//
//*************************************************************************************************
#define SYSCTL_SYSCLKDIVSEL_PLLSYSCLKDIV_S   0U
#define SYSCTL_SYSCLKDIVSEL_PLLSYSCLKDIV_M   0x3FU   // PLLSYSCLK Divide Select

//*************************************************************************************************
//
// The following are defines for the bit fields in the PERCLKDIVSEL register
//
//*************************************************************************************************
#define SYSCTL_PERCLKDIVSEL_EPWMCLKDIV_S    0U
#define SYSCTL_PERCLKDIVSEL_EPWMCLKDIV_M    0x3U      // EPWM Clock Divide Select
#define SYSCTL_PERCLKDIVSEL_EMIF1CLKDIV_S   4U
#define SYSCTL_PERCLKDIVSEL_EMIF1CLKDIV_M   0x30U     // EMIF1  Clock Divide Select
#define SYSCTL_PERCLKDIVSEL_LINACLKDIV_S    8U
#define SYSCTL_PERCLKDIVSEL_LINACLKDIV_M    0x300U    // LINA Clock Divide Select
#define SYSCTL_PERCLKDIVSEL_LINBCLKDIV_S    11U
#define SYSCTL_PERCLKDIVSEL_LINBCLKDIV_M    0x1800U   // LINB Clock Divide Select

//*************************************************************************************************
//
// The following are defines for the bit fields in the XCLKOUTDIVSEL register
//
//*************************************************************************************************
#define SYSCTL_XCLKOUTDIVSEL_XCLKOUTDIV_S   0U
#define SYSCTL_XCLKOUTDIVSEL_XCLKOUTDIV_M   0x3U   // XCLKOUT Divide Select

//*************************************************************************************************
//
// The following are defines for the bit fields in the HSMCLKDIVSEL register
//
//*************************************************************************************************
#define SYSCTL_HSMCLKDIVSEL_HSMCLKDIV_S   0U
#define SYSCTL_HSMCLKDIVSEL_HSMCLKDIV_M   0x1FU   // Divider value for HSMSYSCLK clock input to HSM

//*************************************************************************************************
//
// The following are defines for the bit fields in the MCANCLKDIVSEL register
//
//*************************************************************************************************
#define SYSCTL_MCANCLKDIVSEL_MCANACLKDIV_S   0U
#define SYSCTL_MCANCLKDIVSEL_MCANACLKDIV_M   0x1FU         // Divider CANFD Bit CLK for MCANA
#define SYSCTL_MCANCLKDIVSEL_MCANBCLKDIV_S   5U
#define SYSCTL_MCANCLKDIVSEL_MCANBCLKDIV_M   0x3E0U        // Divider CANFD Bit CLK for MCANB
#define SYSCTL_MCANCLKDIVSEL_MCANCCLKDIV_S   10U
#define SYSCTL_MCANCLKDIVSEL_MCANCCLKDIV_M   0x7C00U       // Divider CANFD Bit CLK for MCANC
#define SYSCTL_MCANCLKDIVSEL_MCANDCLKDIV_S   15U
#define SYSCTL_MCANCLKDIVSEL_MCANDCLKDIV_M   0xF8000U      // Divider CANFD Bit CLK for MCAND
#define SYSCTL_MCANCLKDIVSEL_MCANECLKDIV_S   20U
#define SYSCTL_MCANCLKDIVSEL_MCANECLKDIV_M   0x1F00000U    // Divider CANFD Bit CLK for MCANE
#define SYSCTL_MCANCLKDIVSEL_MCANFCLKDIV_S   25U
#define SYSCTL_MCANCLKDIVSEL_MCANFCLKDIV_M   0x3E000000U   // Divider CANFD Bit CLK for MCANF

//*************************************************************************************************
//
// The following are defines for the bit fields in the CLBCLKCTL register
//
//*************************************************************************************************
#define SYSCTL_CLBCLKCTL_CLKMODECLB1   0x10000U    // Clock mode of CLB1
#define SYSCTL_CLBCLKCTL_CLKMODECLB2   0x20000U    // Clock mode of CLB2
#define SYSCTL_CLBCLKCTL_CLKMODECLB3   0x40000U    // Clock mode of CLB3
#define SYSCTL_CLBCLKCTL_CLKMODECLB4   0x80000U    // Clock mode of CLB4
#define SYSCTL_CLBCLKCTL_CLKMODECLB5   0x100000U   // Clock mode of CLB5
#define SYSCTL_CLBCLKCTL_CLKMODECLB6   0x200000U   // Clock mode of CLB6

//*************************************************************************************************
//
// The following are defines for the bit fields in the MCDCR register
//
//*************************************************************************************************
#define SYSCTL_MCDCR_MCLKSTS              0x1U      // Missing Clock Status Bit
#define SYSCTL_MCDCR_MCLKCLR              0x2U      // Missing Clock Clear Bit
#define SYSCTL_MCDCR_MCLKOFF              0x4U      // Missing Clock Detect Off Bit
#define SYSCTL_MCDCR_OSCOFF               0x8U      // Oscillator Clock Off Bit
#define SYSCTL_MCDCR_SYSREF_LOSTS         0x10U     // SYSPLL "Reference  Lost" Status Bit
#define SYSCTL_MCDCR_SYSREF_LOSTSCLR      0x20U     // Clear for Ref clock lost status
#define SYSCTL_MCDCR_SYSREF_LOST_MCD_EN   0x40U     // Enable for PLL REF_CLK_LOST as MCD cause
#define SYSCTL_MCDCR_EXTR_FAULTS          0x400U    // External Resistor fault indication
#define SYSCTL_MCDCR_EXTR_FAULTSCLR       0x800U    // External Resistor fault status clear
#define SYSCTL_MCDCR_EXTR_FAULT_MCD_EN    0x1000U   // Configuration to enable EXTR_FAULTS as MCD
                                                    // cause

//*************************************************************************************************
//
// The following are defines for the bit fields in the X1CNT register
//
//*************************************************************************************************
#define SYSCTL_X1CNT_X1CNT_S   0U
#define SYSCTL_X1CNT_X1CNT_M   0x7FFU     // X1 Counter
#define SYSCTL_X1CNT_CLR       0x10000U   // X1 Counter Clear

//*************************************************************************************************
//
// The following are defines for the bit fields in the XTALCR register
//
//*************************************************************************************************
#define SYSCTL_XTALCR_OSCOFF   0x1U   // XTAL Oscillator powered-down
#define SYSCTL_XTALCR_SE       0x2U   // XTAL Oscilator in Single-Ended mode

//*************************************************************************************************
//
// The following are defines for the bit fields in the XTALCR2 register
//
//*************************************************************************************************
#define SYSCTL_XTALCR2_XIF   0x1U   // XI Initial value deposited before XOSC start
#define SYSCTL_XTALCR2_XOF   0x2U   // XO Initial value deposited before XOSC start
#define SYSCTL_XTALCR2_FEN   0x4U   // XOSC pads initialisation enable

//*************************************************************************************************
//
// The following are defines for the bit fields in the ETHERCATCLKCTL register
//
//*************************************************************************************************
#define SYSCTL_ETHERCATCLKCTL_ECATDIV_S   1U
#define SYSCTL_ETHERCATCLKCTL_ECATDIV_M   0xEU     // etherCAT clock divider configuration.
#define SYSCTL_ETHERCATCLKCTL_PHYCLKEN    0x100U   // etherCAT PHY clock enable

//*************************************************************************************************
//
// The following are defines for the bit fields in the ETHERCATCTL register
//
//*************************************************************************************************
#define SYSCTL_ETHERCATCTL_I2CLOOPBACK   0x1U   // Loopback I2C port of etherCAT IP to I2C_A.

//*************************************************************************************************
//
// The following are defines for the bit fields in the SYNCBUSY register
//
//*************************************************************************************************
#define SYSCTL_SYNCBUSY_BUSY             0x1U          // Status bit indicating synchronization in
                                                       // progress
#define SYSCTL_SYNCBUSY_MCANCLKDIVSEL    0x10000U      // BUSY status bit for MCANCLKDIVSEL
#define SYSCTL_SYNCBUSY_CLBCLKCTL        0x40000U      // BUSY status bit for CLBCLKCTL
#define SYSCTL_SYNCBUSY_ETHERCATCLKCTL   0x80000U      // BUSY status bit for ETHERCATCLKCTL
#define SYSCTL_SYNCBUSY_PERCLKDIVSEL     0x100000U     // BUSY status bit for PERCLKDIVSEL
#define SYSCTL_SYNCBUSY_SYSCLKDIVSEL     0x200000U     // BUSY status bit for SYSCLKDIVSEL
#define SYSCTL_SYNCBUSY_SYSPLLCTL1       0x400000U     // BUSY status bit for SYSPLLCTL1
#define SYSCTL_SYNCBUSY_SYSPLLMULT       0x800000U     // BUSY status bit for SYSPLLMULT
#define SYSCTL_SYNCBUSY_XCLKOUTDIVSEL    0x1000000U    // BUSY status bit for XCLKOUTDIVSEL
#define SYSCTL_SYNCBUSY_XTALCR           0x2000000U    // BUSY status bit for XTALCR
#define SYSCTL_SYNCBUSY_CLKSRCCTL1       0x4000000U    // BUSY status bit for CLKSRCCTL1
#define SYSCTL_SYNCBUSY_CLKSRCCTL2       0x8000000U    // BUSY status bit for CLKSRCCTL2
#define SYSCTL_SYNCBUSY_CLKSRCCTL3       0x10000000U   // BUSY status bit for CLKSRCCTL3
#define SYSCTL_SYNCBUSY_CPU3TMR2CTL      0x20000000U   // BUSY status bit for CPU3TMR2CTL
#define SYSCTL_SYNCBUSY_CPU1TMR2CTL      0x40000000U   // BUSY status bit for CPU1TMR2CTL
#define SYSCTL_SYNCBUSY_CPU2TMR2CTL      0x80000000U   // BUSY status bit for CPU2TMR2CTL

//*************************************************************************************************
//
// The following are defines for the bit fields in the ESMXRSNCTL register
//
//*************************************************************************************************
#define SYSCTL_ESMXRSNCTL_ESMCPU1CRITICAL   0x1U       // Enable ESMCPU1CRITICAL to cause XRSn
#define SYSCTL_ESMXRSNCTL_ESMCPU2CRITICAL   0x4U       // Enable ESMCPU2CRITICAL to cause XRSn
#define SYSCTL_ESMXRSNCTL_ESMCPU2HIPRIWD    0x8U       // Enable ESMCPU2HIPRIWD to cause XRSn
#define SYSCTL_ESMXRSNCTL_ESMCPU3CRITICAL   0x10U      // Enable ESMCPU3CRITICAL to cause XRSn
#define SYSCTL_ESMXRSNCTL_ESMCPU3HIPRIWD    0x20U      // Enable ESMCPU3HIPRIWD to cause XRSn
#define SYSCTL_ESMXRSNCTL_ESMRESET          0x10000U   // Enable ESMRESET to cause XRSn

//*************************************************************************************************
//
// The following are defines for the bit fields in the EPWM1 register
//
//*************************************************************************************************
#define SYSCTL_EPWM1_FRAMESEL_S   0U
#define SYSCTL_EPWM1_FRAMESEL_M   0x7U    // FRAMESEL Selection for Peripheral Instance
#define SYSCTL_EPWM1_CPUSEL_S     3U
#define SYSCTL_EPWM1_CPUSEL_M     0x38U   // CPUSEL Selection for Peripheral Instance
#define SYSCTL_EPWM1_STANDBYEN    0x40U   // STANDBYEN to enable peripheral clock gating based on
                                          // CPUx
#define SYSCTL_EPWM1_DBGHALTEN    0x80U   // DBGHALTEN to enable peripheral clock gating based on
                                          // CPUx

//*************************************************************************************************
//
// The following are defines for the bit fields in the EPWM2 register
//
//*************************************************************************************************
#define SYSCTL_EPWM2_FRAMESEL_S   0U
#define SYSCTL_EPWM2_FRAMESEL_M   0x7U    // FRAMESEL Selection for Peripheral Instance
#define SYSCTL_EPWM2_CPUSEL_S     3U
#define SYSCTL_EPWM2_CPUSEL_M     0x38U   // CPUSEL Selection for Peripheral Instance
#define SYSCTL_EPWM2_STANDBYEN    0x40U   // STANDBYEN to enable peripheral clock gating based on
                                          // CPUx
#define SYSCTL_EPWM2_DBGHALTEN    0x80U   // DBGHALTEN to enable peripheral clock gating based on
                                          // CPUx

//*************************************************************************************************
//
// The following are defines for the bit fields in the EPWM3 register
//
//*************************************************************************************************
#define SYSCTL_EPWM3_FRAMESEL_S   0U
#define SYSCTL_EPWM3_FRAMESEL_M   0x7U    // FRAMESEL Selection for Peripheral Instance
#define SYSCTL_EPWM3_CPUSEL_S     3U
#define SYSCTL_EPWM3_CPUSEL_M     0x38U   // CPUSEL Selection for Peripheral Instance
#define SYSCTL_EPWM3_STANDBYEN    0x40U   // STANDBYEN to enable peripheral clock gating based on
                                          // CPUx
#define SYSCTL_EPWM3_DBGHALTEN    0x80U   // DBGHALTEN to enable peripheral clock gating based on
                                          // CPUx

//*************************************************************************************************
//
// The following are defines for the bit fields in the EPWM4 register
//
//*************************************************************************************************
#define SYSCTL_EPWM4_FRAMESEL_S   0U
#define SYSCTL_EPWM4_FRAMESEL_M   0x7U    // FRAMESEL Selection for Peripheral Instance
#define SYSCTL_EPWM4_CPUSEL_S     3U
#define SYSCTL_EPWM4_CPUSEL_M     0x38U   // CPUSEL Selection for Peripheral Instance
#define SYSCTL_EPWM4_STANDBYEN    0x40U   // STANDBYEN to enable peripheral clock gating based on
                                          // CPUx
#define SYSCTL_EPWM4_DBGHALTEN    0x80U   // DBGHALTEN to enable peripheral clock gating based on
                                          // CPUx

//*************************************************************************************************
//
// The following are defines for the bit fields in the EPWM5 register
//
//*************************************************************************************************
#define SYSCTL_EPWM5_FRAMESEL_S   0U
#define SYSCTL_EPWM5_FRAMESEL_M   0x7U    // FRAMESEL Selection for Peripheral Instance
#define SYSCTL_EPWM5_CPUSEL_S     3U
#define SYSCTL_EPWM5_CPUSEL_M     0x38U   // CPUSEL Selection for Peripheral Instance
#define SYSCTL_EPWM5_STANDBYEN    0x40U   // STANDBYEN to enable peripheral clock gating based on
                                          // CPUx
#define SYSCTL_EPWM5_DBGHALTEN    0x80U   // DBGHALTEN to enable peripheral clock gating based on
                                          // CPUx

//*************************************************************************************************
//
// The following are defines for the bit fields in the EPWM6 register
//
//*************************************************************************************************
#define SYSCTL_EPWM6_FRAMESEL_S   0U
#define SYSCTL_EPWM6_FRAMESEL_M   0x7U    // FRAMESEL Selection for Peripheral Instance
#define SYSCTL_EPWM6_CPUSEL_S     3U
#define SYSCTL_EPWM6_CPUSEL_M     0x38U   // CPUSEL Selection for Peripheral Instance
#define SYSCTL_EPWM6_STANDBYEN    0x40U   // STANDBYEN to enable peripheral clock gating based on
                                          // CPUx
#define SYSCTL_EPWM6_DBGHALTEN    0x80U   // DBGHALTEN to enable peripheral clock gating based on
                                          // CPUx

//*************************************************************************************************
//
// The following are defines for the bit fields in the EPWM7 register
//
//*************************************************************************************************
#define SYSCTL_EPWM7_FRAMESEL_S   0U
#define SYSCTL_EPWM7_FRAMESEL_M   0x7U    // FRAMESEL Selection for Peripheral Instance
#define SYSCTL_EPWM7_CPUSEL_S     3U
#define SYSCTL_EPWM7_CPUSEL_M     0x38U   // CPUSEL Selection for Peripheral Instance
#define SYSCTL_EPWM7_STANDBYEN    0x40U   // STANDBYEN to enable peripheral clock gating based on
                                          // CPUx
#define SYSCTL_EPWM7_DBGHALTEN    0x80U   // DBGHALTEN to enable peripheral clock gating based on
                                          // CPUx

//*************************************************************************************************
//
// The following are defines for the bit fields in the EPWM8 register
//
//*************************************************************************************************
#define SYSCTL_EPWM8_FRAMESEL_S   0U
#define SYSCTL_EPWM8_FRAMESEL_M   0x7U    // FRAMESEL Selection for Peripheral Instance
#define SYSCTL_EPWM8_CPUSEL_S     3U
#define SYSCTL_EPWM8_CPUSEL_M     0x38U   // CPUSEL Selection for Peripheral Instance
#define SYSCTL_EPWM8_STANDBYEN    0x40U   // STANDBYEN to enable peripheral clock gating based on
                                          // CPUx
#define SYSCTL_EPWM8_DBGHALTEN    0x80U   // DBGHALTEN to enable peripheral clock gating based on
                                          // CPUx

