TexasInstruments/f29h85x-sdk/source/driverlib/inc/hw_sysctl.h
//*************************************************************************************************
//
// The following are defines for the bit fields in the EPWM9 register
//
//*************************************************************************************************
#define SYSCTL_EPWM9_FRAMESEL_S   0U
#define SYSCTL_EPWM9_FRAMESEL_M   0x7U    // FRAMESEL Selection for Peripheral Instance
#define SYSCTL_EPWM9_CPUSEL_S     3U
#define SYSCTL_EPWM9_CPUSEL_M     0x38U   // CPUSEL Selection for Peripheral Instance
#define SYSCTL_EPWM9_STANDBYEN    0x40U   // STANDBYEN to enable peripheral clock gating based on
                                          // CPUx
#define SYSCTL_EPWM9_DBGHALTEN    0x80U   // DBGHALTEN to enable peripheral clock gating based on
                                          // CPUx

//*************************************************************************************************
//
// The following are defines for the bit fields in the EPWM10 register
//
//*************************************************************************************************
#define SYSCTL_EPWM10_FRAMESEL_S   0U
#define SYSCTL_EPWM10_FRAMESEL_M   0x7U    // FRAMESEL Selection for Peripheral Instance
#define SYSCTL_EPWM10_CPUSEL_S     3U
#define SYSCTL_EPWM10_CPUSEL_M     0x38U   // CPUSEL Selection for Peripheral Instance
#define SYSCTL_EPWM10_STANDBYEN    0x40U   // STANDBYEN to enable peripheral clock gating based on
                                           // CPUx
#define SYSCTL_EPWM10_DBGHALTEN    0x80U   // DBGHALTEN to enable peripheral clock gating based on
                                           // CPUx

//*************************************************************************************************
//
// The following are defines for the bit fields in the EPWM11 register
//
//*************************************************************************************************
#define SYSCTL_EPWM11_FRAMESEL_S   0U
#define SYSCTL_EPWM11_FRAMESEL_M   0x7U    // FRAMESEL Selection for Peripheral Instance
#define SYSCTL_EPWM11_CPUSEL_S     3U
#define SYSCTL_EPWM11_CPUSEL_M     0x38U   // CPUSEL Selection for Peripheral Instance
#define SYSCTL_EPWM11_STANDBYEN    0x40U   // STANDBYEN to enable peripheral clock gating based on
                                           // CPUx
#define SYSCTL_EPWM11_DBGHALTEN    0x80U   // DBGHALTEN to enable peripheral clock gating based on
                                           // CPUx

//*************************************************************************************************
//
// The following are defines for the bit fields in the EPWM12 register
//
//*************************************************************************************************
#define SYSCTL_EPWM12_FRAMESEL_S   0U
#define SYSCTL_EPWM12_FRAMESEL_M   0x7U    // FRAMESEL Selection for Peripheral Instance
#define SYSCTL_EPWM12_CPUSEL_S     3U
#define SYSCTL_EPWM12_CPUSEL_M     0x38U   // CPUSEL Selection for Peripheral Instance
#define SYSCTL_EPWM12_STANDBYEN    0x40U   // STANDBYEN to enable peripheral clock gating based on
                                           // CPUx
#define SYSCTL_EPWM12_DBGHALTEN    0x80U   // DBGHALTEN to enable peripheral clock gating based on
                                           // CPUx

//*************************************************************************************************
//
// The following are defines for the bit fields in the EPWM13 register
//
//*************************************************************************************************
#define SYSCTL_EPWM13_FRAMESEL_S   0U
#define SYSCTL_EPWM13_FRAMESEL_M   0x7U    // FRAMESEL Selection for Peripheral Instance
#define SYSCTL_EPWM13_CPUSEL_S     3U
#define SYSCTL_EPWM13_CPUSEL_M     0x38U   // CPUSEL Selection for Peripheral Instance
#define SYSCTL_EPWM13_STANDBYEN    0x40U   // STANDBYEN to enable peripheral clock gating based on
                                           // CPUx
#define SYSCTL_EPWM13_DBGHALTEN    0x80U   // DBGHALTEN to enable peripheral clock gating based on
                                           // CPUx

//*************************************************************************************************
//
// The following are defines for the bit fields in the EPWM14 register
//
//*************************************************************************************************
#define SYSCTL_EPWM14_FRAMESEL_S   0U
#define SYSCTL_EPWM14_FRAMESEL_M   0x7U    // FRAMESEL Selection for Peripheral Instance
#define SYSCTL_EPWM14_CPUSEL_S     3U
#define SYSCTL_EPWM14_CPUSEL_M     0x38U   // CPUSEL Selection for Peripheral Instance
#define SYSCTL_EPWM14_STANDBYEN    0x40U   // STANDBYEN to enable peripheral clock gating based on
                                           // CPUx
#define SYSCTL_EPWM14_DBGHALTEN    0x80U   // DBGHALTEN to enable peripheral clock gating based on
                                           // CPUx

//*************************************************************************************************
//
// The following are defines for the bit fields in the EPWM15 register
//
//*************************************************************************************************
#define SYSCTL_EPWM15_FRAMESEL_S   0U
#define SYSCTL_EPWM15_FRAMESEL_M   0x7U    // FRAMESEL Selection for Peripheral Instance
#define SYSCTL_EPWM15_CPUSEL_S     3U
#define SYSCTL_EPWM15_CPUSEL_M     0x38U   // CPUSEL Selection for Peripheral Instance
#define SYSCTL_EPWM15_STANDBYEN    0x40U   // STANDBYEN to enable peripheral clock gating based on
                                           // CPUx
#define SYSCTL_EPWM15_DBGHALTEN    0x80U   // DBGHALTEN to enable peripheral clock gating based on
                                           // CPUx

//*************************************************************************************************
//
// The following are defines for the bit fields in the EPWM16 register
//
//*************************************************************************************************
#define SYSCTL_EPWM16_FRAMESEL_S   0U
#define SYSCTL_EPWM16_FRAMESEL_M   0x7U    // FRAMESEL Selection for Peripheral Instance
#define SYSCTL_EPWM16_CPUSEL_S     3U
#define SYSCTL_EPWM16_CPUSEL_M     0x38U   // CPUSEL Selection for Peripheral Instance
#define SYSCTL_EPWM16_STANDBYEN    0x40U   // STANDBYEN to enable peripheral clock gating based on
                                           // CPUx
#define SYSCTL_EPWM16_DBGHALTEN    0x80U   // DBGHALTEN to enable peripheral clock gating based on
                                           // CPUx

//*************************************************************************************************
//
// The following are defines for the bit fields in the EPWM17 register
//
//*************************************************************************************************
#define SYSCTL_EPWM17_FRAMESEL_S   0U
#define SYSCTL_EPWM17_FRAMESEL_M   0x7U    // FRAMESEL Selection for Peripheral Instance
#define SYSCTL_EPWM17_CPUSEL_S     3U
#define SYSCTL_EPWM17_CPUSEL_M     0x38U   // CPUSEL Selection for Peripheral Instance
#define SYSCTL_EPWM17_STANDBYEN    0x40U   // STANDBYEN to enable peripheral clock gating based on
                                           // CPUx
#define SYSCTL_EPWM17_DBGHALTEN    0x80U   // DBGHALTEN to enable peripheral clock gating based on
                                           // CPUx

//*************************************************************************************************
//
// The following are defines for the bit fields in the EPWM18 register
//
//*************************************************************************************************
#define SYSCTL_EPWM18_FRAMESEL_S   0U
#define SYSCTL_EPWM18_FRAMESEL_M   0x7U    // FRAMESEL Selection for Peripheral Instance
#define SYSCTL_EPWM18_CPUSEL_S     3U
#define SYSCTL_EPWM18_CPUSEL_M     0x38U   // CPUSEL Selection for Peripheral Instance
#define SYSCTL_EPWM18_STANDBYEN    0x40U   // STANDBYEN to enable peripheral clock gating based on
                                           // CPUx
#define SYSCTL_EPWM18_DBGHALTEN    0x80U   // DBGHALTEN to enable peripheral clock gating based on
                                           // CPUx

//*************************************************************************************************
//
// The following are defines for the bit fields in the HRCAL0 register
//
//*************************************************************************************************
#define SYSCTL_HRCAL0_FRAMESEL_S   0U
#define SYSCTL_HRCAL0_FRAMESEL_M   0x7U    // FRAMESEL Selection for Peripheral Instance
#define SYSCTL_HRCAL0_CPUSEL_S     3U
#define SYSCTL_HRCAL0_CPUSEL_M     0x38U   // CPUSEL Selection for Peripheral Instance
#define SYSCTL_HRCAL0_STANDBYEN    0x40U   // STANDBYEN to enable peripheral clock gating based on
                                           // CPUx
#define SYSCTL_HRCAL0_DBGHALTEN    0x80U   // DBGHALTEN to enable peripheral clock gating based on
                                           // CPUx

//*************************************************************************************************
//
// The following are defines for the bit fields in the HRCAL1 register
//
//*************************************************************************************************
#define SYSCTL_HRCAL1_FRAMESEL_S   0U
#define SYSCTL_HRCAL1_FRAMESEL_M   0x7U    // FRAMESEL Selection for Peripheral Instance
#define SYSCTL_HRCAL1_CPUSEL_S     3U
#define SYSCTL_HRCAL1_CPUSEL_M     0x38U   // CPUSEL Selection for Peripheral Instance
#define SYSCTL_HRCAL1_STANDBYEN    0x40U   // STANDBYEN to enable peripheral clock gating based on
                                           // CPUx
#define SYSCTL_HRCAL1_DBGHALTEN    0x80U   // DBGHALTEN to enable peripheral clock gating based on
                                           // CPUx

//*************************************************************************************************
//
// The following are defines for the bit fields in the HRCAL2 register
//
//*************************************************************************************************
#define SYSCTL_HRCAL2_FRAMESEL_S   0U
#define SYSCTL_HRCAL2_FRAMESEL_M   0x7U    // FRAMESEL Selection for Peripheral Instance
#define SYSCTL_HRCAL2_CPUSEL_S     3U
#define SYSCTL_HRCAL2_CPUSEL_M     0x38U   // CPUSEL Selection for Peripheral Instance
#define SYSCTL_HRCAL2_STANDBYEN    0x40U   // STANDBYEN to enable peripheral clock gating based on
                                           // CPUx
#define SYSCTL_HRCAL2_DBGHALTEN    0x80U   // DBGHALTEN to enable peripheral clock gating based on
                                           // CPUx

//*************************************************************************************************
//
// The following are defines for the bit fields in the ECAP1 register
//
//*************************************************************************************************
#define SYSCTL_ECAP1_FRAMESEL_S   0U
#define SYSCTL_ECAP1_FRAMESEL_M   0x7U    // FRAMESEL Selection for Peripheral Instance
#define SYSCTL_ECAP1_CPUSEL_S     3U
#define SYSCTL_ECAP1_CPUSEL_M     0x38U   // CPUSEL Selection for Peripheral Instance
#define SYSCTL_ECAP1_STANDBYEN    0x40U   // STANDBYEN to enable peripheral clock gating based on
                                          // CPUx
#define SYSCTL_ECAP1_DBGHALTEN    0x80U   // DBGHALTEN to enable peripheral clock gating based on
                                          // CPUx

//*************************************************************************************************
//
// The following are defines for the bit fields in the ECAP2 register
//
//*************************************************************************************************
#define SYSCTL_ECAP2_FRAMESEL_S   0U
#define SYSCTL_ECAP2_FRAMESEL_M   0x7U    // FRAMESEL Selection for Peripheral Instance
#define SYSCTL_ECAP2_CPUSEL_S     3U
#define SYSCTL_ECAP2_CPUSEL_M     0x38U   // CPUSEL Selection for Peripheral Instance
#define SYSCTL_ECAP2_STANDBYEN    0x40U   // STANDBYEN to enable peripheral clock gating based on
                                          // CPUx
#define SYSCTL_ECAP2_DBGHALTEN    0x80U   // DBGHALTEN to enable peripheral clock gating based on
                                          // CPUx

//*************************************************************************************************
//
// The following are defines for the bit fields in the ECAP3 register
//
//*************************************************************************************************
#define SYSCTL_ECAP3_FRAMESEL_S   0U
#define SYSCTL_ECAP3_FRAMESEL_M   0x7U    // FRAMESEL Selection for Peripheral Instance
#define SYSCTL_ECAP3_CPUSEL_S     3U
#define SYSCTL_ECAP3_CPUSEL_M     0x38U   // CPUSEL Selection for Peripheral Instance
#define SYSCTL_ECAP3_STANDBYEN    0x40U   // STANDBYEN to enable peripheral clock gating based on
                                          // CPUx
#define SYSCTL_ECAP3_DBGHALTEN    0x80U   // DBGHALTEN to enable peripheral clock gating based on
                                          // CPUx

//*************************************************************************************************
//
// The following are defines for the bit fields in the ECAP4 register
//
//*************************************************************************************************
#define SYSCTL_ECAP4_FRAMESEL_S   0U
#define SYSCTL_ECAP4_FRAMESEL_M   0x7U    // FRAMESEL Selection for Peripheral Instance
#define SYSCTL_ECAP4_CPUSEL_S     3U
#define SYSCTL_ECAP4_CPUSEL_M     0x38U   // CPUSEL Selection for Peripheral Instance
#define SYSCTL_ECAP4_STANDBYEN    0x40U   // STANDBYEN to enable peripheral clock gating based on
                                          // CPUx
#define SYSCTL_ECAP4_DBGHALTEN    0x80U   // DBGHALTEN to enable peripheral clock gating based on
                                          // CPUx

//*************************************************************************************************
//
// The following are defines for the bit fields in the ECAP5 register
//
//*************************************************************************************************
#define SYSCTL_ECAP5_FRAMESEL_S   0U
#define SYSCTL_ECAP5_FRAMESEL_M   0x7U    // FRAMESEL Selection for Peripheral Instance
#define SYSCTL_ECAP5_CPUSEL_S     3U
#define SYSCTL_ECAP5_CPUSEL_M     0x38U   // CPUSEL Selection for Peripheral Instance
#define SYSCTL_ECAP5_STANDBYEN    0x40U   // STANDBYEN to enable peripheral clock gating based on
                                          // CPUx
#define SYSCTL_ECAP5_DBGHALTEN    0x80U   // DBGHALTEN to enable peripheral clock gating based on
                                          // CPUx

//*************************************************************************************************
//
// The following are defines for the bit fields in the ECAP6 register
//
//*************************************************************************************************
#define SYSCTL_ECAP6_FRAMESEL_S   0U
#define SYSCTL_ECAP6_FRAMESEL_M   0x7U    // FRAMESEL Selection for Peripheral Instance
#define SYSCTL_ECAP6_CPUSEL_S     3U
#define SYSCTL_ECAP6_CPUSEL_M     0x38U   // CPUSEL Selection for Peripheral Instance
#define SYSCTL_ECAP6_STANDBYEN    0x40U   // STANDBYEN to enable peripheral clock gating based on
                                          // CPUx
#define SYSCTL_ECAP6_DBGHALTEN    0x80U   // DBGHALTEN to enable peripheral clock gating based on
                                          // CPUx

//*************************************************************************************************
//
// The following are defines for the bit fields in the EQEP1 register
//
//*************************************************************************************************
#define SYSCTL_EQEP1_FRAMESEL_S   0U
#define SYSCTL_EQEP1_FRAMESEL_M   0x7U    // FRAMESEL Selection for Peripheral Instance
#define SYSCTL_EQEP1_CPUSEL_S     3U
#define SYSCTL_EQEP1_CPUSEL_M     0x38U   // CPUSEL Selection for Peripheral Instance
#define SYSCTL_EQEP1_STANDBYEN    0x40U   // STANDBYEN to enable peripheral clock gating based on
                                          // CPUx
#define SYSCTL_EQEP1_DBGHALTEN    0x80U   // DBGHALTEN to enable peripheral clock gating based on
                                          // CPUx

//*************************************************************************************************
//
// The following are defines for the bit fields in the EQEP2 register
//
//*************************************************************************************************
#define SYSCTL_EQEP2_FRAMESEL_S   0U
#define SYSCTL_EQEP2_FRAMESEL_M   0x7U    // FRAMESEL Selection for Peripheral Instance
#define SYSCTL_EQEP2_CPUSEL_S     3U
#define SYSCTL_EQEP2_CPUSEL_M     0x38U   // CPUSEL Selection for Peripheral Instance
#define SYSCTL_EQEP2_STANDBYEN    0x40U   // STANDBYEN to enable peripheral clock gating based on
                                          // CPUx
#define SYSCTL_EQEP2_DBGHALTEN    0x80U   // DBGHALTEN to enable peripheral clock gating based on
                                          // CPUx

//*************************************************************************************************
//
// The following are defines for the bit fields in the EQEP3 register
//
//*************************************************************************************************
#define SYSCTL_EQEP3_FRAMESEL_S   0U
#define SYSCTL_EQEP3_FRAMESEL_M   0x7U    // FRAMESEL Selection for Peripheral Instance
#define SYSCTL_EQEP3_CPUSEL_S     3U
#define SYSCTL_EQEP3_CPUSEL_M     0x38U   // CPUSEL Selection for Peripheral Instance
#define SYSCTL_EQEP3_STANDBYEN    0x40U   // STANDBYEN to enable peripheral clock gating based on
                                          // CPUx
#define SYSCTL_EQEP3_DBGHALTEN    0x80U   // DBGHALTEN to enable peripheral clock gating based on
                                          // CPUx

//*************************************************************************************************
//
// The following are defines for the bit fields in the EQEP4 register
//
//*************************************************************************************************
#define SYSCTL_EQEP4_FRAMESEL_S   0U
#define SYSCTL_EQEP4_FRAMESEL_M   0x7U    // FRAMESEL Selection for Peripheral Instance
#define SYSCTL_EQEP4_CPUSEL_S     3U
#define SYSCTL_EQEP4_CPUSEL_M     0x38U   // CPUSEL Selection for Peripheral Instance
#define SYSCTL_EQEP4_STANDBYEN    0x40U   // STANDBYEN to enable peripheral clock gating based on
                                          // CPUx
#define SYSCTL_EQEP4_DBGHALTEN    0x80U   // DBGHALTEN to enable peripheral clock gating based on
                                          // CPUx

//*************************************************************************************************
//
// The following are defines for the bit fields in the EQEP5 register
//
//*************************************************************************************************
#define SYSCTL_EQEP5_FRAMESEL_S   0U
#define SYSCTL_EQEP5_FRAMESEL_M   0x7U    // FRAMESEL Selection for Peripheral Instance
#define SYSCTL_EQEP5_CPUSEL_S     3U
#define SYSCTL_EQEP5_CPUSEL_M     0x38U   // CPUSEL Selection for Peripheral Instance
#define SYSCTL_EQEP5_STANDBYEN    0x40U   // STANDBYEN to enable peripheral clock gating based on
                                          // CPUx
#define SYSCTL_EQEP5_DBGHALTEN    0x80U   // DBGHALTEN to enable peripheral clock gating based on
                                          // CPUx

//*************************************************************************************************
//
// The following are defines for the bit fields in the EQEP6 register
//
//*************************************************************************************************
#define SYSCTL_EQEP6_FRAMESEL_S   0U
#define SYSCTL_EQEP6_FRAMESEL_M   0x7U    // FRAMESEL Selection for Peripheral Instance
#define SYSCTL_EQEP6_CPUSEL_S     3U
#define SYSCTL_EQEP6_CPUSEL_M     0x38U   // CPUSEL Selection for Peripheral Instance
#define SYSCTL_EQEP6_STANDBYEN    0x40U   // STANDBYEN to enable peripheral clock gating based on
                                          // CPUx
#define SYSCTL_EQEP6_DBGHALTEN    0x80U   // DBGHALTEN to enable peripheral clock gating based on
                                          // CPUx

//*************************************************************************************************
//
// The following are defines for the bit fields in the SDFM1 register
//
//*************************************************************************************************
#define SYSCTL_SDFM1_FRAMESEL_S   0U
#define SYSCTL_SDFM1_FRAMESEL_M   0x7U    // FRAMESEL Selection for Peripheral Instance
#define SYSCTL_SDFM1_CPUSEL_S     3U
#define SYSCTL_SDFM1_CPUSEL_M     0x38U   // CPUSEL Selection for Peripheral Instance
#define SYSCTL_SDFM1_STANDBYEN    0x40U   // STANDBYEN to enable peripheral clock gating based on
                                          // CPUx
#define SYSCTL_SDFM1_DBGHALTEN    0x80U   // DBGHALTEN to enable peripheral clock gating based on
                                          // CPUx

//*************************************************************************************************
//
// The following are defines for the bit fields in the SDFM2 register
//
//*************************************************************************************************
#define SYSCTL_SDFM2_FRAMESEL_S   0U
#define SYSCTL_SDFM2_FRAMESEL_M   0x7U    // FRAMESEL Selection for Peripheral Instance
#define SYSCTL_SDFM2_CPUSEL_S     3U
#define SYSCTL_SDFM2_CPUSEL_M     0x38U   // CPUSEL Selection for Peripheral Instance
#define SYSCTL_SDFM2_STANDBYEN    0x40U   // STANDBYEN to enable peripheral clock gating based on
                                          // CPUx
#define SYSCTL_SDFM2_DBGHALTEN    0x80U   // DBGHALTEN to enable peripheral clock gating based on
                                          // CPUx

//*************************************************************************************************
//
// The following are defines for the bit fields in the SDFM3 register
//
//*************************************************************************************************
#define SYSCTL_SDFM3_FRAMESEL_S   0U
#define SYSCTL_SDFM3_FRAMESEL_M   0x7U    // FRAMESEL Selection for Peripheral Instance
#define SYSCTL_SDFM3_CPUSEL_S     3U
#define SYSCTL_SDFM3_CPUSEL_M     0x38U   // CPUSEL Selection for Peripheral Instance
#define SYSCTL_SDFM3_STANDBYEN    0x40U   // STANDBYEN to enable peripheral clock gating based on
                                          // CPUx
#define SYSCTL_SDFM3_DBGHALTEN    0x80U   // DBGHALTEN to enable peripheral clock gating based on
                                          // CPUx

//*************************************************************************************************
//
// The following are defines for the bit fields in the SDFM4 register
//
//*************************************************************************************************
#define SYSCTL_SDFM4_FRAMESEL_S   0U
#define SYSCTL_SDFM4_FRAMESEL_M   0x7U    // FRAMESEL Selection for Peripheral Instance
#define SYSCTL_SDFM4_CPUSEL_S     3U
#define SYSCTL_SDFM4_CPUSEL_M     0x38U   // CPUSEL Selection for Peripheral Instance
#define SYSCTL_SDFM4_STANDBYEN    0x40U   // STANDBYEN to enable peripheral clock gating based on
                                          // CPUx
#define SYSCTL_SDFM4_DBGHALTEN    0x80U   // DBGHALTEN to enable peripheral clock gating based on
                                          // CPUx

