TexasInstruments/f29h85x-sdk/source/driverlib/inc/hw_sysctl.h
//*************************************************************************************************
//
// The following are defines for the bit fields in the UARTA register
//
//*************************************************************************************************
#define SYSCTL_UARTA_FRAMESEL_S   0U
#define SYSCTL_UARTA_FRAMESEL_M   0x7U    // FRAMESEL Selection for Peripheral Instance
#define SYSCTL_UARTA_CPUSEL_S     3U
#define SYSCTL_UARTA_CPUSEL_M     0x38U   // CPUSEL Selection for Peripheral Instance
#define SYSCTL_UARTA_STANDBYEN    0x40U   // STANDBYEN to enable peripheral clock gating based on
                                          // CPUx
#define SYSCTL_UARTA_DBGHALTEN    0x80U   // DBGHALTEN to enable peripheral clock gating based on
                                          // CPUx

//*************************************************************************************************
//
// The following are defines for the bit fields in the UARTB register
//
//*************************************************************************************************
#define SYSCTL_UARTB_FRAMESEL_S   0U
#define SYSCTL_UARTB_FRAMESEL_M   0x7U    // FRAMESEL Selection for Peripheral Instance
#define SYSCTL_UARTB_CPUSEL_S     3U
#define SYSCTL_UARTB_CPUSEL_M     0x38U   // CPUSEL Selection for Peripheral Instance
#define SYSCTL_UARTB_STANDBYEN    0x40U   // STANDBYEN to enable peripheral clock gating based on
                                          // CPUx
#define SYSCTL_UARTB_DBGHALTEN    0x80U   // DBGHALTEN to enable peripheral clock gating based on
                                          // CPUx

//*************************************************************************************************
//
// The following are defines for the bit fields in the UARTC register
//
//*************************************************************************************************
#define SYSCTL_UARTC_FRAMESEL_S   0U
#define SYSCTL_UARTC_FRAMESEL_M   0x7U    // FRAMESEL Selection for Peripheral Instance
#define SYSCTL_UARTC_CPUSEL_S     3U
#define SYSCTL_UARTC_CPUSEL_M     0x38U   // CPUSEL Selection for Peripheral Instance
#define SYSCTL_UARTC_STANDBYEN    0x40U   // STANDBYEN to enable peripheral clock gating based on
                                          // CPUx
#define SYSCTL_UARTC_DBGHALTEN    0x80U   // DBGHALTEN to enable peripheral clock gating based on
                                          // CPUx

//*************************************************************************************************
//
// The following are defines for the bit fields in the UARTD register
//
//*************************************************************************************************
#define SYSCTL_UARTD_FRAMESEL_S   0U
#define SYSCTL_UARTD_FRAMESEL_M   0x7U    // FRAMESEL Selection for Peripheral Instance
#define SYSCTL_UARTD_CPUSEL_S     3U
#define SYSCTL_UARTD_CPUSEL_M     0x38U   // CPUSEL Selection for Peripheral Instance
#define SYSCTL_UARTD_STANDBYEN    0x40U   // STANDBYEN to enable peripheral clock gating based on
                                          // CPUx
#define SYSCTL_UARTD_DBGHALTEN    0x80U   // DBGHALTEN to enable peripheral clock gating based on
                                          // CPUx

//*************************************************************************************************
//
// The following are defines for the bit fields in the UARTE register
//
//*************************************************************************************************
#define SYSCTL_UARTE_FRAMESEL_S   0U
#define SYSCTL_UARTE_FRAMESEL_M   0x7U    // FRAMESEL Selection for Peripheral Instance
#define SYSCTL_UARTE_CPUSEL_S     3U
#define SYSCTL_UARTE_CPUSEL_M     0x38U   // CPUSEL Selection for Peripheral Instance
#define SYSCTL_UARTE_STANDBYEN    0x40U   // STANDBYEN to enable peripheral clock gating based on
                                          // CPUx
#define SYSCTL_UARTE_DBGHALTEN    0x80U   // DBGHALTEN to enable peripheral clock gating based on
                                          // CPUx

//*************************************************************************************************
//
// The following are defines for the bit fields in the UARTF register
//
//*************************************************************************************************
#define SYSCTL_UARTF_FRAMESEL_S   0U
#define SYSCTL_UARTF_FRAMESEL_M   0x7U    // FRAMESEL Selection for Peripheral Instance
#define SYSCTL_UARTF_CPUSEL_S     3U
#define SYSCTL_UARTF_CPUSEL_M     0x38U   // CPUSEL Selection for Peripheral Instance
#define SYSCTL_UARTF_STANDBYEN    0x40U   // STANDBYEN to enable peripheral clock gating based on
                                          // CPUx
#define SYSCTL_UARTF_DBGHALTEN    0x80U   // DBGHALTEN to enable peripheral clock gating based on
                                          // CPUx

//*************************************************************************************************
//
// The following are defines for the bit fields in the SPIA register
//
//*************************************************************************************************
#define SYSCTL_SPIA_FRAMESEL_S   0U
#define SYSCTL_SPIA_FRAMESEL_M   0x7U    // FRAMESEL Selection for Peripheral Instance
#define SYSCTL_SPIA_CPUSEL_S     3U
#define SYSCTL_SPIA_CPUSEL_M     0x38U   // CPUSEL Selection for Peripheral Instance
#define SYSCTL_SPIA_STANDBYEN    0x40U   // STANDBYEN to enable peripheral clock gating based on
                                         // CPUx
#define SYSCTL_SPIA_DBGHALTEN    0x80U   // DBGHALTEN to enable peripheral clock gating based on
                                         // CPUx

//*************************************************************************************************
//
// The following are defines for the bit fields in the SPIB register
//
//*************************************************************************************************
#define SYSCTL_SPIB_FRAMESEL_S   0U
#define SYSCTL_SPIB_FRAMESEL_M   0x7U    // FRAMESEL Selection for Peripheral Instance
#define SYSCTL_SPIB_CPUSEL_S     3U
#define SYSCTL_SPIB_CPUSEL_M     0x38U   // CPUSEL Selection for Peripheral Instance
#define SYSCTL_SPIB_STANDBYEN    0x40U   // STANDBYEN to enable peripheral clock gating based on
                                         // CPUx
#define SYSCTL_SPIB_DBGHALTEN    0x80U   // DBGHALTEN to enable peripheral clock gating based on
                                         // CPUx

//*************************************************************************************************
//
// The following are defines for the bit fields in the SPIC register
//
//*************************************************************************************************
#define SYSCTL_SPIC_FRAMESEL_S   0U
#define SYSCTL_SPIC_FRAMESEL_M   0x7U    // FRAMESEL Selection for Peripheral Instance
#define SYSCTL_SPIC_CPUSEL_S     3U
#define SYSCTL_SPIC_CPUSEL_M     0x38U   // CPUSEL Selection for Peripheral Instance
#define SYSCTL_SPIC_STANDBYEN    0x40U   // STANDBYEN to enable peripheral clock gating based on
                                         // CPUx
#define SYSCTL_SPIC_DBGHALTEN    0x80U   // DBGHALTEN to enable peripheral clock gating based on
                                         // CPUx

//*************************************************************************************************
//
// The following are defines for the bit fields in the SPID register
//
//*************************************************************************************************
#define SYSCTL_SPID_FRAMESEL_S   0U
#define SYSCTL_SPID_FRAMESEL_M   0x7U    // FRAMESEL Selection for Peripheral Instance
#define SYSCTL_SPID_CPUSEL_S     3U
#define SYSCTL_SPID_CPUSEL_M     0x38U   // CPUSEL Selection for Peripheral Instance
#define SYSCTL_SPID_STANDBYEN    0x40U   // STANDBYEN to enable peripheral clock gating based on
                                         // CPUx
#define SYSCTL_SPID_DBGHALTEN    0x80U   // DBGHALTEN to enable peripheral clock gating based on
                                         // CPUx

//*************************************************************************************************
//
// The following are defines for the bit fields in the SPIE register
//
//*************************************************************************************************
#define SYSCTL_SPIE_FRAMESEL_S   0U
#define SYSCTL_SPIE_FRAMESEL_M   0x7U    // FRAMESEL Selection for Peripheral Instance
#define SYSCTL_SPIE_CPUSEL_S     3U
#define SYSCTL_SPIE_CPUSEL_M     0x38U   // CPUSEL Selection for Peripheral Instance
#define SYSCTL_SPIE_STANDBYEN    0x40U   // STANDBYEN to enable peripheral clock gating based on
                                         // CPUx
#define SYSCTL_SPIE_DBGHALTEN    0x80U   // DBGHALTEN to enable peripheral clock gating based on
                                         // CPUx

//*************************************************************************************************
//
// The following are defines for the bit fields in the I2CA register
//
//*************************************************************************************************
#define SYSCTL_I2CA_FRAMESEL_S   0U
#define SYSCTL_I2CA_FRAMESEL_M   0x7U    // FRAMESEL Selection for Peripheral Instance
#define SYSCTL_I2CA_CPUSEL_S     3U
#define SYSCTL_I2CA_CPUSEL_M     0x38U   // CPUSEL Selection for Peripheral Instance
#define SYSCTL_I2CA_STANDBYEN    0x40U   // STANDBYEN to enable peripheral clock gating based on
                                         // CPUx
#define SYSCTL_I2CA_DBGHALTEN    0x80U   // DBGHALTEN to enable peripheral clock gating based on
                                         // CPUx

//*************************************************************************************************
//
// The following are defines for the bit fields in the I2CB register
//
//*************************************************************************************************
#define SYSCTL_I2CB_FRAMESEL_S   0U
#define SYSCTL_I2CB_FRAMESEL_M   0x7U    // FRAMESEL Selection for Peripheral Instance
#define SYSCTL_I2CB_CPUSEL_S     3U
#define SYSCTL_I2CB_CPUSEL_M     0x38U   // CPUSEL Selection for Peripheral Instance
#define SYSCTL_I2CB_STANDBYEN    0x40U   // STANDBYEN to enable peripheral clock gating based on
                                         // CPUx
#define SYSCTL_I2CB_DBGHALTEN    0x80U   // DBGHALTEN to enable peripheral clock gating based on
                                         // CPUx

//*************************************************************************************************
//
// The following are defines for the bit fields in the PMBUSA register
//
//*************************************************************************************************
#define SYSCTL_PMBUSA_FRAMESEL_S   0U
#define SYSCTL_PMBUSA_FRAMESEL_M   0x7U    // FRAMESEL Selection for Peripheral Instance
#define SYSCTL_PMBUSA_CPUSEL_S     3U
#define SYSCTL_PMBUSA_CPUSEL_M     0x38U   // CPUSEL Selection for Peripheral Instance
#define SYSCTL_PMBUSA_STANDBYEN    0x40U   // STANDBYEN to enable peripheral clock gating based on
                                           // CPUx
#define SYSCTL_PMBUSA_DBGHALTEN    0x80U   // DBGHALTEN to enable peripheral clock gating based on
                                           // CPUx

//*************************************************************************************************
//
// The following are defines for the bit fields in the LINA register
//
//*************************************************************************************************
#define SYSCTL_LINA_FRAMESEL_S   0U
#define SYSCTL_LINA_FRAMESEL_M   0x7U    // FRAMESEL Selection for Peripheral Instance
#define SYSCTL_LINA_CPUSEL_S     3U
#define SYSCTL_LINA_CPUSEL_M     0x38U   // CPUSEL Selection for Peripheral Instance
#define SYSCTL_LINA_STANDBYEN    0x40U   // STANDBYEN to enable peripheral clock gating based on
                                         // CPUx
#define SYSCTL_LINA_DBGHALTEN    0x80U   // DBGHALTEN to enable peripheral clock gating based on
                                         // CPUx

//*************************************************************************************************
//
// The following are defines for the bit fields in the LINB register
//
//*************************************************************************************************
#define SYSCTL_LINB_FRAMESEL_S   0U
#define SYSCTL_LINB_FRAMESEL_M   0x7U    // FRAMESEL Selection for Peripheral Instance
#define SYSCTL_LINB_CPUSEL_S     3U
#define SYSCTL_LINB_CPUSEL_M     0x38U   // CPUSEL Selection for Peripheral Instance
#define SYSCTL_LINB_STANDBYEN    0x40U   // STANDBYEN to enable peripheral clock gating based on
                                         // CPUx
#define SYSCTL_LINB_DBGHALTEN    0x80U   // DBGHALTEN to enable peripheral clock gating based on
                                         // CPUx

//*************************************************************************************************
//
// The following are defines for the bit fields in the MCANA register
//
//*************************************************************************************************
#define SYSCTL_MCANA_FRAMESEL_S   0U
#define SYSCTL_MCANA_FRAMESEL_M   0x7U    // FRAMESEL Selection for Peripheral Instance
#define SYSCTL_MCANA_CPUSEL_S     3U
#define SYSCTL_MCANA_CPUSEL_M     0x38U   // CPUSEL Selection for Peripheral Instance
#define SYSCTL_MCANA_STANDBYEN    0x40U   // STANDBYEN to enable peripheral clock gating based on
                                          // CPUx
#define SYSCTL_MCANA_DBGHALTEN    0x80U   // DBGHALTEN to enable peripheral clock gating based on
                                          // CPUx

//*************************************************************************************************
//
// The following are defines for the bit fields in the MCANB register
//
//*************************************************************************************************
#define SYSCTL_MCANB_FRAMESEL_S   0U
#define SYSCTL_MCANB_FRAMESEL_M   0x7U    // FRAMESEL Selection for Peripheral Instance
#define SYSCTL_MCANB_CPUSEL_S     3U
#define SYSCTL_MCANB_CPUSEL_M     0x38U   // CPUSEL Selection for Peripheral Instance
#define SYSCTL_MCANB_STANDBYEN    0x40U   // STANDBYEN to enable peripheral clock gating based on
                                          // CPUx
#define SYSCTL_MCANB_DBGHALTEN    0x80U   // DBGHALTEN to enable peripheral clock gating based on
                                          // CPUx

//*************************************************************************************************
//
// The following are defines for the bit fields in the MCANC register
//
//*************************************************************************************************
#define SYSCTL_MCANC_FRAMESEL_S   0U
#define SYSCTL_MCANC_FRAMESEL_M   0x7U    // FRAMESEL Selection for Peripheral Instance
#define SYSCTL_MCANC_CPUSEL_S     3U
#define SYSCTL_MCANC_CPUSEL_M     0x38U   // CPUSEL Selection for Peripheral Instance
#define SYSCTL_MCANC_STANDBYEN    0x40U   // STANDBYEN to enable peripheral clock gating based on
                                          // CPUx
#define SYSCTL_MCANC_DBGHALTEN    0x80U   // DBGHALTEN to enable peripheral clock gating based on
                                          // CPUx

//*************************************************************************************************
//
// The following are defines for the bit fields in the MCAND register
//
//*************************************************************************************************
#define SYSCTL_MCAND_FRAMESEL_S   0U
#define SYSCTL_MCAND_FRAMESEL_M   0x7U    // FRAMESEL Selection for Peripheral Instance
#define SYSCTL_MCAND_CPUSEL_S     3U
#define SYSCTL_MCAND_CPUSEL_M     0x38U   // CPUSEL Selection for Peripheral Instance
#define SYSCTL_MCAND_STANDBYEN    0x40U   // STANDBYEN to enable peripheral clock gating based on
                                          // CPUx
#define SYSCTL_MCAND_DBGHALTEN    0x80U   // DBGHALTEN to enable peripheral clock gating based on
                                          // CPUx

//*************************************************************************************************
//
// The following are defines for the bit fields in the MCANE register
//
//*************************************************************************************************
#define SYSCTL_MCANE_FRAMESEL_S   0U
#define SYSCTL_MCANE_FRAMESEL_M   0x7U    // FRAMESEL Selection for Peripheral Instance
#define SYSCTL_MCANE_CPUSEL_S     3U
#define SYSCTL_MCANE_CPUSEL_M     0x38U   // CPUSEL Selection for Peripheral Instance
#define SYSCTL_MCANE_STANDBYEN    0x40U   // STANDBYEN to enable peripheral clock gating based on
                                          // CPUx
#define SYSCTL_MCANE_DBGHALTEN    0x80U   // DBGHALTEN to enable peripheral clock gating based on
                                          // CPUx

//*************************************************************************************************
//
// The following are defines for the bit fields in the MCANF register
//
//*************************************************************************************************
#define SYSCTL_MCANF_FRAMESEL_S   0U
#define SYSCTL_MCANF_FRAMESEL_M   0x7U    // FRAMESEL Selection for Peripheral Instance
#define SYSCTL_MCANF_CPUSEL_S     3U
#define SYSCTL_MCANF_CPUSEL_M     0x38U   // CPUSEL Selection for Peripheral Instance
#define SYSCTL_MCANF_STANDBYEN    0x40U   // STANDBYEN to enable peripheral clock gating based on
                                          // CPUx
#define SYSCTL_MCANF_DBGHALTEN    0x80U   // DBGHALTEN to enable peripheral clock gating based on
                                          // CPUx

//*************************************************************************************************
//
// The following are defines for the bit fields in the ADCA register
//
//*************************************************************************************************
#define SYSCTL_ADCA_FRAMESEL_S   0U
#define SYSCTL_ADCA_FRAMESEL_M   0x7U    // FRAMESEL Selection for Peripheral Instance
#define SYSCTL_ADCA_CPUSEL_S     3U
#define SYSCTL_ADCA_CPUSEL_M     0x38U   // CPUSEL Selection for Peripheral Instance
#define SYSCTL_ADCA_STANDBYEN    0x40U   // STANDBYEN to enable peripheral clock gating based on
                                         // CPUx
#define SYSCTL_ADCA_DBGHALTEN    0x80U   // DBGHALTEN to enable peripheral clock gating based on
                                         // CPUx

//*************************************************************************************************
//
// The following are defines for the bit fields in the ADCB register
//
//*************************************************************************************************
#define SYSCTL_ADCB_FRAMESEL_S   0U
#define SYSCTL_ADCB_FRAMESEL_M   0x7U    // FRAMESEL Selection for Peripheral Instance
#define SYSCTL_ADCB_CPUSEL_S     3U
#define SYSCTL_ADCB_CPUSEL_M     0x38U   // CPUSEL Selection for Peripheral Instance
#define SYSCTL_ADCB_STANDBYEN    0x40U   // STANDBYEN to enable peripheral clock gating based on
                                         // CPUx
#define SYSCTL_ADCB_DBGHALTEN    0x80U   // DBGHALTEN to enable peripheral clock gating based on
                                         // CPUx

//*************************************************************************************************
//
// The following are defines for the bit fields in the ADCC register
//
//*************************************************************************************************
#define SYSCTL_ADCC_FRAMESEL_S   0U
#define SYSCTL_ADCC_FRAMESEL_M   0x7U    // FRAMESEL Selection for Peripheral Instance
#define SYSCTL_ADCC_CPUSEL_S     3U
#define SYSCTL_ADCC_CPUSEL_M     0x38U   // CPUSEL Selection for Peripheral Instance
#define SYSCTL_ADCC_STANDBYEN    0x40U   // STANDBYEN to enable peripheral clock gating based on
                                         // CPUx
#define SYSCTL_ADCC_DBGHALTEN    0x80U   // DBGHALTEN to enable peripheral clock gating based on
                                         // CPUx

//*************************************************************************************************
//
// The following are defines for the bit fields in the ADCD register
//
//*************************************************************************************************
#define SYSCTL_ADCD_FRAMESEL_S   0U
#define SYSCTL_ADCD_FRAMESEL_M   0x7U    // FRAMESEL Selection for Peripheral Instance
#define SYSCTL_ADCD_CPUSEL_S     3U
#define SYSCTL_ADCD_CPUSEL_M     0x38U   // CPUSEL Selection for Peripheral Instance
#define SYSCTL_ADCD_STANDBYEN    0x40U   // STANDBYEN to enable peripheral clock gating based on
                                         // CPUx
#define SYSCTL_ADCD_DBGHALTEN    0x80U   // DBGHALTEN to enable peripheral clock gating based on
                                         // CPUx

//*************************************************************************************************
//
// The following are defines for the bit fields in the ADCE register
//
//*************************************************************************************************
#define SYSCTL_ADCE_FRAMESEL_S   0U
#define SYSCTL_ADCE_FRAMESEL_M   0x7U    // FRAMESEL Selection for Peripheral Instance
#define SYSCTL_ADCE_CPUSEL_S     3U
#define SYSCTL_ADCE_CPUSEL_M     0x38U   // CPUSEL Selection for Peripheral Instance
#define SYSCTL_ADCE_STANDBYEN    0x40U   // STANDBYEN to enable peripheral clock gating based on
                                         // CPUx
#define SYSCTL_ADCE_DBGHALTEN    0x80U   // DBGHALTEN to enable peripheral clock gating based on
                                         // CPUx

//*************************************************************************************************
//
// The following are defines for the bit fields in the CMPSS1 register
//
//*************************************************************************************************
#define SYSCTL_CMPSS1_FRAMESEL_S   0U
#define SYSCTL_CMPSS1_FRAMESEL_M   0x7U    // FRAMESEL Selection for Peripheral Instance
#define SYSCTL_CMPSS1_CPUSEL_S     3U
#define SYSCTL_CMPSS1_CPUSEL_M     0x38U   // CPUSEL Selection for Peripheral Instance
#define SYSCTL_CMPSS1_STANDBYEN    0x40U   // STANDBYEN to enable peripheral clock gating based on
                                           // CPUx
#define SYSCTL_CMPSS1_DBGHALTEN    0x80U   // DBGHALTEN to enable peripheral clock gating based on
                                           // CPUx

//*************************************************************************************************
//
// The following are defines for the bit fields in the CMPSS2 register
//
//*************************************************************************************************
#define SYSCTL_CMPSS2_FRAMESEL_S   0U
#define SYSCTL_CMPSS2_FRAMESEL_M   0x7U    // FRAMESEL Selection for Peripheral Instance
#define SYSCTL_CMPSS2_CPUSEL_S     3U
#define SYSCTL_CMPSS2_CPUSEL_M     0x38U   // CPUSEL Selection for Peripheral Instance
#define SYSCTL_CMPSS2_STANDBYEN    0x40U   // STANDBYEN to enable peripheral clock gating based on
                                           // CPUx
#define SYSCTL_CMPSS2_DBGHALTEN    0x80U   // DBGHALTEN to enable peripheral clock gating based on
                                           // CPUx

