TexasInstruments/f29h85x-sdk/source/driverlib/inc/hw_sysctl.h
//*************************************************************************************************
//
// The following are defines for the bit fields in the CMPSS3 register
//
//*************************************************************************************************
#define SYSCTL_CMPSS3_FRAMESEL_S   0U
#define SYSCTL_CMPSS3_FRAMESEL_M   0x7U    // FRAMESEL Selection for Peripheral Instance
#define SYSCTL_CMPSS3_CPUSEL_S     3U
#define SYSCTL_CMPSS3_CPUSEL_M     0x38U   // CPUSEL Selection for Peripheral Instance
#define SYSCTL_CMPSS3_STANDBYEN    0x40U   // STANDBYEN to enable peripheral clock gating based on
                                           // CPUx
#define SYSCTL_CMPSS3_DBGHALTEN    0x80U   // DBGHALTEN to enable peripheral clock gating based on
                                           // CPUx

//*************************************************************************************************
//
// The following are defines for the bit fields in the CMPSS4 register
//
//*************************************************************************************************
#define SYSCTL_CMPSS4_FRAMESEL_S   0U
#define SYSCTL_CMPSS4_FRAMESEL_M   0x7U    // FRAMESEL Selection for Peripheral Instance
#define SYSCTL_CMPSS4_CPUSEL_S     3U
#define SYSCTL_CMPSS4_CPUSEL_M     0x38U   // CPUSEL Selection for Peripheral Instance
#define SYSCTL_CMPSS4_STANDBYEN    0x40U   // STANDBYEN to enable peripheral clock gating based on
                                           // CPUx
#define SYSCTL_CMPSS4_DBGHALTEN    0x80U   // DBGHALTEN to enable peripheral clock gating based on
                                           // CPUx

//*************************************************************************************************
//
// The following are defines for the bit fields in the CMPSS5 register
//
//*************************************************************************************************
#define SYSCTL_CMPSS5_FRAMESEL_S   0U
#define SYSCTL_CMPSS5_FRAMESEL_M   0x7U    // FRAMESEL Selection for Peripheral Instance
#define SYSCTL_CMPSS5_CPUSEL_S     3U
#define SYSCTL_CMPSS5_CPUSEL_M     0x38U   // CPUSEL Selection for Peripheral Instance
#define SYSCTL_CMPSS5_STANDBYEN    0x40U   // STANDBYEN to enable peripheral clock gating based on
                                           // CPUx
#define SYSCTL_CMPSS5_DBGHALTEN    0x80U   // DBGHALTEN to enable peripheral clock gating based on
                                           // CPUx

//*************************************************************************************************
//
// The following are defines for the bit fields in the CMPSS6 register
//
//*************************************************************************************************
#define SYSCTL_CMPSS6_FRAMESEL_S   0U
#define SYSCTL_CMPSS6_FRAMESEL_M   0x7U    // FRAMESEL Selection for Peripheral Instance
#define SYSCTL_CMPSS6_CPUSEL_S     3U
#define SYSCTL_CMPSS6_CPUSEL_M     0x38U   // CPUSEL Selection for Peripheral Instance
#define SYSCTL_CMPSS6_STANDBYEN    0x40U   // STANDBYEN to enable peripheral clock gating based on
                                           // CPUx
#define SYSCTL_CMPSS6_DBGHALTEN    0x80U   // DBGHALTEN to enable peripheral clock gating based on
                                           // CPUx

//*************************************************************************************************
//
// The following are defines for the bit fields in the CMPSS7 register
//
//*************************************************************************************************
#define SYSCTL_CMPSS7_FRAMESEL_S   0U
#define SYSCTL_CMPSS7_FRAMESEL_M   0x7U    // FRAMESEL Selection for Peripheral Instance
#define SYSCTL_CMPSS7_CPUSEL_S     3U
#define SYSCTL_CMPSS7_CPUSEL_M     0x38U   // CPUSEL Selection for Peripheral Instance
#define SYSCTL_CMPSS7_STANDBYEN    0x40U   // STANDBYEN to enable peripheral clock gating based on
                                           // CPUx
#define SYSCTL_CMPSS7_DBGHALTEN    0x80U   // DBGHALTEN to enable peripheral clock gating based on
                                           // CPUx

//*************************************************************************************************
//
// The following are defines for the bit fields in the CMPSS8 register
//
//*************************************************************************************************
#define SYSCTL_CMPSS8_FRAMESEL_S   0U
#define SYSCTL_CMPSS8_FRAMESEL_M   0x7U    // FRAMESEL Selection for Peripheral Instance
#define SYSCTL_CMPSS8_CPUSEL_S     3U
#define SYSCTL_CMPSS8_CPUSEL_M     0x38U   // CPUSEL Selection for Peripheral Instance
#define SYSCTL_CMPSS8_STANDBYEN    0x40U   // STANDBYEN to enable peripheral clock gating based on
                                           // CPUx
#define SYSCTL_CMPSS8_DBGHALTEN    0x80U   // DBGHALTEN to enable peripheral clock gating based on
                                           // CPUx

//*************************************************************************************************
//
// The following are defines for the bit fields in the CMPSS9 register
//
//*************************************************************************************************
#define SYSCTL_CMPSS9_FRAMESEL_S   0U
#define SYSCTL_CMPSS9_FRAMESEL_M   0x7U    // FRAMESEL Selection for Peripheral Instance
#define SYSCTL_CMPSS9_CPUSEL_S     3U
#define SYSCTL_CMPSS9_CPUSEL_M     0x38U   // CPUSEL Selection for Peripheral Instance
#define SYSCTL_CMPSS9_STANDBYEN    0x40U   // STANDBYEN to enable peripheral clock gating based on
                                           // CPUx
#define SYSCTL_CMPSS9_DBGHALTEN    0x80U   // DBGHALTEN to enable peripheral clock gating based on
                                           // CPUx

//*************************************************************************************************
//
// The following are defines for the bit fields in the CMPSS10 register
//
//*************************************************************************************************
#define SYSCTL_CMPSS10_FRAMESEL_S   0U
#define SYSCTL_CMPSS10_FRAMESEL_M   0x7U    // FRAMESEL Selection for Peripheral Instance
#define SYSCTL_CMPSS10_CPUSEL_S     3U
#define SYSCTL_CMPSS10_CPUSEL_M     0x38U   // CPUSEL Selection for Peripheral Instance
#define SYSCTL_CMPSS10_STANDBYEN    0x40U   // STANDBYEN to enable peripheral clock gating based on
                                            // CPUx
#define SYSCTL_CMPSS10_DBGHALTEN    0x80U   // DBGHALTEN to enable peripheral clock gating based on
                                            // CPUx

//*************************************************************************************************
//
// The following are defines for the bit fields in the CMPSS11 register
//
//*************************************************************************************************
#define SYSCTL_CMPSS11_FRAMESEL_S   0U
#define SYSCTL_CMPSS11_FRAMESEL_M   0x7U    // FRAMESEL Selection for Peripheral Instance
#define SYSCTL_CMPSS11_CPUSEL_S     3U
#define SYSCTL_CMPSS11_CPUSEL_M     0x38U   // CPUSEL Selection for Peripheral Instance
#define SYSCTL_CMPSS11_STANDBYEN    0x40U   // STANDBYEN to enable peripheral clock gating based on
                                            // CPUx
#define SYSCTL_CMPSS11_DBGHALTEN    0x80U   // DBGHALTEN to enable peripheral clock gating based on
                                            // CPUx

//*************************************************************************************************
//
// The following are defines for the bit fields in the CMPSS12 register
//
//*************************************************************************************************
#define SYSCTL_CMPSS12_FRAMESEL_S   0U
#define SYSCTL_CMPSS12_FRAMESEL_M   0x7U    // FRAMESEL Selection for Peripheral Instance
#define SYSCTL_CMPSS12_CPUSEL_S     3U
#define SYSCTL_CMPSS12_CPUSEL_M     0x38U   // CPUSEL Selection for Peripheral Instance
#define SYSCTL_CMPSS12_STANDBYEN    0x40U   // STANDBYEN to enable peripheral clock gating based on
                                            // CPUx
#define SYSCTL_CMPSS12_DBGHALTEN    0x80U   // DBGHALTEN to enable peripheral clock gating based on
                                            // CPUx

//*************************************************************************************************
//
// The following are defines for the bit fields in the DACA register
//
//*************************************************************************************************
#define SYSCTL_DACA_FRAMESEL_S   0U
#define SYSCTL_DACA_FRAMESEL_M   0x7U    // FRAMESEL Selection for Peripheral Instance
#define SYSCTL_DACA_CPUSEL_S     3U
#define SYSCTL_DACA_CPUSEL_M     0x38U   // CPUSEL Selection for Peripheral Instance
#define SYSCTL_DACA_STANDBYEN    0x40U   // STANDBYEN to enable peripheral clock gating based on
                                         // CPUx
#define SYSCTL_DACA_DBGHALTEN    0x80U   // DBGHALTEN to enable peripheral clock gating based on
                                         // CPUx

//*************************************************************************************************
//
// The following are defines for the bit fields in the DACB register
//
//*************************************************************************************************
#define SYSCTL_DACB_FRAMESEL_S   0U
#define SYSCTL_DACB_FRAMESEL_M   0x7U    // FRAMESEL Selection for Peripheral Instance
#define SYSCTL_DACB_CPUSEL_S     3U
#define SYSCTL_DACB_CPUSEL_M     0x38U   // CPUSEL Selection for Peripheral Instance
#define SYSCTL_DACB_STANDBYEN    0x40U   // STANDBYEN to enable peripheral clock gating based on
                                         // CPUx
#define SYSCTL_DACB_DBGHALTEN    0x80U   // DBGHALTEN to enable peripheral clock gating based on
                                         // CPUx

//*************************************************************************************************
//
// The following are defines for the bit fields in the CLB1 register
//
//*************************************************************************************************
#define SYSCTL_CLB1_FRAMESEL_S   0U
#define SYSCTL_CLB1_FRAMESEL_M   0x7U    // FRAMESEL Selection for Peripheral Instance
#define SYSCTL_CLB1_CPUSEL_S     3U
#define SYSCTL_CLB1_CPUSEL_M     0x38U   // CPUSEL Selection for Peripheral Instance
#define SYSCTL_CLB1_STANDBYEN    0x40U   // STANDBYEN to enable peripheral clock gating based on
                                         // CPUx
#define SYSCTL_CLB1_DBGHALTEN    0x80U   // DBGHALTEN to enable peripheral clock gating based on
                                         // CPUx

//*************************************************************************************************
//
// The following are defines for the bit fields in the CLB2 register
//
//*************************************************************************************************
#define SYSCTL_CLB2_FRAMESEL_S   0U
#define SYSCTL_CLB2_FRAMESEL_M   0x7U    // FRAMESEL Selection for Peripheral Instance
#define SYSCTL_CLB2_CPUSEL_S     3U
#define SYSCTL_CLB2_CPUSEL_M     0x38U   // CPUSEL Selection for Peripheral Instance
#define SYSCTL_CLB2_STANDBYEN    0x40U   // STANDBYEN to enable peripheral clock gating based on
                                         // CPUx
#define SYSCTL_CLB2_DBGHALTEN    0x80U   // DBGHALTEN to enable peripheral clock gating based on
                                         // CPUx

//*************************************************************************************************
//
// The following are defines for the bit fields in the CLB3 register
//
//*************************************************************************************************
#define SYSCTL_CLB3_FRAMESEL_S   0U
#define SYSCTL_CLB3_FRAMESEL_M   0x7U    // FRAMESEL Selection for Peripheral Instance
#define SYSCTL_CLB3_CPUSEL_S     3U
#define SYSCTL_CLB3_CPUSEL_M     0x38U   // CPUSEL Selection for Peripheral Instance
#define SYSCTL_CLB3_STANDBYEN    0x40U   // STANDBYEN to enable peripheral clock gating based on
                                         // CPUx
#define SYSCTL_CLB3_DBGHALTEN    0x80U   // DBGHALTEN to enable peripheral clock gating based on
                                         // CPUx

//*************************************************************************************************
//
// The following are defines for the bit fields in the CLB4 register
//
//*************************************************************************************************
#define SYSCTL_CLB4_FRAMESEL_S   0U
#define SYSCTL_CLB4_FRAMESEL_M   0x7U    // FRAMESEL Selection for Peripheral Instance
#define SYSCTL_CLB4_CPUSEL_S     3U
#define SYSCTL_CLB4_CPUSEL_M     0x38U   // CPUSEL Selection for Peripheral Instance
#define SYSCTL_CLB4_STANDBYEN    0x40U   // STANDBYEN to enable peripheral clock gating based on
                                         // CPUx
#define SYSCTL_CLB4_DBGHALTEN    0x80U   // DBGHALTEN to enable peripheral clock gating based on
                                         // CPUx

//*************************************************************************************************
//
// The following are defines for the bit fields in the CLB5 register
//
//*************************************************************************************************
#define SYSCTL_CLB5_FRAMESEL_S   0U
#define SYSCTL_CLB5_FRAMESEL_M   0x7U    // FRAMESEL Selection for Peripheral Instance
#define SYSCTL_CLB5_CPUSEL_S     3U
#define SYSCTL_CLB5_CPUSEL_M     0x38U   // CPUSEL Selection for Peripheral Instance
#define SYSCTL_CLB5_STANDBYEN    0x40U   // STANDBYEN to enable peripheral clock gating based on
                                         // CPUx
#define SYSCTL_CLB5_DBGHALTEN    0x80U   // DBGHALTEN to enable peripheral clock gating based on
                                         // CPUx

//*************************************************************************************************
//
// The following are defines for the bit fields in the CLB6 register
//
//*************************************************************************************************
#define SYSCTL_CLB6_FRAMESEL_S   0U
#define SYSCTL_CLB6_FRAMESEL_M   0x7U    // FRAMESEL Selection for Peripheral Instance
#define SYSCTL_CLB6_CPUSEL_S     3U
#define SYSCTL_CLB6_CPUSEL_M     0x38U   // CPUSEL Selection for Peripheral Instance
#define SYSCTL_CLB6_STANDBYEN    0x40U   // STANDBYEN to enable peripheral clock gating based on
                                         // CPUx
#define SYSCTL_CLB6_DBGHALTEN    0x80U   // DBGHALTEN to enable peripheral clock gating based on
                                         // CPUx

//*************************************************************************************************
//
// The following are defines for the bit fields in the FSITXA register
//
//*************************************************************************************************
#define SYSCTL_FSITXA_FRAMESEL_S   0U
#define SYSCTL_FSITXA_FRAMESEL_M   0x7U    // FRAMESEL Selection for Peripheral Instance
#define SYSCTL_FSITXA_CPUSEL_S     3U
#define SYSCTL_FSITXA_CPUSEL_M     0x38U   // CPUSEL Selection for Peripheral Instance
#define SYSCTL_FSITXA_STANDBYEN    0x40U   // STANDBYEN to enable peripheral clock gating based on
                                           // CPUx
#define SYSCTL_FSITXA_DBGHALTEN    0x80U   // DBGHALTEN to enable peripheral clock gating based on
                                           // CPUx

//*************************************************************************************************
//
// The following are defines for the bit fields in the FSITXB register
//
//*************************************************************************************************
#define SYSCTL_FSITXB_FRAMESEL_S   0U
#define SYSCTL_FSITXB_FRAMESEL_M   0x7U    // FRAMESEL Selection for Peripheral Instance
#define SYSCTL_FSITXB_CPUSEL_S     3U
#define SYSCTL_FSITXB_CPUSEL_M     0x38U   // CPUSEL Selection for Peripheral Instance
#define SYSCTL_FSITXB_STANDBYEN    0x40U   // STANDBYEN to enable peripheral clock gating based on
                                           // CPUx
#define SYSCTL_FSITXB_DBGHALTEN    0x80U   // DBGHALTEN to enable peripheral clock gating based on
                                           // CPUx

//*************************************************************************************************
//
// The following are defines for the bit fields in the FSITXC register
//
//*************************************************************************************************
#define SYSCTL_FSITXC_FRAMESEL_S   0U
#define SYSCTL_FSITXC_FRAMESEL_M   0x7U    // FRAMESEL Selection for Peripheral Instance
#define SYSCTL_FSITXC_CPUSEL_S     3U
#define SYSCTL_FSITXC_CPUSEL_M     0x38U   // CPUSEL Selection for Peripheral Instance
#define SYSCTL_FSITXC_STANDBYEN    0x40U   // STANDBYEN to enable peripheral clock gating based on
                                           // CPUx
#define SYSCTL_FSITXC_DBGHALTEN    0x80U   // DBGHALTEN to enable peripheral clock gating based on
                                           // CPUx

//*************************************************************************************************
//
// The following are defines for the bit fields in the FSITXD register
//
//*************************************************************************************************
#define SYSCTL_FSITXD_FRAMESEL_S   0U
#define SYSCTL_FSITXD_FRAMESEL_M   0x7U    // FRAMESEL Selection for Peripheral Instance
#define SYSCTL_FSITXD_CPUSEL_S     3U
#define SYSCTL_FSITXD_CPUSEL_M     0x38U   // CPUSEL Selection for Peripheral Instance
#define SYSCTL_FSITXD_STANDBYEN    0x40U   // STANDBYEN to enable peripheral clock gating based on
                                           // CPUx
#define SYSCTL_FSITXD_DBGHALTEN    0x80U   // DBGHALTEN to enable peripheral clock gating based on
                                           // CPUx

//*************************************************************************************************
//
// The following are defines for the bit fields in the FSIRXA register
//
//*************************************************************************************************
#define SYSCTL_FSIRXA_FRAMESEL_S   0U
#define SYSCTL_FSIRXA_FRAMESEL_M   0x7U    // FRAMESEL Selection for Peripheral Instance
#define SYSCTL_FSIRXA_CPUSEL_S     3U
#define SYSCTL_FSIRXA_CPUSEL_M     0x38U   // CPUSEL Selection for Peripheral Instance
#define SYSCTL_FSIRXA_STANDBYEN    0x40U   // STANDBYEN to enable peripheral clock gating based on
                                           // CPUx
#define SYSCTL_FSIRXA_DBGHALTEN    0x80U   // DBGHALTEN to enable peripheral clock gating based on
                                           // CPUx

//*************************************************************************************************
//
// The following are defines for the bit fields in the FSIRXB register
//
//*************************************************************************************************
#define SYSCTL_FSIRXB_FRAMESEL_S   0U
#define SYSCTL_FSIRXB_FRAMESEL_M   0x7U    // FRAMESEL Selection for Peripheral Instance
#define SYSCTL_FSIRXB_CPUSEL_S     3U
#define SYSCTL_FSIRXB_CPUSEL_M     0x38U   // CPUSEL Selection for Peripheral Instance
#define SYSCTL_FSIRXB_STANDBYEN    0x40U   // STANDBYEN to enable peripheral clock gating based on
                                           // CPUx
#define SYSCTL_FSIRXB_DBGHALTEN    0x80U   // DBGHALTEN to enable peripheral clock gating based on
                                           // CPUx

//*************************************************************************************************
//
// The following are defines for the bit fields in the FSIRXC register
//
//*************************************************************************************************
#define SYSCTL_FSIRXC_FRAMESEL_S   0U
#define SYSCTL_FSIRXC_FRAMESEL_M   0x7U    // FRAMESEL Selection for Peripheral Instance
#define SYSCTL_FSIRXC_CPUSEL_S     3U
#define SYSCTL_FSIRXC_CPUSEL_M     0x38U   // CPUSEL Selection for Peripheral Instance
#define SYSCTL_FSIRXC_STANDBYEN    0x40U   // STANDBYEN to enable peripheral clock gating based on
                                           // CPUx
#define SYSCTL_FSIRXC_DBGHALTEN    0x80U   // DBGHALTEN to enable peripheral clock gating based on
                                           // CPUx

//*************************************************************************************************
//
// The following are defines for the bit fields in the FSIRXD register
//
//*************************************************************************************************
#define SYSCTL_FSIRXD_FRAMESEL_S   0U
#define SYSCTL_FSIRXD_FRAMESEL_M   0x7U    // FRAMESEL Selection for Peripheral Instance
#define SYSCTL_FSIRXD_CPUSEL_S     3U
#define SYSCTL_FSIRXD_CPUSEL_M     0x38U   // CPUSEL Selection for Peripheral Instance
#define SYSCTL_FSIRXD_STANDBYEN    0x40U   // STANDBYEN to enable peripheral clock gating based on
                                           // CPUx
#define SYSCTL_FSIRXD_DBGHALTEN    0x80U   // DBGHALTEN to enable peripheral clock gating based on
                                           // CPUx

//*************************************************************************************************
//
// The following are defines for the bit fields in the DCC1 register
//
//*************************************************************************************************
#define SYSCTL_DCC1_FRAMESEL_S   0U
#define SYSCTL_DCC1_FRAMESEL_M   0x7U    // FRAMESEL Selection for Peripheral Instance
#define SYSCTL_DCC1_CPUSEL_S     3U
#define SYSCTL_DCC1_CPUSEL_M     0x38U   // CPUSEL Selection for Peripheral Instance
#define SYSCTL_DCC1_STANDBYEN    0x40U   // STANDBYEN to enable peripheral clock gating based on
                                         // CPUx
#define SYSCTL_DCC1_DBGHALTEN    0x80U   // DBGHALTEN to enable peripheral clock gating based on
                                         // CPUx

//*************************************************************************************************
//
// The following are defines for the bit fields in the DCC2 register
//
//*************************************************************************************************
#define SYSCTL_DCC2_FRAMESEL_S   0U
#define SYSCTL_DCC2_FRAMESEL_M   0x7U    // FRAMESEL Selection for Peripheral Instance
#define SYSCTL_DCC2_CPUSEL_S     3U
#define SYSCTL_DCC2_CPUSEL_M     0x38U   // CPUSEL Selection for Peripheral Instance
#define SYSCTL_DCC2_STANDBYEN    0x40U   // STANDBYEN to enable peripheral clock gating based on
                                         // CPUx
#define SYSCTL_DCC2_DBGHALTEN    0x80U   // DBGHALTEN to enable peripheral clock gating based on
                                         // CPUx

//*************************************************************************************************
//
// The following are defines for the bit fields in the DCC3 register
//
//*************************************************************************************************
#define SYSCTL_DCC3_FRAMESEL_S   0U
#define SYSCTL_DCC3_FRAMESEL_M   0x7U    // FRAMESEL Selection for Peripheral Instance
#define SYSCTL_DCC3_CPUSEL_S     3U
#define SYSCTL_DCC3_CPUSEL_M     0x38U   // CPUSEL Selection for Peripheral Instance
#define SYSCTL_DCC3_STANDBYEN    0x40U   // STANDBYEN to enable peripheral clock gating based on
                                         // CPUx
#define SYSCTL_DCC3_DBGHALTEN    0x80U   // DBGHALTEN to enable peripheral clock gating based on
                                         // CPUx

