TexasInstruments/f29h85x-sdk/source/driverlib/inc/hw_sysctl.h
//*************************************************************************************************
//
// The following are defines for the bit fields in the ETHERCATA register
//
//*************************************************************************************************
#define SYSCTL_ETHERCATA_FRAMESEL_S   0U
#define SYSCTL_ETHERCATA_FRAMESEL_M   0x7U    // FRAMESEL Selection for Peripheral Instance
#define SYSCTL_ETHERCATA_CPUSEL_S     3U
#define SYSCTL_ETHERCATA_CPUSEL_M     0x38U   // CPUSEL Selection for Peripheral Instance
#define SYSCTL_ETHERCATA_STANDBYEN    0x40U   // STANDBYEN to enable peripheral clock gating based
                                              // on CPUx
#define SYSCTL_ETHERCATA_DBGHALTEN    0x80U   // DBGHALTEN to enable peripheral clock gating based
                                              // on CPUx

//*************************************************************************************************
//
// The following are defines for the bit fields in the EPG1 register
//
//*************************************************************************************************
#define SYSCTL_EPG1_FRAMESEL_S   0U
#define SYSCTL_EPG1_FRAMESEL_M   0x7U    // FRAMESEL Selection for Peripheral Instance
#define SYSCTL_EPG1_CPUSEL_S     3U
#define SYSCTL_EPG1_CPUSEL_M     0x38U   // CPUSEL Selection for Peripheral Instance
#define SYSCTL_EPG1_STANDBYEN    0x40U   // STANDBYEN to enable peripheral clock gating based on
                                         // CPUx
#define SYSCTL_EPG1_DBGHALTEN    0x80U   // DBGHALTEN to enable peripheral clock gating based on
                                         // CPUx

//*************************************************************************************************
//
// The following are defines for the bit fields in the SENT1 register
//
//*************************************************************************************************
#define SYSCTL_SENT1_FRAMESEL_S   0U
#define SYSCTL_SENT1_FRAMESEL_M   0x7U    // FRAMESEL Selection for Peripheral Instance
#define SYSCTL_SENT1_CPUSEL_S     3U
#define SYSCTL_SENT1_CPUSEL_M     0x38U   // CPUSEL Selection for Peripheral Instance
#define SYSCTL_SENT1_STANDBYEN    0x40U   // STANDBYEN to enable peripheral clock gating based on
                                          // CPUx
#define SYSCTL_SENT1_DBGHALTEN    0x80U   // DBGHALTEN to enable peripheral clock gating based on
                                          // CPUx

//*************************************************************************************************
//
// The following are defines for the bit fields in the SENT2 register
//
//*************************************************************************************************
#define SYSCTL_SENT2_FRAMESEL_S   0U
#define SYSCTL_SENT2_FRAMESEL_M   0x7U    // FRAMESEL Selection for Peripheral Instance
#define SYSCTL_SENT2_CPUSEL_S     3U
#define SYSCTL_SENT2_CPUSEL_M     0x38U   // CPUSEL Selection for Peripheral Instance
#define SYSCTL_SENT2_STANDBYEN    0x40U   // STANDBYEN to enable peripheral clock gating based on
                                          // CPUx
#define SYSCTL_SENT2_DBGHALTEN    0x80U   // DBGHALTEN to enable peripheral clock gating based on
                                          // CPUx

//*************************************************************************************************
//
// The following are defines for the bit fields in the SENT3 register
//
//*************************************************************************************************
#define SYSCTL_SENT3_FRAMESEL_S   0U
#define SYSCTL_SENT3_FRAMESEL_M   0x7U    // FRAMESEL Selection for Peripheral Instance
#define SYSCTL_SENT3_CPUSEL_S     3U
#define SYSCTL_SENT3_CPUSEL_M     0x38U   // CPUSEL Selection for Peripheral Instance
#define SYSCTL_SENT3_STANDBYEN    0x40U   // STANDBYEN to enable peripheral clock gating based on
                                          // CPUx
#define SYSCTL_SENT3_DBGHALTEN    0x80U   // DBGHALTEN to enable peripheral clock gating based on
                                          // CPUx

//*************************************************************************************************
//
// The following are defines for the bit fields in the SENT4 register
//
//*************************************************************************************************
#define SYSCTL_SENT4_FRAMESEL_S   0U
#define SYSCTL_SENT4_FRAMESEL_M   0x7U    // FRAMESEL Selection for Peripheral Instance
#define SYSCTL_SENT4_CPUSEL_S     3U
#define SYSCTL_SENT4_CPUSEL_M     0x38U   // CPUSEL Selection for Peripheral Instance
#define SYSCTL_SENT4_STANDBYEN    0x40U   // STANDBYEN to enable peripheral clock gating based on
                                          // CPUx
#define SYSCTL_SENT4_DBGHALTEN    0x80U   // DBGHALTEN to enable peripheral clock gating based on
                                          // CPUx

//*************************************************************************************************
//
// The following are defines for the bit fields in the SENT5 register
//
//*************************************************************************************************
#define SYSCTL_SENT5_FRAMESEL_S   0U
#define SYSCTL_SENT5_FRAMESEL_M   0x7U    // FRAMESEL Selection for Peripheral Instance
#define SYSCTL_SENT5_CPUSEL_S     3U
#define SYSCTL_SENT5_CPUSEL_M     0x38U   // CPUSEL Selection for Peripheral Instance
#define SYSCTL_SENT5_STANDBYEN    0x40U   // STANDBYEN to enable peripheral clock gating based on
                                          // CPUx
#define SYSCTL_SENT5_DBGHALTEN    0x80U   // DBGHALTEN to enable peripheral clock gating based on
                                          // CPUx

//*************************************************************************************************
//
// The following are defines for the bit fields in the SENT6 register
//
//*************************************************************************************************
#define SYSCTL_SENT6_FRAMESEL_S   0U
#define SYSCTL_SENT6_FRAMESEL_M   0x7U    // FRAMESEL Selection for Peripheral Instance
#define SYSCTL_SENT6_CPUSEL_S     3U
#define SYSCTL_SENT6_CPUSEL_M     0x38U   // CPUSEL Selection for Peripheral Instance
#define SYSCTL_SENT6_STANDBYEN    0x40U   // STANDBYEN to enable peripheral clock gating based on
                                          // CPUx
#define SYSCTL_SENT6_DBGHALTEN    0x80U   // DBGHALTEN to enable peripheral clock gating based on
                                          // CPUx

//*************************************************************************************************
//
// The following are defines for the bit fields in the ADCCHECKER1 register
//
//*************************************************************************************************
#define SYSCTL_ADCCHECKER1_FRAMESEL_S   0U
#define SYSCTL_ADCCHECKER1_FRAMESEL_M   0x7U    // FRAMESEL Selection for Peripheral Instance
#define SYSCTL_ADCCHECKER1_CPUSEL_S     3U
#define SYSCTL_ADCCHECKER1_CPUSEL_M     0x38U   // CPUSEL Selection for Peripheral Instance
#define SYSCTL_ADCCHECKER1_STANDBYEN    0x40U   // STANDBYEN to enable peripheral clock gating
                                                // based on CPUx
#define SYSCTL_ADCCHECKER1_DBGHALTEN    0x80U   // DBGHALTEN to enable peripheral clock gating
                                                // based on CPUx

//*************************************************************************************************
//
// The following are defines for the bit fields in the ADCCHECKER2 register
//
//*************************************************************************************************
#define SYSCTL_ADCCHECKER2_FRAMESEL_S   0U
#define SYSCTL_ADCCHECKER2_FRAMESEL_M   0x7U    // FRAMESEL Selection for Peripheral Instance
#define SYSCTL_ADCCHECKER2_CPUSEL_S     3U
#define SYSCTL_ADCCHECKER2_CPUSEL_M     0x38U   // CPUSEL Selection for Peripheral Instance
#define SYSCTL_ADCCHECKER2_STANDBYEN    0x40U   // STANDBYEN to enable peripheral clock gating
                                                // based on CPUx
#define SYSCTL_ADCCHECKER2_DBGHALTEN    0x80U   // DBGHALTEN to enable peripheral clock gating
                                                // based on CPUx

//*************************************************************************************************
//
// The following are defines for the bit fields in the ADCCHECKER3 register
//
//*************************************************************************************************
#define SYSCTL_ADCCHECKER3_FRAMESEL_S   0U
#define SYSCTL_ADCCHECKER3_FRAMESEL_M   0x7U    // FRAMESEL Selection for Peripheral Instance
#define SYSCTL_ADCCHECKER3_CPUSEL_S     3U
#define SYSCTL_ADCCHECKER3_CPUSEL_M     0x38U   // CPUSEL Selection for Peripheral Instance
#define SYSCTL_ADCCHECKER3_STANDBYEN    0x40U   // STANDBYEN to enable peripheral clock gating
                                                // based on CPUx
#define SYSCTL_ADCCHECKER3_DBGHALTEN    0x80U   // DBGHALTEN to enable peripheral clock gating
                                                // based on CPUx

//*************************************************************************************************
//
// The following are defines for the bit fields in the ADCCHECKER4 register
//
//*************************************************************************************************
#define SYSCTL_ADCCHECKER4_FRAMESEL_S   0U
#define SYSCTL_ADCCHECKER4_FRAMESEL_M   0x7U    // FRAMESEL Selection for Peripheral Instance
#define SYSCTL_ADCCHECKER4_CPUSEL_S     3U
#define SYSCTL_ADCCHECKER4_CPUSEL_M     0x38U   // CPUSEL Selection for Peripheral Instance
#define SYSCTL_ADCCHECKER4_STANDBYEN    0x40U   // STANDBYEN to enable peripheral clock gating
                                                // based on CPUx
#define SYSCTL_ADCCHECKER4_DBGHALTEN    0x80U   // DBGHALTEN to enable peripheral clock gating
                                                // based on CPUx

//*************************************************************************************************
//
// The following are defines for the bit fields in the ADCCHECKER5 register
//
//*************************************************************************************************
#define SYSCTL_ADCCHECKER5_FRAMESEL_S   0U
#define SYSCTL_ADCCHECKER5_FRAMESEL_M   0x7U    // FRAMESEL Selection for Peripheral Instance
#define SYSCTL_ADCCHECKER5_CPUSEL_S     3U
#define SYSCTL_ADCCHECKER5_CPUSEL_M     0x38U   // CPUSEL Selection for Peripheral Instance
#define SYSCTL_ADCCHECKER5_STANDBYEN    0x40U   // STANDBYEN to enable peripheral clock gating
                                                // based on CPUx
#define SYSCTL_ADCCHECKER5_DBGHALTEN    0x80U   // DBGHALTEN to enable peripheral clock gating
                                                // based on CPUx

//*************************************************************************************************
//
// The following are defines for the bit fields in the ADCCHECKER6 register
//
//*************************************************************************************************
#define SYSCTL_ADCCHECKER6_FRAMESEL_S   0U
#define SYSCTL_ADCCHECKER6_FRAMESEL_M   0x7U    // FRAMESEL Selection for Peripheral Instance
#define SYSCTL_ADCCHECKER6_CPUSEL_S     3U
#define SYSCTL_ADCCHECKER6_CPUSEL_M     0x38U   // CPUSEL Selection for Peripheral Instance
#define SYSCTL_ADCCHECKER6_STANDBYEN    0x40U   // STANDBYEN to enable peripheral clock gating
                                                // based on CPUx
#define SYSCTL_ADCCHECKER6_DBGHALTEN    0x80U   // DBGHALTEN to enable peripheral clock gating
                                                // based on CPUx

//*************************************************************************************************
//
// The following are defines for the bit fields in the ADCCHECKER7 register
//
//*************************************************************************************************
#define SYSCTL_ADCCHECKER7_FRAMESEL_S   0U
#define SYSCTL_ADCCHECKER7_FRAMESEL_M   0x7U    // FRAMESEL Selection for Peripheral Instance
#define SYSCTL_ADCCHECKER7_CPUSEL_S     3U
#define SYSCTL_ADCCHECKER7_CPUSEL_M     0x38U   // CPUSEL Selection for Peripheral Instance
#define SYSCTL_ADCCHECKER7_STANDBYEN    0x40U   // STANDBYEN to enable peripheral clock gating
                                                // based on CPUx
#define SYSCTL_ADCCHECKER7_DBGHALTEN    0x80U   // DBGHALTEN to enable peripheral clock gating
                                                // based on CPUx

//*************************************************************************************************
//
// The following are defines for the bit fields in the ADCCHECKER8 register
//
//*************************************************************************************************
#define SYSCTL_ADCCHECKER8_FRAMESEL_S   0U
#define SYSCTL_ADCCHECKER8_FRAMESEL_M   0x7U    // FRAMESEL Selection for Peripheral Instance
#define SYSCTL_ADCCHECKER8_CPUSEL_S     3U
#define SYSCTL_ADCCHECKER8_CPUSEL_M     0x38U   // CPUSEL Selection for Peripheral Instance
#define SYSCTL_ADCCHECKER8_STANDBYEN    0x40U   // STANDBYEN to enable peripheral clock gating
                                                // based on CPUx
#define SYSCTL_ADCCHECKER8_DBGHALTEN    0x80U   // DBGHALTEN to enable peripheral clock gating
                                                // based on CPUx

//*************************************************************************************************
//
// The following are defines for the bit fields in the ADCCHECKER9 register
//
//*************************************************************************************************
#define SYSCTL_ADCCHECKER9_FRAMESEL_S   0U
#define SYSCTL_ADCCHECKER9_FRAMESEL_M   0x7U    // FRAMESEL Selection for Peripheral Instance
#define SYSCTL_ADCCHECKER9_CPUSEL_S     3U
#define SYSCTL_ADCCHECKER9_CPUSEL_M     0x38U   // CPUSEL Selection for Peripheral Instance
#define SYSCTL_ADCCHECKER9_STANDBYEN    0x40U   // STANDBYEN to enable peripheral clock gating
                                                // based on CPUx
#define SYSCTL_ADCCHECKER9_DBGHALTEN    0x80U   // DBGHALTEN to enable peripheral clock gating
                                                // based on CPUx

//*************************************************************************************************
//
// The following are defines for the bit fields in the ADCCHECKER10 register
//
//*************************************************************************************************
#define SYSCTL_ADCCHECKER10_FRAMESEL_S   0U
#define SYSCTL_ADCCHECKER10_FRAMESEL_M   0x7U    // FRAMESEL Selection for Peripheral Instance
#define SYSCTL_ADCCHECKER10_CPUSEL_S     3U
#define SYSCTL_ADCCHECKER10_CPUSEL_M     0x38U   // CPUSEL Selection for Peripheral Instance
#define SYSCTL_ADCCHECKER10_STANDBYEN    0x40U   // STANDBYEN to enable peripheral clock gating
                                                 // based on CPUx
#define SYSCTL_ADCCHECKER10_DBGHALTEN    0x80U   // DBGHALTEN to enable peripheral clock gating
                                                 // based on CPUx

//*************************************************************************************************
//
// The following are defines for the bit fields in the ADCSEAGGRCPU1 register
//
//*************************************************************************************************
#define SYSCTL_ADCSEAGGRCPU1_FRAMESEL_S   0U
#define SYSCTL_ADCSEAGGRCPU1_FRAMESEL_M   0x7U    // FRAMESEL Selection for Peripheral Instance
#define SYSCTL_ADCSEAGGRCPU1_CPUSEL_S     3U
#define SYSCTL_ADCSEAGGRCPU1_CPUSEL_M     0x38U   // CPUSEL Selection for Peripheral Instance
#define SYSCTL_ADCSEAGGRCPU1_STANDBYEN    0x40U   // STANDBYEN to enable peripheral clock gating
                                                  // based on CPUx
#define SYSCTL_ADCSEAGGRCPU1_DBGHALTEN    0x80U   // DBGHALTEN to enable peripheral clock gating
                                                  // based on CPUx

//*************************************************************************************************
//
// The following are defines for the bit fields in the ADCSEAGGRCPU2 register
//
//*************************************************************************************************
#define SYSCTL_ADCSEAGGRCPU2_FRAMESEL_S   0U
#define SYSCTL_ADCSEAGGRCPU2_FRAMESEL_M   0x7U    // FRAMESEL Selection for Peripheral Instance
#define SYSCTL_ADCSEAGGRCPU2_CPUSEL_S     3U
#define SYSCTL_ADCSEAGGRCPU2_CPUSEL_M     0x38U   // CPUSEL Selection for Peripheral Instance
#define SYSCTL_ADCSEAGGRCPU2_STANDBYEN    0x40U   // STANDBYEN to enable peripheral clock gating
                                                  // based on CPUx
#define SYSCTL_ADCSEAGGRCPU2_DBGHALTEN    0x80U   // DBGHALTEN to enable peripheral clock gating
                                                  // based on CPUx

//*************************************************************************************************
//
// The following are defines for the bit fields in the ADCSEAGGRCPU3 register
//
//*************************************************************************************************
#define SYSCTL_ADCSEAGGRCPU3_FRAMESEL_S   0U
#define SYSCTL_ADCSEAGGRCPU3_FRAMESEL_M   0x7U    // FRAMESEL Selection for Peripheral Instance
#define SYSCTL_ADCSEAGGRCPU3_CPUSEL_S     3U
#define SYSCTL_ADCSEAGGRCPU3_CPUSEL_M     0x38U   // CPUSEL Selection for Peripheral Instance
#define SYSCTL_ADCSEAGGRCPU3_STANDBYEN    0x40U   // STANDBYEN to enable peripheral clock gating
                                                  // based on CPUx
#define SYSCTL_ADCSEAGGRCPU3_DBGHALTEN    0x80U   // DBGHALTEN to enable peripheral clock gating
                                                  // based on CPUx

//*************************************************************************************************
//
// The following are defines for the bit fields in the RTDMA1CH register
//
//*************************************************************************************************
#define SYSCTL_RTDMA1CH_FRAMESEL_S   0U
#define SYSCTL_RTDMA1CH_FRAMESEL_M   0x7U    // FRAMESEL Selection for Peripheral Instance
#define SYSCTL_RTDMA1CH_CPUSEL_S     3U
#define SYSCTL_RTDMA1CH_CPUSEL_M     0x38U   // CPUSEL Selection for Peripheral Instance
#define SYSCTL_RTDMA1CH_STANDBYEN    0x40U   // STANDBYEN to enable peripheral clock gating based
                                             // on CPUx
#define SYSCTL_RTDMA1CH_DBGHALTEN    0x80U   // DBGHALTEN to enable peripheral clock gating based
                                             // on CPUx

//*************************************************************************************************
//
// The following are defines for the bit fields in the RTDMA2CH register
//
//*************************************************************************************************
#define SYSCTL_RTDMA2CH_FRAMESEL_S   0U
#define SYSCTL_RTDMA2CH_FRAMESEL_M   0x7U    // FRAMESEL Selection for Peripheral Instance
#define SYSCTL_RTDMA2CH_CPUSEL_S     3U
#define SYSCTL_RTDMA2CH_CPUSEL_M     0x38U   // CPUSEL Selection for Peripheral Instance
#define SYSCTL_RTDMA2CH_STANDBYEN    0x40U   // STANDBYEN to enable peripheral clock gating based
                                             // on CPUx
#define SYSCTL_RTDMA2CH_DBGHALTEN    0x80U   // DBGHALTEN to enable peripheral clock gating based
                                             // on CPUx

//*************************************************************************************************
//
// The following are defines for the bit fields in the WADI1 register
//
//*************************************************************************************************
#define SYSCTL_WADI1_FRAMESEL_S   0U
#define SYSCTL_WADI1_FRAMESEL_M   0x7U    // FRAMESEL Selection for Peripheral Instance
#define SYSCTL_WADI1_CPUSEL_S     3U
#define SYSCTL_WADI1_CPUSEL_M     0x38U   // CPUSEL Selection for Peripheral Instance
#define SYSCTL_WADI1_STANDBYEN    0x40U   // STANDBYEN to enable peripheral clock gating based on
                                          // CPUx
#define SYSCTL_WADI1_DBGHALTEN    0x80U   // DBGHALTEN to enable peripheral clock gating based on
                                          // CPUx

//*************************************************************************************************
//
// The following are defines for the bit fields in the WADI2 register
//
//*************************************************************************************************
#define SYSCTL_WADI2_FRAMESEL_S   0U
#define SYSCTL_WADI2_FRAMESEL_M   0x7U    // FRAMESEL Selection for Peripheral Instance
#define SYSCTL_WADI2_CPUSEL_S     3U
#define SYSCTL_WADI2_CPUSEL_M     0x38U   // CPUSEL Selection for Peripheral Instance
#define SYSCTL_WADI2_STANDBYEN    0x40U   // STANDBYEN to enable peripheral clock gating based on
                                          // CPUx
#define SYSCTL_WADI2_DBGHALTEN    0x80U   // DBGHALTEN to enable peripheral clock gating based on
                                          // CPUx

//*************************************************************************************************
//
// The following are defines for the bit fields in the INPUTXBARFLAGS register
//
//*************************************************************************************************
#define SYSCTL_INPUTXBARFLAGS_FRAMESEL_S   0U
#define SYSCTL_INPUTXBARFLAGS_FRAMESEL_M   0x7U    // FRAMESEL Selection for Peripheral Instance
#define SYSCTL_INPUTXBARFLAGS_CPUSEL_S     3U
#define SYSCTL_INPUTXBARFLAGS_CPUSEL_M     0x38U   // CPUSEL Selection for Peripheral Instance
#define SYSCTL_INPUTXBARFLAGS_STANDBYEN    0x40U   // STANDBYEN to enable peripheral clock gating
                                                   // based on CPUx
#define SYSCTL_INPUTXBARFLAGS_DBGHALTEN    0x80U   // DBGHALTEN to enable peripheral clock gating
                                                   // based on CPUx

//*************************************************************************************************
//
// The following are defines for the bit fields in the OUTPUTXBARFLAGS register
//
//*************************************************************************************************
#define SYSCTL_OUTPUTXBARFLAGS_FRAMESEL_S   0U
#define SYSCTL_OUTPUTXBARFLAGS_FRAMESEL_M   0x7U    // FRAMESEL Selection for Peripheral Instance
#define SYSCTL_OUTPUTXBARFLAGS_CPUSEL_S     3U
#define SYSCTL_OUTPUTXBARFLAGS_CPUSEL_M     0x38U   // CPUSEL Selection for Peripheral Instance
#define SYSCTL_OUTPUTXBARFLAGS_STANDBYEN    0x40U   // STANDBYEN to enable peripheral clock gating
                                                    // based on CPUx
#define SYSCTL_OUTPUTXBARFLAGS_DBGHALTEN    0x80U   // DBGHALTEN to enable peripheral clock gating
                                                    // based on CPUx

