TexasInstruments/f29h85x-sdk/source/driverlib/inc/hw_sysctl.h
//*************************************************************************************************
//
// The following are defines for the bit fields in the DLTFIFOREGS register
//
//*************************************************************************************************
#define SYSCTL_DLTFIFOREGS_FRAMESEL_S   0U
#define SYSCTL_DLTFIFOREGS_FRAMESEL_M   0x7U    // FRAMESEL Selection for Peripheral Instance
#define SYSCTL_DLTFIFOREGS_CPUSEL_S     3U
#define SYSCTL_DLTFIFOREGS_CPUSEL_M     0x38U   // CPUSEL Selection for Peripheral Instance
#define SYSCTL_DLTFIFOREGS_STANDBYEN    0x40U   // STANDBYEN to enable peripheral clock gating
                                                // based on CPUx
#define SYSCTL_DLTFIFOREGS_DBGHALTEN    0x80U   // DBGHALTEN to enable peripheral clock gating
                                                // based on CPUx

//*************************************************************************************************
//
// The following are defines for the bit fields in the ADC_GLOBAL_REGS register
//
//*************************************************************************************************
#define SYSCTL_ADC_GLOBAL_REGS_FRAMESEL_S   0U
#define SYSCTL_ADC_GLOBAL_REGS_FRAMESEL_M   0x7U    // FRAMESEL Selection for Peripheral Instance
#define SYSCTL_ADC_GLOBAL_REGS_CPUSEL_S     3U
#define SYSCTL_ADC_GLOBAL_REGS_CPUSEL_M     0x38U   // CPUSEL Selection for Peripheral Instance
#define SYSCTL_ADC_GLOBAL_REGS_STANDBYEN    0x40U   // STANDBYEN to enable peripheral clock gating
                                                    // based on CPUx
#define SYSCTL_ADC_GLOBAL_REGS_DBGHALTEN    0x80U   // DBGHALTEN to enable peripheral clock gating
                                                    // based on CPUx

//*************************************************************************************************
//
// The following are defines for the bit fields in the ERROR_AGGREGATOR register
//
//*************************************************************************************************
#define SYSCTL_ERROR_AGGREGATOR_FRAMESEL_S   0U
#define SYSCTL_ERROR_AGGREGATOR_FRAMESEL_M   0x7U    // FRAMESEL Selection for Peripheral Instance
#define SYSCTL_ERROR_AGGREGATOR_CPUSEL_S     3U
#define SYSCTL_ERROR_AGGREGATOR_CPUSEL_M     0x38U   // CPUSEL Selection for Peripheral Instance
#define SYSCTL_ERROR_AGGREGATOR_STANDBYEN    0x40U   // STANDBYEN to enable peripheral clock gating
                                                     // based on CPUx
#define SYSCTL_ERROR_AGGREGATOR_DBGHALTEN    0x80U   // DBGHALTEN to enable peripheral clock gating
                                                     // based on CPUx

//*************************************************************************************************
//
// The following are defines for the bit fields in the ESM register
//
//*************************************************************************************************
#define SYSCTL_ESM_FRAMESEL_S   0U
#define SYSCTL_ESM_FRAMESEL_M   0x7U    // FRAMESEL Selection for Peripheral Instance
#define SYSCTL_ESM_CPUSEL_S     3U
#define SYSCTL_ESM_CPUSEL_M     0x38U   // CPUSEL Selection for Peripheral Instance
#define SYSCTL_ESM_STANDBYEN    0x40U   // STANDBYEN to enable peripheral clock gating based on
                                        // CPUx
#define SYSCTL_ESM_DBGHALTEN    0x80U   // DBGHALTEN to enable peripheral clock gating based on
                                        // CPUx

//*************************************************************************************************
//
// The following are defines for the bit fields in the PARITY_TEST register
//
//*************************************************************************************************
#define SYSCTL_PARITY_TEST_TESTEN_S   0U
#define SYSCTL_PARITY_TEST_TESTEN_M   0xFU   // Parity test enable configuration


//*************************************************************************************************
//
// The following are defines for the bit fields in the CPUPERCFGLOCK1 register
//
//*************************************************************************************************
#define SYSCTL_CPUPERCFGLOCK1_PCLKCR0    0x1U          // Lock bit for PCLKCR0 Register
#define SYSCTL_CPUPERCFGLOCK1_PCLKCR1    0x2U          // Lock bit for PCLKCR1 Register
#define SYSCTL_CPUPERCFGLOCK1_PCLKCR2    0x4U          // Lock bit for PCLKCR2 Register
#define SYSCTL_CPUPERCFGLOCK1_PCLKCR3    0x8U          // Lock bit for PCLKCR3 Register
#define SYSCTL_CPUPERCFGLOCK1_PCLKCR4    0x10U         // Lock bit for PCLKCR4 Register
#define SYSCTL_CPUPERCFGLOCK1_PCLKCR6    0x40U         // Lock bit for PCLKCR6 Register
#define SYSCTL_CPUPERCFGLOCK1_PCLKCR7    0x80U         // Lock bit for PCLKCR7 Register
#define SYSCTL_CPUPERCFGLOCK1_PCLKCR8    0x100U        // Lock bit for PCLKCR8 Register
#define SYSCTL_CPUPERCFGLOCK1_PCLKCR9    0x200U        // Lock bit for PCLKCR9 Register
#define SYSCTL_CPUPERCFGLOCK1_PCLKCR10   0x400U        // Lock bit for PCLKCR10 Register
#define SYSCTL_CPUPERCFGLOCK1_PCLKCR13   0x2000U       // Lock bit for PCLKCR13 Register
#define SYSCTL_CPUPERCFGLOCK1_PCLKCR14   0x4000U       // Lock bit for PCLKCR14 Register
#define SYSCTL_CPUPERCFGLOCK1_PCLKCR16   0x10000U      // Lock bit for PCLKCR16 Register
#define SYSCTL_CPUPERCFGLOCK1_PCLKCR17   0x20000U      // Lock bit for PCLKCR17 Register
#define SYSCTL_CPUPERCFGLOCK1_PCLKCR18   0x40000U      // Lock bit for PCLKCR18 Register
#define SYSCTL_CPUPERCFGLOCK1_PCLKCR19   0x80000U      // Lock bit for PCLKCR19 Register
#define SYSCTL_CPUPERCFGLOCK1_PCLKCR20   0x100000U     // Lock bit for PCLKCR20 Register
#define SYSCTL_CPUPERCFGLOCK1_PCLKCR21   0x200000U     // Lock bit for PCLKCR21 Register
#define SYSCTL_CPUPERCFGLOCK1_PCLKCR23   0x800000U     // Lock bit for PCLKCR23 Register
#define SYSCTL_CPUPERCFGLOCK1_PCLKCR25   0x2000000U    // Lock bit for PCLKCR25 Register
#define SYSCTL_CPUPERCFGLOCK1_PCLKCR27   0x8000000U    // Lock bit for PCLKCR27 Register
#define SYSCTL_CPUPERCFGLOCK1_PCLKCR28   0x10000000U   // Lock bit for PCLKCR28 Register
#define SYSCTL_CPUPERCFGLOCK1_PCLKCR30   0x40000000U   // Lock bit for PCLKCR30 Register

//*************************************************************************************************
//
// The following are defines for the bit fields in the CPUPERCFGLOCK2 register
//
//*************************************************************************************************
#define SYSCTL_CPUPERCFGLOCK2_PCLKCR32   0x1U   // Lock bit for PCLKCR32 Register

//*************************************************************************************************
//
// The following are defines for the bit fields in the PCLKCR0 register
//
//*************************************************************************************************
#define SYSCTL_PCLKCR0_RTDMA1       0x4U         // RTDMA1 Clock Enable Bit
#define SYSCTL_PCLKCR0_RTDMA2       0x8U         // RTDMA2 Clock Enable Bit
#define SYSCTL_PCLKCR0_CPUTIMER0    0x10U        // CPUTIMER0 Clock Enable Bit
#define SYSCTL_PCLKCR0_CPUTIMER1    0x20U        // CPUTIMER1 Clock Enable Bit
#define SYSCTL_PCLKCR0_CPUTIMER2    0x40U        // CPUTIMER2 Clock Enable Bit
#define SYSCTL_PCLKCR0_TBCLKSYNC    0x80000U     // TBCLKSYNC Clock Enable Bit
#define SYSCTL_PCLKCR0_GTBCLKSYNC   0x100000U    // GTBCLKSYNC Clock Enable Bit
#define SYSCTL_PCLKCR0_CPUX_ERAD    0x1000000U   // CPUx_ERAD Clock Enable Bit
#define SYSCTL_PCLKCR0_CPUX_DLT     0x2000000U   // CPUx_DLT Clock Enable Bit

//*************************************************************************************************
//
// The following are defines for the bit fields in the PCLKCR1 register
//
//*************************************************************************************************
#define SYSCTL_PCLKCR1_EMIF1   0x1U   // EMIF1 Clock Enable bit

//*************************************************************************************************
//
// The following are defines for the bit fields in the PCLKCR2 register
//
//*************************************************************************************************
#define SYSCTL_PCLKCR2_EPWM1    0x1U       // EPWM1 Clock Enable bit
#define SYSCTL_PCLKCR2_EPWM2    0x2U       // EPWM2 Clock Enable bit
#define SYSCTL_PCLKCR2_EPWM3    0x4U       // EPWM3 Clock Enable bit
#define SYSCTL_PCLKCR2_EPWM4    0x8U       // EPWM4 Clock Enable bit
#define SYSCTL_PCLKCR2_EPWM5    0x10U      // EPWM5 Clock Enable bit
#define SYSCTL_PCLKCR2_EPWM6    0x20U      // EPWM6 Clock Enable bit
#define SYSCTL_PCLKCR2_EPWM7    0x40U      // EPWM7 Clock Enable bit
#define SYSCTL_PCLKCR2_EPWM8    0x80U      // EPWM8 Clock Enable bit
#define SYSCTL_PCLKCR2_EPWM9    0x100U     // EPWM9 Clock Enable bit
#define SYSCTL_PCLKCR2_EPWM10   0x200U     // EPWM10 Clock Enable bit
#define SYSCTL_PCLKCR2_EPWM11   0x400U     // EPWM11 Clock Enable bit
#define SYSCTL_PCLKCR2_EPWM12   0x800U     // EPWM12 Clock Enable bit
#define SYSCTL_PCLKCR2_EPWM13   0x1000U    // EPWM13 Clock Enable bit
#define SYSCTL_PCLKCR2_EPWM14   0x2000U    // EPWM14 Clock Enable bit
#define SYSCTL_PCLKCR2_EPWM15   0x4000U    // EPWM15 Clock Enable bit
#define SYSCTL_PCLKCR2_EPWM16   0x8000U    // EPWM16 Clock Enable bit
#define SYSCTL_PCLKCR2_EPWM17   0x10000U   // EPWM17 Clock Enable bit
#define SYSCTL_PCLKCR2_EPWM18   0x20000U   // EPWM18 Clock Enable bit

//*************************************************************************************************
//
// The following are defines for the bit fields in the PCLKCR3 register
//
//*************************************************************************************************
#define SYSCTL_PCLKCR3_ECAP1   0x1U    // ECAP1 Clock Enable bit
#define SYSCTL_PCLKCR3_ECAP2   0x2U    // ECAP2 Clock Enable bit
#define SYSCTL_PCLKCR3_ECAP3   0x4U    // ECAP3 Clock Enable bit
#define SYSCTL_PCLKCR3_ECAP4   0x8U    // ECAP4 Clock Enable bit
#define SYSCTL_PCLKCR3_ECAP5   0x10U   // ECAP5 Clock Enable bit
#define SYSCTL_PCLKCR3_ECAP6   0x20U   // ECAP6 Clock Enable bit

//*************************************************************************************************
//
// The following are defines for the bit fields in the PCLKCR4 register
//
//*************************************************************************************************
#define SYSCTL_PCLKCR4_EQEP1   0x1U    // EQEP1 Clock Enable bit
#define SYSCTL_PCLKCR4_EQEP2   0x2U    // EQEP2 Clock Enable bit
#define SYSCTL_PCLKCR4_EQEP3   0x4U    // EQEP3 Clock Enable bit
#define SYSCTL_PCLKCR4_EQEP4   0x8U    // EQEP4 Clock Enable bit
#define SYSCTL_PCLKCR4_EQEP5   0x10U   // EQEP5 Clock Enable bit
#define SYSCTL_PCLKCR4_EQEP6   0x20U   // EQEP6 Clock Enable bit

//*************************************************************************************************
//
// The following are defines for the bit fields in the PCLKCR6 register
//
//*************************************************************************************************
#define SYSCTL_PCLKCR6_SD1   0x1U   // SD1 Clock Enable bit
#define SYSCTL_PCLKCR6_SD2   0x2U   // SD2 Clock Enable bit
#define SYSCTL_PCLKCR6_SD3   0x4U   // SD3 Clock Enable bit
#define SYSCTL_PCLKCR6_SD4   0x8U   // SD4 Clock Enable bit

//*************************************************************************************************
//
// The following are defines for the bit fields in the PCLKCR7 register
//
//*************************************************************************************************
#define SYSCTL_PCLKCR7_UART_A   0x10000U    // UART_A Clock Enable bit
#define SYSCTL_PCLKCR7_UART_B   0x20000U    // UART_B Clock Enable bit
#define SYSCTL_PCLKCR7_UART_C   0x40000U    // UART_C Clock Enable bit
#define SYSCTL_PCLKCR7_UART_D   0x80000U    // UART_D Clock Enable bit
#define SYSCTL_PCLKCR7_UART_E   0x100000U   // UART_E Clock Enable bit
#define SYSCTL_PCLKCR7_UART_F   0x200000U   // UART_F Clock Enable bit

//*************************************************************************************************
//
// The following are defines for the bit fields in the PCLKCR8 register
//
//*************************************************************************************************
#define SYSCTL_PCLKCR8_SPI_A   0x1U    // SPI_A Clock Enable bit
#define SYSCTL_PCLKCR8_SPI_B   0x2U    // SPI_B Clock Enable bit
#define SYSCTL_PCLKCR8_SPI_C   0x4U    // SPI_C Clock Enable bit
#define SYSCTL_PCLKCR8_SPI_D   0x8U    // SPI_D Clock Enable bit
#define SYSCTL_PCLKCR8_SPI_E   0x10U   // SPI_E Clock Enable bit

//*************************************************************************************************
//
// The following are defines for the bit fields in the PCLKCR9 register
//
//*************************************************************************************************
#define SYSCTL_PCLKCR9_I2C_A   0x1U   // I2C_A Clock Enable bit
#define SYSCTL_PCLKCR9_I2C_B   0x2U   // I2C_B Clock Enable bit

//*************************************************************************************************
//
// The following are defines for the bit fields in the PCLKCR10 register
//
//*************************************************************************************************
#define SYSCTL_PCLKCR10_MCAN_A   0x10U    // MCAN_A Clock Enable bit
#define SYSCTL_PCLKCR10_MCAN_B   0x20U    // MCAN_B Clock Enable bit
#define SYSCTL_PCLKCR10_MCAN_C   0x40U    // MCAN_C Clock Enable bit
#define SYSCTL_PCLKCR10_MCAN_D   0x80U    // MCAN_D Clock Enable bit
#define SYSCTL_PCLKCR10_MCAN_E   0x100U   // MCAN_E Clock Enable bit
#define SYSCTL_PCLKCR10_MCAN_F   0x200U   // MCAN_F Clock Enable bit

//*************************************************************************************************
//
// The following are defines for the bit fields in the PCLKCR13 register
//
//*************************************************************************************************
#define SYSCTL_PCLKCR13_ADC_A   0x1U    // ADC_A Clock Enable bit
#define SYSCTL_PCLKCR13_ADC_B   0x2U    // ADC_B Clock Enable bit
#define SYSCTL_PCLKCR13_ADC_C   0x4U    // ADC_C Clock Enable bit
#define SYSCTL_PCLKCR13_ADC_D   0x8U    // ADC_D Clock Enable bit
#define SYSCTL_PCLKCR13_ADC_E   0x10U   // ADC_E Clock Enable bit

//*************************************************************************************************
//
// The following are defines for the bit fields in the PCLKCR14 register
//
//*************************************************************************************************
#define SYSCTL_PCLKCR14_CMPSS1    0x1U     // CMPSS1 Clock Enable bit
#define SYSCTL_PCLKCR14_CMPSS2    0x2U     // CMPSS2 Clock Enable bit
#define SYSCTL_PCLKCR14_CMPSS3    0x4U     // CMPSS3 Clock Enable bit
#define SYSCTL_PCLKCR14_CMPSS4    0x8U     // CMPSS4 Clock Enable bit
#define SYSCTL_PCLKCR14_CMPSS5    0x10U    // CMPSS5 Clock Enable bit
#define SYSCTL_PCLKCR14_CMPSS6    0x20U    // CMPSS6 Clock Enable bit
#define SYSCTL_PCLKCR14_CMPSS7    0x40U    // CMPSS7 Clock Enable bit
#define SYSCTL_PCLKCR14_CMPSS8    0x80U    // CMPSS8 Clock Enable bit
#define SYSCTL_PCLKCR14_CMPSS9    0x100U   // CMPSS9 Clock Enable bit
#define SYSCTL_PCLKCR14_CMPSS10   0x200U   // CMPSS10 Clock Enable bit
#define SYSCTL_PCLKCR14_CMPSS11   0x400U   // CMPSS11 Clock Enable bit
#define SYSCTL_PCLKCR14_CMPSS12   0x800U   // CMPSS12 Clock Enable bit

//*************************************************************************************************
//
// The following are defines for the bit fields in the PCLKCR16 register
//
//*************************************************************************************************
#define SYSCTL_PCLKCR16_DAC_A   0x10000U   // DAC_A Clock Enable bit
#define SYSCTL_PCLKCR16_DAC_B   0x20000U   // DAC_B Clock Enable bit

//*************************************************************************************************
//
// The following are defines for the bit fields in the PCLKCR17 register
//
//*************************************************************************************************
#define SYSCTL_PCLKCR17_CLB1   0x1U    // CLB1 Clock Enable bit
#define SYSCTL_PCLKCR17_CLB2   0x2U    // CLB2 Clock Enable bit
#define SYSCTL_PCLKCR17_CLB3   0x4U    // CLB3 Clock Enable bit
#define SYSCTL_PCLKCR17_CLB4   0x8U    // CLB4 Clock Enable bit
#define SYSCTL_PCLKCR17_CLB5   0x10U   // CLB5 Clock Enable bit
#define SYSCTL_PCLKCR17_CLB6   0x20U   // CLB6 Clock Enable bit

//*************************************************************************************************
//
// The following are defines for the bit fields in the PCLKCR18 register
//
//*************************************************************************************************
#define SYSCTL_PCLKCR18_FSITX_A   0x1U       // FSITX_A Clock Enable bit
#define SYSCTL_PCLKCR18_FSITX_B   0x2U       // FSITX_B Clock Enable bit
#define SYSCTL_PCLKCR18_FSITX_C   0x4U       // FSITX_C Clock Enable bit
#define SYSCTL_PCLKCR18_FSITX_D   0x8U       // FSITX_D Clock Enable bit
#define SYSCTL_PCLKCR18_FSIRX_A   0x10000U   // FSIRX_A Clock Enable bit
#define SYSCTL_PCLKCR18_FSIRX_B   0x20000U   // FSIRX_B Clock Enable bit
#define SYSCTL_PCLKCR18_FSIRX_C   0x40000U   // FSIRX_C Clock Enable bit
#define SYSCTL_PCLKCR18_FSIRX_D   0x80000U   // FSIRX_D Clock Enable bit

//*************************************************************************************************
//
// The following are defines for the bit fields in the PCLKCR19 register
//
//*************************************************************************************************
#define SYSCTL_PCLKCR19_LIN_A   0x1U   // LIN_A Clock Enable bit
#define SYSCTL_PCLKCR19_LIN_B   0x2U   // LIN_B Clock Enable bit

//*************************************************************************************************
//
// The following are defines for the bit fields in the PCLKCR20 register
//
//*************************************************************************************************
#define SYSCTL_PCLKCR20_PMBUS_A   0x1U   // PMBUS_A Clock Enable bit

//*************************************************************************************************
//
// The following are defines for the bit fields in the PCLKCR21 register
//
//*************************************************************************************************
#define SYSCTL_PCLKCR21_DCC1   0x1U   // DCC1 Clock Enable Bit
#define SYSCTL_PCLKCR21_DCC2   0x2U   // DCC2 Clock Enable Bit
#define SYSCTL_PCLKCR21_DCC3   0x4U   // DCC3 Clock Enable Bit

//*************************************************************************************************
//
// The following are defines for the bit fields in the PCLKCR23 register
//
//*************************************************************************************************
#define SYSCTL_PCLKCR23_ETHERCAT   0x1U   // ETHERCAT Clock Enable Bit

//*************************************************************************************************
//
// The following are defines for the bit fields in the PCLKCR25 register
//
//*************************************************************************************************
#define SYSCTL_PCLKCR25_HRCAL0   0x1U   // HRCAL0 Clock Enable Bit
#define SYSCTL_PCLKCR25_HRCAL1   0x2U   // HRCAL1 Clock Enable Bit
#define SYSCTL_PCLKCR25_HRCAL2   0x4U   // HRCAL2 Clock Enable Bit

//*************************************************************************************************
//
// The following are defines for the bit fields in the PCLKCR27 register
//
//*************************************************************************************************
#define SYSCTL_PCLKCR27_EPG1   0x1U   // EPG1 Clock Enable Bit

//*************************************************************************************************
//
// The following are defines for the bit fields in the PCLKCR28 register
//
//*************************************************************************************************
#define SYSCTL_PCLKCR28_ADCCHECKER1     0x1U       // ADCCHECKER1 Clock Enable bit
#define SYSCTL_PCLKCR28_ADCCHECKER2     0x2U       // ADCCHECKER2 Clock Enable bit
#define SYSCTL_PCLKCR28_ADCCHECKER3     0x4U       // ADCCHECKER3 Clock Enable bit
#define SYSCTL_PCLKCR28_ADCCHECKER4     0x8U       // ADCCHECKER4 Clock Enable bit
#define SYSCTL_PCLKCR28_ADCCHECKER5     0x10U      // ADCCHECKER5 Clock Enable bit
#define SYSCTL_PCLKCR28_ADCCHECKER6     0x20U      // ADCCHECKER6 Clock Enable bit
#define SYSCTL_PCLKCR28_ADCCHECKER7     0x40U      // ADCCHECKER7 Clock Enable bit
#define SYSCTL_PCLKCR28_ADCCHECKER8     0x80U      // ADCCHECKER8 Clock Enable bit
#define SYSCTL_PCLKCR28_ADCCHECKER9     0x100U     // ADCCHECKER9 Clock Enable bit
#define SYSCTL_PCLKCR28_ADCCHECKER10    0x200U     // ADCCHECKER10 Clock Enable bit
#define SYSCTL_PCLKCR28_ADCSEAGGRCPU1   0x10000U   // ADCSEAGGRCPU1 Clock Enable bit
#define SYSCTL_PCLKCR28_ADCSEAGGRCPU2   0x20000U   // ADCSEAGGRCPU2 Clock Enable bit
#define SYSCTL_PCLKCR28_ADCSEAGGRCPU3   0x40000U   // ADCSEAGGRCPU3 Clock Enable bit

//*************************************************************************************************
//
// The following are defines for the bit fields in the PCLKCR30 register
//
//*************************************************************************************************
#define SYSCTL_PCLKCR30_SENT1   0x1U    // SENT1 Clock Enable bit
#define SYSCTL_PCLKCR30_SENT2   0x2U    // SENT2 Clock Enable bit
#define SYSCTL_PCLKCR30_SENT3   0x4U    // SENT3 Clock Enable bit
#define SYSCTL_PCLKCR30_SENT4   0x8U    // SENT4 Clock Enable bit
#define SYSCTL_PCLKCR30_SENT5   0x10U   // SENT5 Clock Enable bit
#define SYSCTL_PCLKCR30_SENT6   0x20U   // SENT6 Clock Enable bit

//*************************************************************************************************
//
// The following are defines for the bit fields in the PCLKCR32 register
//
//*************************************************************************************************
#define SYSCTL_PCLKCR32_WADI1   0x1U   // WADI1 Clock Enable bit
#define SYSCTL_PCLKCR32_WADI2   0x2U   // WADI2 Clock Enable bit

//*************************************************************************************************
//
// The following are defines for the bit fields in the SOFTPRES0 register
//
//*************************************************************************************************
#define SYSCTL_SOFTPRES0_CPUTIMER    0x10U        // Reset bit for modules CPUTIMER0, COUTIMER1 and
                                                  // CPUTIMER2
#define SYSCTL_SOFTPRES0_CPUX_ERAD   0x1000000U   // CPUx_ERAD Module reset bit
#define SYSCTL_SOFTPRES0_CPUX_DLT    0x2000000U   // CPUx_DLT Module reset bit

//*************************************************************************************************
//
// The following are defines for the bit fields in the SOFTPRES1 register
//
//*************************************************************************************************
#define SYSCTL_SOFTPRES1_EMIF1   0x1U   // EMIF1 software reset bit

