TexasInstruments/f29h85x-sdk/source/driverlib/inc/hw_sysctl.h
//*************************************************************************************************
//
// The following are defines for the bit fields in the SOFTPRES2 register
//
//*************************************************************************************************
#define SYSCTL_SOFTPRES2_EPWM1    0x1U       // EPWM1 software reset bit
#define SYSCTL_SOFTPRES2_EPWM2    0x2U       // EPWM2 software reset bit
#define SYSCTL_SOFTPRES2_EPWM3    0x4U       // EPWM3 software reset bit
#define SYSCTL_SOFTPRES2_EPWM4    0x8U       // EPWM4 software reset bit
#define SYSCTL_SOFTPRES2_EPWM5    0x10U      // EPWM5 software reset bit
#define SYSCTL_SOFTPRES2_EPWM6    0x20U      // EPWM6 software reset bit
#define SYSCTL_SOFTPRES2_EPWM7    0x40U      // EPWM7 software reset bit
#define SYSCTL_SOFTPRES2_EPWM8    0x80U      // EPWM8 software reset bit
#define SYSCTL_SOFTPRES2_EPWM9    0x100U     // EPWM9 software reset bit
#define SYSCTL_SOFTPRES2_EPWM10   0x200U     // EPWM10 software reset bit
#define SYSCTL_SOFTPRES2_EPWM11   0x400U     // EPWM11 software reset bit
#define SYSCTL_SOFTPRES2_EPWM12   0x800U     // EPWM12 software reset bit
#define SYSCTL_SOFTPRES2_EPWM13   0x1000U    // EPWM13 software reset bit
#define SYSCTL_SOFTPRES2_EPWM14   0x2000U    // EPWM14 software reset bit
#define SYSCTL_SOFTPRES2_EPWM15   0x4000U    // EPWM15 software reset bit
#define SYSCTL_SOFTPRES2_EPWM16   0x8000U    // EPWM16 software reset bit
#define SYSCTL_SOFTPRES2_EPWM17   0x10000U   // EPWM17 software reset bit
#define SYSCTL_SOFTPRES2_EPWM18   0x20000U   // EPWM18 software reset bit

//*************************************************************************************************
//
// The following are defines for the bit fields in the SOFTPRES3 register
//
//*************************************************************************************************
#define SYSCTL_SOFTPRES3_ECAP1   0x1U    // ECAP1 software reset bit
#define SYSCTL_SOFTPRES3_ECAP2   0x2U    // ECAP2 software reset bit
#define SYSCTL_SOFTPRES3_ECAP3   0x4U    // ECAP3 software reset bit
#define SYSCTL_SOFTPRES3_ECAP4   0x8U    // ECAP4 software reset bit
#define SYSCTL_SOFTPRES3_ECAP5   0x10U   // ECAP5 software reset bit
#define SYSCTL_SOFTPRES3_ECAP6   0x20U   // ECAP6 software reset bit

//*************************************************************************************************
//
// The following are defines for the bit fields in the SOFTPRES4 register
//
//*************************************************************************************************
#define SYSCTL_SOFTPRES4_EQEP1   0x1U    // EQEP1 software reset bit
#define SYSCTL_SOFTPRES4_EQEP2   0x2U    // EQEP2 software reset bit
#define SYSCTL_SOFTPRES4_EQEP3   0x4U    // EQEP3 software reset bit
#define SYSCTL_SOFTPRES4_EQEP4   0x8U    // EQEP4 software reset bit
#define SYSCTL_SOFTPRES4_EQEP5   0x10U   // EQEP5 software reset bit
#define SYSCTL_SOFTPRES4_EQEP6   0x20U   // EQEP6 software reset bit

//*************************************************************************************************
//
// The following are defines for the bit fields in the SOFTPRES6 register
//
//*************************************************************************************************
#define SYSCTL_SOFTPRES6_SD1   0x1U   // SD1 software reset bit
#define SYSCTL_SOFTPRES6_SD2   0x2U   // SD2 software reset bit
#define SYSCTL_SOFTPRES6_SD3   0x4U   // SD3 software reset bit
#define SYSCTL_SOFTPRES6_SD4   0x8U   // SD4 software reset bit

//*************************************************************************************************
//
// The following are defines for the bit fields in the SOFTPRES7 register
//
//*************************************************************************************************
#define SYSCTL_SOFTPRES7_UART_A   0x10000U    // UART_A software reset bit
#define SYSCTL_SOFTPRES7_UART_B   0x20000U    // UART_B software reset bit
#define SYSCTL_SOFTPRES7_UART_C   0x40000U    // UART_C software reset bit
#define SYSCTL_SOFTPRES7_UART_D   0x80000U    // UART_D software reset bit
#define SYSCTL_SOFTPRES7_UART_E   0x100000U   // UART_E software reset bit
#define SYSCTL_SOFTPRES7_UART_F   0x200000U   // UART_F software reset bit

//*************************************************************************************************
//
// The following are defines for the bit fields in the SOFTPRES8 register
//
//*************************************************************************************************
#define SYSCTL_SOFTPRES8_SPI_A   0x1U    // SPI_A software reset bit
#define SYSCTL_SOFTPRES8_SPI_B   0x2U    // SPI_B software reset bit
#define SYSCTL_SOFTPRES8_SPI_C   0x4U    // SPI_C software reset bit
#define SYSCTL_SOFTPRES8_SPI_D   0x8U    // SPI_D software reset bit
#define SYSCTL_SOFTPRES8_SPI_E   0x10U   // SPI_E software reset bit

//*************************************************************************************************
//
// The following are defines for the bit fields in the SOFTPRES9 register
//
//*************************************************************************************************
#define SYSCTL_SOFTPRES9_I2C_A   0x1U   // I2C_A software reset bit
#define SYSCTL_SOFTPRES9_I2C_B   0x2U   // I2C_B software reset bit

//*************************************************************************************************
//
// The following are defines for the bit fields in the SOFTPRES10 register
//
//*************************************************************************************************
#define SYSCTL_SOFTPRES10_MCAN_A   0x10U    // MCAN_A software reset bit
#define SYSCTL_SOFTPRES10_MCAN_B   0x20U    // MCAN_B software reset bit
#define SYSCTL_SOFTPRES10_MCAN_C   0x40U    // MCAN_C software reset bit
#define SYSCTL_SOFTPRES10_MCAN_D   0x80U    // MCAN_D software reset bit
#define SYSCTL_SOFTPRES10_MCAN_E   0x100U   // MCAN_E software reset bit
#define SYSCTL_SOFTPRES10_MCAN_F   0x200U   // MCAN_F software reset bit

//*************************************************************************************************
//
// The following are defines for the bit fields in the SOFTPRES13 register
//
//*************************************************************************************************
#define SYSCTL_SOFTPRES13_ADC_A   0x1U    // ADC_A software reset bit
#define SYSCTL_SOFTPRES13_ADC_B   0x2U    // ADC_B software reset bit
#define SYSCTL_SOFTPRES13_ADC_C   0x4U    // ADC_C software reset bit
#define SYSCTL_SOFTPRES13_ADC_D   0x8U    // ADC_D software reset bit
#define SYSCTL_SOFTPRES13_ADC_E   0x10U   // ADC_E software reset bit

//*************************************************************************************************
//
// The following are defines for the bit fields in the SOFTPRES14 register
//
//*************************************************************************************************
#define SYSCTL_SOFTPRES14_CMPSS1    0x1U     // CMPSS1 software reset bit
#define SYSCTL_SOFTPRES14_CMPSS2    0x2U     // CMPSS2 software reset bit
#define SYSCTL_SOFTPRES14_CMPSS3    0x4U     // CMPSS3 software reset bit
#define SYSCTL_SOFTPRES14_CMPSS4    0x8U     // CMPSS4 software reset bit
#define SYSCTL_SOFTPRES14_CMPSS5    0x10U    // CMPSS5 software reset bit
#define SYSCTL_SOFTPRES14_CMPSS6    0x20U    // CMPSS6 software reset bit
#define SYSCTL_SOFTPRES14_CMPSS7    0x40U    // CMPSS7 software reset bit
#define SYSCTL_SOFTPRES14_CMPSS8    0x80U    // CMPSS8 software reset bit
#define SYSCTL_SOFTPRES14_CMPSS9    0x100U   // CMPSS9 software reset bit
#define SYSCTL_SOFTPRES14_CMPSS10   0x200U   // CMPSS10 software reset bit
#define SYSCTL_SOFTPRES14_CMPSS11   0x400U   // CMPSS11 software reset bit
#define SYSCTL_SOFTPRES14_CMPSS12   0x800U   // CMPSS12 software reset bit

//*************************************************************************************************
//
// The following are defines for the bit fields in the SOFTPRES16 register
//
//*************************************************************************************************
#define SYSCTL_SOFTPRES16_DAC_A   0x10000U   // DAC_A software reset bit
#define SYSCTL_SOFTPRES16_DAC_B   0x20000U   // DAC_B software reset bit

//*************************************************************************************************
//
// The following are defines for the bit fields in the SOFTPRES17 register
//
//*************************************************************************************************
#define SYSCTL_SOFTPRES17_CLB1   0x1U    // CLB1 software reset bit
#define SYSCTL_SOFTPRES17_CLB2   0x2U    // CLB2 software reset bit
#define SYSCTL_SOFTPRES17_CLB3   0x4U    // CLB3 software reset bit
#define SYSCTL_SOFTPRES17_CLB4   0x8U    // CLB4 software reset bit
#define SYSCTL_SOFTPRES17_CLB5   0x10U   // CLB5 software reset bit
#define SYSCTL_SOFTPRES17_CLB6   0x20U   // CLB6 software reset bit

//*************************************************************************************************
//
// The following are defines for the bit fields in the SOFTPRES18 register
//
//*************************************************************************************************
#define SYSCTL_SOFTPRES18_FSITX_A   0x1U       // FSITX_A software reset bit
#define SYSCTL_SOFTPRES18_FSITX_B   0x2U       // FSITX_B software reset bit
#define SYSCTL_SOFTPRES18_FSITX_C   0x4U       // FSITX_C software reset bit
#define SYSCTL_SOFTPRES18_FSITX_D   0x8U       // FSITX_D software reset bit
#define SYSCTL_SOFTPRES18_FSIRX_A   0x10000U   // FSIRX_A software reset bit
#define SYSCTL_SOFTPRES18_FSIRX_B   0x20000U   // FSIRX_B software reset bit
#define SYSCTL_SOFTPRES18_FSIRX_C   0x40000U   // FSIRX_C software reset bit
#define SYSCTL_SOFTPRES18_FSIRX_D   0x80000U   // FSIRX_D software reset bit

//*************************************************************************************************
//
// The following are defines for the bit fields in the SOFTPRES19 register
//
//*************************************************************************************************
#define SYSCTL_SOFTPRES19_LIN_A   0x1U   // LIN_A software reset bit
#define SYSCTL_SOFTPRES19_LIN_B   0x2U   // LIN_B software reset bit

//*************************************************************************************************
//
// The following are defines for the bit fields in the SOFTPRES20 register
//
//*************************************************************************************************
#define SYSCTL_SOFTPRES20_PMBUS_A   0x1U   // PMBUS_A software reset bit

//*************************************************************************************************
//
// The following are defines for the bit fields in the SOFTPRES21 register
//
//*************************************************************************************************
#define SYSCTL_SOFTPRES21_DCC1   0x1U   // DCC Module reset bit
#define SYSCTL_SOFTPRES21_DCC2   0x2U   // DCC Module reset bit
#define SYSCTL_SOFTPRES21_DCC3   0x4U   // DCC Module reset bit

//*************************************************************************************************
//
// The following are defines for the bit fields in the SOFTPRES23 register
//
//*************************************************************************************************
#define SYSCTL_SOFTPRES23_ETHERCAT   0x1U   // ETHERCAT Module reset bit

//*************************************************************************************************
//
// The following are defines for the bit fields in the SOFTPRES25 register
//
//*************************************************************************************************
#define SYSCTL_SOFTPRES25_HRCAL0   0x1U   // HRCAL0 Module reset bit
#define SYSCTL_SOFTPRES25_HRCAL1   0x2U   // HRCAL1 Module reset bit
#define SYSCTL_SOFTPRES25_HRCAL2   0x4U   // HRCAL2 Module reset bit

//*************************************************************************************************
//
// The following are defines for the bit fields in the SOFTPRES27 register
//
//*************************************************************************************************
#define SYSCTL_SOFTPRES27_EPG1   0x1U   // EPG Module Reset Bit

//*************************************************************************************************
//
// The following are defines for the bit fields in the SOFTPRES28 register
//
//*************************************************************************************************
#define SYSCTL_SOFTPRES28_ADCCHECKER1     0x1U       // ADCCHECKER1 software reset bit
#define SYSCTL_SOFTPRES28_ADCCHECKER2     0x2U       // ADCCHECKER2 software reset bit
#define SYSCTL_SOFTPRES28_ADCCHECKER3     0x4U       // ADCCHECKER3 software reset bit
#define SYSCTL_SOFTPRES28_ADCCHECKER4     0x8U       // ADCCHECKER4 software reset bit
#define SYSCTL_SOFTPRES28_ADCCHECKER5     0x10U      // ADCCHECKER5 software reset bit
#define SYSCTL_SOFTPRES28_ADCCHECKER6     0x20U      // ADCCHECKER6 software reset bit
#define SYSCTL_SOFTPRES28_ADCCHECKER7     0x40U      // ADCCHECKER7 software reset bit
#define SYSCTL_SOFTPRES28_ADCCHECKER8     0x80U      // ADCCHECKER8 software reset bit
#define SYSCTL_SOFTPRES28_ADCCHECKER9     0x100U     // ADCCHECKER9 software reset bit
#define SYSCTL_SOFTPRES28_ADCCHECKER10    0x200U     // ADCCHECKER10 software reset bit
#define SYSCTL_SOFTPRES28_ADCSEAGGRCPU1   0x10000U   // ADCSEAGGRCPU1 software reset bit
#define SYSCTL_SOFTPRES28_ADCSEAGGRCPU2   0x20000U   // ADCSEAGGRCPU2 software reset bit
#define SYSCTL_SOFTPRES28_ADCSEAGGRCPU3   0x40000U   // ADCSEAGGRCPU3 software reset bit

//*************************************************************************************************
//
// The following are defines for the bit fields in the SOFTPRES30 register
//
//*************************************************************************************************
#define SYSCTL_SOFTPRES30_SENT1   0x1U    // SENT1 software reset bit
#define SYSCTL_SOFTPRES30_SENT2   0x2U    // SENT2 software reset bit
#define SYSCTL_SOFTPRES30_SENT3   0x4U    // SENT3 software reset bit
#define SYSCTL_SOFTPRES30_SENT4   0x8U    // SENT4 software reset bit
#define SYSCTL_SOFTPRES30_SENT5   0x10U   // SENT5 software reset bit
#define SYSCTL_SOFTPRES30_SENT6   0x20U   // SENT6 software reset bit

//*************************************************************************************************
//
// The following are defines for the bit fields in the SOFTPRES32 register
//
//*************************************************************************************************
#define SYSCTL_SOFTPRES32_WADI1   0x1U   // WADI1 software reset bit
#define SYSCTL_SOFTPRES32_WADI2   0x2U   // WADI2 software reset bit

//*************************************************************************************************
//
// The following are defines for the bit fields in the PARITY_TEST_ALT1 register
//
//*************************************************************************************************
#define SYSCTL_PARITY_TEST_ALT1_TESTEN_S   0U
#define SYSCTL_PARITY_TEST_ALT1_TESTEN_M   0xFU   // Parity test enable configuration


//*************************************************************************************************
//
// The following are defines for the bit fields in the CPUSYSLOCK1 register
//
//*************************************************************************************************
#define SYSCTL_CPUSYSLOCK1_LPMCR                0x2U          // Lock bit for LPMCR Register
#define SYSCTL_CPUSYSLOCK1_GPIOLPMSEL0          0x4U          // Lock bit for GPIOLPMSEL0 Register
#define SYSCTL_CPUSYSLOCK1_GPIOLPMSEL1          0x8U          // Lock bit for GPIOLPMSEL1 Register
#define SYSCTL_CPUSYSLOCK1_CMPSSLPMSEL          0x20U         // Lock bit for CMPSSLPMSEL register
#define SYSCTL_CPUSYSLOCK1_USER_REG1_SYSRSN     0x1000000U    // Lock bit for USER_REG1_SYSRSn
#define SYSCTL_CPUSYSLOCK1_USER_REG2_SYSRSN     0x2000000U    // Lock bit for USER_REG2_SYSRSn
#define SYSCTL_CPUSYSLOCK1_USER_REG1_XRSN       0x4000000U    // Lock bit for USER_REG1_XRSn
#define SYSCTL_CPUSYSLOCK1_USER_REG2_XRSN       0x8000000U    // Lock bit for USER_REG2_XRSn
#define SYSCTL_CPUSYSLOCK1_USER_REG1_PORESETN   0x10000000U   // Lock bit for USER_REG1_PORESETn
#define SYSCTL_CPUSYSLOCK1_USER_REG2_PORESETN   0x20000000U   // Lock bit for USER_REG2_PORESETn
#define SYSCTL_CPUSYSLOCK1_USER_REG3_PORESETN   0x40000000U   // Lock bit for USER_REG3_PORESETn
#define SYSCTL_CPUSYSLOCK1_USER_REG4_PORESETN   0x80000000U   // Lock bit for USER_REG4_PORESETn

//*************************************************************************************************
//
// The following are defines for the bit fields in the CPUID register
//
//*************************************************************************************************
#define SYSCTL_CPUID_CPUID_S   0U
#define SYSCTL_CPUID_CPUID_M   0x3U   // Indicates CPU1, CPU2, CPU3, CPU4, CPU5 or CPU6

//*************************************************************************************************
//
// The following are defines for the bit fields in the LPMCR register
//
//*************************************************************************************************
#define SYSCTL_LPMCR_LPM_S         0U
#define SYSCTL_LPMCR_LPM_M         0x3U      // Low Power Mode setting
#define SYSCTL_LPMCR_QUALSTDBY_S   2U
#define SYSCTL_LPMCR_QUALSTDBY_M   0xFCU     // STANDBY Wakeup Pin Qualification Setting
#define SYSCTL_LPMCR_WDINTE        0x8000U   // Enable for WDINT wakeup from STANDBY

//*************************************************************************************************
//
// The following are defines for the bit fields in the CMPSSLPMSEL register
//
//*************************************************************************************************
#define SYSCTL_CMPSSLPMSEL_CMPSS1H    0x1U        // CMPSS1H Enable for LPM Wakeup
#define SYSCTL_CMPSSLPMSEL_CMPSS1L    0x2U        // CMPSS1L Enable for LPM Wakeup
#define SYSCTL_CMPSSLPMSEL_CMPSS2H    0x4U        // CMPSS2H Enable for LPM Wakeup
#define SYSCTL_CMPSSLPMSEL_CMPSS2L    0x8U        // CMPSS2L Enable for LPM Wakeup
#define SYSCTL_CMPSSLPMSEL_CMPSS3H    0x10U       // CMPSS3H Enable for LPM Wakeup
#define SYSCTL_CMPSSLPMSEL_CMPSS3L    0x20U       // CMPSS3L Enable for LPM Wakeup
#define SYSCTL_CMPSSLPMSEL_CMPSS4H    0x40U       // CMPSS4H Enable for LPM Wakeup
#define SYSCTL_CMPSSLPMSEL_CMPSS4L    0x80U       // CMPSS4L Enable for LPM Wakeup
#define SYSCTL_CMPSSLPMSEL_CMPSS5H    0x100U      // CMPSS5H Enable for LPM Wakeup
#define SYSCTL_CMPSSLPMSEL_CMPSS5L    0x200U      // CMPSS5L Enable for LPM Wakeup
#define SYSCTL_CMPSSLPMSEL_CMPSS6H    0x400U      // CMPSS6H Enable for LPM Wakeup
#define SYSCTL_CMPSSLPMSEL_CMPSS6L    0x800U      // CMPSS6L Enable for LPM Wakeup
#define SYSCTL_CMPSSLPMSEL_CMPSS7H    0x1000U     // CMPSS7H Enable for LPM Wakeup
#define SYSCTL_CMPSSLPMSEL_CMPSS7L    0x2000U     // CMPSS7L Enable for LPM Wakeup
#define SYSCTL_CMPSSLPMSEL_CMPSS8H    0x4000U     // CMPSS8H Enable for LPM Wakeup
#define SYSCTL_CMPSSLPMSEL_CMPSS8L    0x8000U     // CMPSS8L Enable for LPM Wakeup
#define SYSCTL_CMPSSLPMSEL_CMPSS9H    0x10000U    // CMPSS9H Enable for LPM Wakeup
#define SYSCTL_CMPSSLPMSEL_CMPSS9L    0x20000U    // CMPSS9L Enable for LPM Wakeup
#define SYSCTL_CMPSSLPMSEL_CMPSS10H   0x40000U    // CMPSS10H Enable for LPM Wakeup
#define SYSCTL_CMPSSLPMSEL_CMPSS10L   0x80000U    // CMPSS10L Enable for LPM Wakeup
#define SYSCTL_CMPSSLPMSEL_CMPSS11H   0x100000U   // CMPSS11H Enable for LPM Wakeup
#define SYSCTL_CMPSSLPMSEL_CMPSS11L   0x200000U   // CMPSS11L Enable for LPM Wakeup
#define SYSCTL_CMPSSLPMSEL_CMPSS12H   0x400000U   // CMPSS12H Enable for LPM Wakeup
#define SYSCTL_CMPSSLPMSEL_CMPSS12L   0x800000U   // CMPSS12L Enable for LPM Wakeup

//*************************************************************************************************
//
// The following are defines for the bit fields in the GPIOLPMSEL0 register
//
//*************************************************************************************************
#define SYSCTL_GPIOLPMSEL0_GPIO0    0x1U          // GPIO0 Enable for LPM Wakeup
#define SYSCTL_GPIOLPMSEL0_GPIO1    0x2U          // GPIO1 Enable for LPM Wakeup
#define SYSCTL_GPIOLPMSEL0_GPIO2    0x4U          // GPIO2 Enable for LPM Wakeup
#define SYSCTL_GPIOLPMSEL0_GPIO3    0x8U          // GPIO3 Enable for LPM Wakeup
#define SYSCTL_GPIOLPMSEL0_GPIO4    0x10U         // GPIO4 Enable for LPM Wakeup
#define SYSCTL_GPIOLPMSEL0_GPIO5    0x20U         // GPIO5 Enable for LPM Wakeup
#define SYSCTL_GPIOLPMSEL0_GPIO6    0x40U         // GPIO6 Enable for LPM Wakeup
#define SYSCTL_GPIOLPMSEL0_GPIO7    0x80U         // GPIO7 Enable for LPM Wakeup
#define SYSCTL_GPIOLPMSEL0_GPIO8    0x100U        // GPIO8 Enable for LPM Wakeup
#define SYSCTL_GPIOLPMSEL0_GPIO9    0x200U        // GPIO9 Enable for LPM Wakeup
#define SYSCTL_GPIOLPMSEL0_GPIO10   0x400U        // GPIO10 Enable for LPM Wakeup
#define SYSCTL_GPIOLPMSEL0_GPIO11   0x800U        // GPIO11 Enable for LPM Wakeup
#define SYSCTL_GPIOLPMSEL0_GPIO12   0x1000U       // GPIO12 Enable for LPM Wakeup
#define SYSCTL_GPIOLPMSEL0_GPIO13   0x2000U       // GPIO13 Enable for LPM Wakeup
#define SYSCTL_GPIOLPMSEL0_GPIO14   0x4000U       // GPIO14 Enable for LPM Wakeup
#define SYSCTL_GPIOLPMSEL0_GPIO15   0x8000U       // GPIO15 Enable for LPM Wakeup
#define SYSCTL_GPIOLPMSEL0_GPIO16   0x10000U      // GPIO16 Enable for LPM Wakeup
#define SYSCTL_GPIOLPMSEL0_GPIO17   0x20000U      // GPIO17 Enable for LPM Wakeup
#define SYSCTL_GPIOLPMSEL0_GPIO18   0x40000U      // GPIO18 Enable for LPM Wakeup
#define SYSCTL_GPIOLPMSEL0_GPIO19   0x80000U      // GPIO19 Enable for LPM Wakeup
#define SYSCTL_GPIOLPMSEL0_GPIO20   0x100000U     // GPIO20 Enable for LPM Wakeup
#define SYSCTL_GPIOLPMSEL0_GPIO21   0x200000U     // GPIO21 Enable for LPM Wakeup
#define SYSCTL_GPIOLPMSEL0_GPIO22   0x400000U     // GPIO22 Enable for LPM Wakeup
#define SYSCTL_GPIOLPMSEL0_GPIO23   0x800000U     // GPIO23 Enable for LPM Wakeup
#define SYSCTL_GPIOLPMSEL0_GPIO24   0x1000000U    // GPIO24 Enable for LPM Wakeup
#define SYSCTL_GPIOLPMSEL0_GPIO25   0x2000000U    // GPIO25 Enable for LPM Wakeup
#define SYSCTL_GPIOLPMSEL0_GPIO26   0x4000000U    // GPIO26 Enable for LPM Wakeup
#define SYSCTL_GPIOLPMSEL0_GPIO27   0x8000000U    // GPIO27 Enable for LPM Wakeup
#define SYSCTL_GPIOLPMSEL0_GPIO28   0x10000000U   // GPIO28 Enable for LPM Wakeup
#define SYSCTL_GPIOLPMSEL0_GPIO29   0x20000000U   // GPIO29 Enable for LPM Wakeup
#define SYSCTL_GPIOLPMSEL0_GPIO30   0x40000000U   // GPIO30 Enable for LPM Wakeup
#define SYSCTL_GPIOLPMSEL0_GPIO31   0x80000000U   // GPIO31 Enable for LPM Wakeup

