TexasInstruments/f29h85x-sdk/source/driverlib/inc/hw_sysctl.h
//*************************************************************************************************
//
// The following are defines for the bit fields in the GPIOLPMSEL1 register
//
//*************************************************************************************************
#define SYSCTL_GPIOLPMSEL1_GPIO32   0x1U          // GPIO32 Enable for LPM Wakeup
#define SYSCTL_GPIOLPMSEL1_GPIO33   0x2U          // GPIO33 Enable for LPM Wakeup
#define SYSCTL_GPIOLPMSEL1_GPIO34   0x4U          // GPIO34 Enable for LPM Wakeup
#define SYSCTL_GPIOLPMSEL1_GPIO35   0x8U          // GPIO35 Enable for LPM Wakeup
#define SYSCTL_GPIOLPMSEL1_GPIO36   0x10U         // GPIO36 Enable for LPM Wakeup
#define SYSCTL_GPIOLPMSEL1_GPIO37   0x20U         // GPIO37 Enable for LPM Wakeup
#define SYSCTL_GPIOLPMSEL1_GPIO38   0x40U         // GPIO38 Enable for LPM Wakeup
#define SYSCTL_GPIOLPMSEL1_GPIO39   0x80U         // GPIO39 Enable for LPM Wakeup
#define SYSCTL_GPIOLPMSEL1_GPIO40   0x100U        // GPIO40 Enable for LPM Wakeup
#define SYSCTL_GPIOLPMSEL1_GPIO41   0x200U        // GPIO41 Enable for LPM Wakeup
#define SYSCTL_GPIOLPMSEL1_GPIO42   0x400U        // GPIO42 Enable for LPM Wakeup
#define SYSCTL_GPIOLPMSEL1_GPIO43   0x800U        // GPIO43 Enable for LPM Wakeup
#define SYSCTL_GPIOLPMSEL1_GPIO44   0x1000U       // GPIO44 Enable for LPM Wakeup
#define SYSCTL_GPIOLPMSEL1_GPIO45   0x2000U       // GPIO45 Enable for LPM Wakeup
#define SYSCTL_GPIOLPMSEL1_GPIO46   0x4000U       // GPIO46 Enable for LPM Wakeup
#define SYSCTL_GPIOLPMSEL1_GPIO47   0x8000U       // GPIO47 Enable for LPM Wakeup
#define SYSCTL_GPIOLPMSEL1_GPIO48   0x10000U      // GPIO48 Enable for LPM Wakeup
#define SYSCTL_GPIOLPMSEL1_GPIO49   0x20000U      // GPIO49 Enable for LPM Wakeup
#define SYSCTL_GPIOLPMSEL1_GPIO50   0x40000U      // GPIO50 Enable for LPM Wakeup
#define SYSCTL_GPIOLPMSEL1_GPIO51   0x80000U      // GPIO51 Enable for LPM Wakeup
#define SYSCTL_GPIOLPMSEL1_GPIO52   0x100000U     // GPIO52 Enable for LPM Wakeup
#define SYSCTL_GPIOLPMSEL1_GPIO53   0x200000U     // GPIO53 Enable for LPM Wakeup
#define SYSCTL_GPIOLPMSEL1_GPIO54   0x400000U     // GPIO54 Enable for LPM Wakeup
#define SYSCTL_GPIOLPMSEL1_GPIO55   0x800000U     // GPIO55 Enable for LPM Wakeup
#define SYSCTL_GPIOLPMSEL1_GPIO56   0x1000000U    // GPIO56 Enable for LPM Wakeup
#define SYSCTL_GPIOLPMSEL1_GPIO57   0x2000000U    // GPIO57 Enable for LPM Wakeup
#define SYSCTL_GPIOLPMSEL1_GPIO58   0x4000000U    // GPIO58 Enable for LPM Wakeup
#define SYSCTL_GPIOLPMSEL1_GPIO59   0x8000000U    // GPIO59 Enable for LPM Wakeup
#define SYSCTL_GPIOLPMSEL1_GPIO60   0x10000000U   // GPIO60 Enable for LPM Wakeup
#define SYSCTL_GPIOLPMSEL1_GPIO61   0x20000000U   // GPIO61 Enable for LPM Wakeup
#define SYSCTL_GPIOLPMSEL1_GPIO62   0x40000000U   // GPIO62 Enable for LPM Wakeup
#define SYSCTL_GPIOLPMSEL1_GPIO63   0x80000000U   // GPIO63 Enable for LPM Wakeup

//*************************************************************************************************
//
// The following are defines for the bit fields in the TMR2CLKCTL register
//
//*************************************************************************************************
#define SYSCTL_TMR2CLKCTL_TMR2CLKSRCSEL_S     0U
#define SYSCTL_TMR2CLKCTL_TMR2CLKSRCSEL_M     0x7U    // CPU Timer 2 Clock Source Select Bit
#define SYSCTL_TMR2CLKCTL_TMR2CLKPRESCALE_S   3U
#define SYSCTL_TMR2CLKCTL_TMR2CLKPRESCALE_M   0x38U   // CPU Timer 2 Clock Pre-Scale Value

//*************************************************************************************************
//
// The following are defines for the bit fields in the RESCCLR register
//
//*************************************************************************************************
#define SYSCTL_RESCCLR_POR              0x1U      // POR POR Reset Cause Clear Bit
#define SYSCTL_RESCCLR_XRSN             0x2U      // XRSn POR Reset Cause Clear Bit
#define SYSCTL_RESCCLR_WDRSN            0x4U      // WDRSn POR Reset Cause Clear Bit
#define SYSCTL_RESCCLR_NMIWDRSN         0x8U      // NMIWDRSn POR Reset Cause Clear Bit
#define SYSCTL_RESCCLR_ECAT_RESET_OUT   0x200U    // ECAT_RESET_OUT POR Reset Cause Clear Bit
#define SYSCTL_RESCCLR_SIMRESET_XRSN    0x800U    // SIMRESET_XRSn POR Reset Cause Clear Bit
#define SYSCTL_RESCCLR_ESMXRSN          0x1000U   // ESMXRSn Reset Cause Clear Bit

//*************************************************************************************************
//
// The following are defines for the bit fields in the RESC register
//
//*************************************************************************************************
#define SYSCTL_RESC_POR               0x1U          // POR Reset Cause Indication Bit
#define SYSCTL_RESC_XRSN              0x2U          // XRSn Reset Cause Indication Bit
#define SYSCTL_RESC_WDRSN             0x4U          // WDRSn Reset Cause Indication Bit
#define SYSCTL_RESC_NMIWDRSN          0x8U          // NMIWDRSn Reset Cause Indication Bit
#define SYSCTL_RESC_ECAT_RESET_OUT    0x200U        // ECAT_RESET_OUT Reset Cause Indication Bit
#define SYSCTL_RESC_SIMRESET_XRSN     0x800U        // SIMRESET_XRSn Reset Cause Indication Bit
#define SYSCTL_RESC_ESMRESET          0x1000U       // ESMRESET Reset Cause Indication Bit
#define SYSCTL_RESC_XRSN_PIN_STATUS   0x40000000U   // XRSN Pin Status
#define SYSCTL_RESC_DCON              0x80000000U   // Debugger connection status to C29x CPU

//*************************************************************************************************
//
// The following are defines for the bit fields in the MCANWAKESTATUS register
//
//*************************************************************************************************
#define SYSCTL_MCANWAKESTATUS_WAKE_MCANA   0x1U    // WAKE_MCANA Wake Status
#define SYSCTL_MCANWAKESTATUS_WAKE_MCANB   0x2U    // WAKE_MCANB Wake Status
#define SYSCTL_MCANWAKESTATUS_WAKE_MCANC   0x4U    // WAKE_MCANC Wake Status
#define SYSCTL_MCANWAKESTATUS_WAKE_MCAND   0x8U    // WAKE_MCAND Wake Status
#define SYSCTL_MCANWAKESTATUS_WAKE_MCANE   0x10U   // WAKE_MCANE Wake Status
#define SYSCTL_MCANWAKESTATUS_WAKE_MCANF   0x20U   // WAKE_MCANF Wake Status

//*************************************************************************************************
//
// The following are defines for the bit fields in the MCANWAKESTATUSCLR register
//
//*************************************************************************************************
#define SYSCTL_MCANWAKESTATUSCLR_WAKE_MCANA   0x1U    // Cear bit for MCANWAKESTATUS.WAKE_MCANA bit
#define SYSCTL_MCANWAKESTATUSCLR_WAKE_MCANB   0x2U    // Cear bit for MCANWAKESTATUS.WAKE_MCANB bit
#define SYSCTL_MCANWAKESTATUSCLR_WAKE_MCANC   0x4U    // Cear bit for MCANWAKESTATUS.WAKE_MCANC bit
#define SYSCTL_MCANWAKESTATUSCLR_WAKE_MCAND   0x8U    // Cear bit for MCANWAKESTATUS.WAKE_MCAND bit
#define SYSCTL_MCANWAKESTATUSCLR_WAKE_MCANE   0x10U   // Cear bit for MCANWAKESTATUS.WAKE_MCANE bit
#define SYSCTL_MCANWAKESTATUSCLR_WAKE_MCANF   0x20U   // Cear bit for MCANWAKESTATUS.WAKE_MCANF bit

//*************************************************************************************************
//
// The following are defines for the bit fields in the CLKSTOPREQ register
//
//*************************************************************************************************
#define SYSCTL_CLKSTOPREQ_MCAN_A   0x100U        // MCAN_A Clock Stop Request Bit
#define SYSCTL_CLKSTOPREQ_MCAN_B   0x200U        // MCAN_B Clock Stop Request Bit
#define SYSCTL_CLKSTOPREQ_MCAN_C   0x400U        // MCAN_C Clock Stop Request Bit
#define SYSCTL_CLKSTOPREQ_MCAN_D   0x800U        // MCAN_D Clock Stop Request Bit
#define SYSCTL_CLKSTOPREQ_MCAN_E   0x1000U       // MCAN_E Clock Stop Request Bit
#define SYSCTL_CLKSTOPREQ_MCAN_F   0x2000U       // MCAN_F Clock Stop Request Bit
#define SYSCTL_CLKSTOPREQ_KEY_S    16U
#define SYSCTL_CLKSTOPREQ_KEY_M    0xFFFF0000U   // Key for register write

//*************************************************************************************************
//
// The following are defines for the bit fields in the CLKSTOPACK register
//
//*************************************************************************************************
#define SYSCTL_CLKSTOPACK_MCAN_A   0x100U    // MCAN_A Clock Stop Ack Bit
#define SYSCTL_CLKSTOPACK_MCAN_B   0x200U    // MCAN_B Clock Stop Ack Bit
#define SYSCTL_CLKSTOPACK_MCAN_C   0x400U    // MCAN_C Clock Stop Ack Bit
#define SYSCTL_CLKSTOPACK_MCAN_D   0x800U    // MCAN_D Clock Stop Ack Bit
#define SYSCTL_CLKSTOPACK_MCAN_E   0x1000U   // MCAN_E Clock Stop Ack Bit
#define SYSCTL_CLKSTOPACK_MCAN_F   0x2000U   // MCAN_F Clock Stop Ack Bit

//*************************************************************************************************
//
// The following are defines for the bit fields in the SIMRESET register
//
//*************************************************************************************************
#define SYSCTL_SIMRESET_XRSN    0x2U          // Generates a simulated XRSn
#define SYSCTL_SIMRESET_KEY_S   16U
#define SYSCTL_SIMRESET_KEY_M   0xFFFF0000U   // Key value to enable write

//*************************************************************************************************
//
// The following are defines for the bit fields in the PARITY_TEST_ALT2 register
//
//*************************************************************************************************
#define SYSCTL_PARITY_TEST_ALT2_TESTEN_S   0U
#define SYSCTL_PARITY_TEST_ALT2_TESTEN_M   0xFU   // Parity test enable configuration


//*************************************************************************************************
//
// The following are defines for the bit fields in the SCSR register
//
//*************************************************************************************************
#define SYSCTL_SCSR_WDOVERRIDE   0x1U   // WD Override for WDDIS bit
#define SYSCTL_SCSR_WDENINT      0x2U   // WD Interrupt Enable
#define SYSCTL_SCSR_WDINTS       0x4U   // WD Interrupt Status

//*************************************************************************************************
//
// The following are defines for the bit fields in the WDCNTR register
//
//*************************************************************************************************
#define SYSCTL_WDCNTR_WDCNTR_S   0U
#define SYSCTL_WDCNTR_WDCNTR_M   0xFFU   // WD Counter

//*************************************************************************************************
//
// The following are defines for the bit fields in the WDKEY register
//
//*************************************************************************************************
#define SYSCTL_WDKEY_WDKEY_S   0U
#define SYSCTL_WDKEY_WDKEY_M   0xFFU   // Key to pet the watchdog timer.

//*************************************************************************************************
//
// The following are defines for the bit fields in the SYNCBUSYWD register
//
//*************************************************************************************************
#define SYSCTL_SYNCBUSYWD_BUSY   0x1U   // Status bit indicating synchronization in progress
#define SYSCTL_SYNCBUSYWD_WDCR   0x2U   // BUSY status bit for WDCR

//*************************************************************************************************
//
// The following are defines for the bit fields in the WDCR register
//
//*************************************************************************************************
#define SYSCTL_WDCR_WDPS_S          0U
#define SYSCTL_WDCR_WDPS_M          0x7U     // WD Clock Prescalar
#define SYSCTL_WDCR_WDCHK_S         3U
#define SYSCTL_WDCR_WDCHK_M         0x38U    // WD Check Bits
#define SYSCTL_WDCR_WDDIS           0x40U    // WD Disable
#define SYSCTL_WDCR_WDPRECLKDIV_S   8U
#define SYSCTL_WDCR_WDPRECLKDIV_M   0xF00U   // WD Pre Clock Divider

//*************************************************************************************************
//
// The following are defines for the bit fields in the WDWCR register
//
//*************************************************************************************************
#define SYSCTL_WDWCR_MIN_S   0U
#define SYSCTL_WDWCR_MIN_M   0xFFU   // WD Min Threshold setting for Windowed Watchdog
                                     // functionality



#endif
